Import("\\script\\lib\\lingshi_head.lua")
Import("\\settings\\static_script\\lib\\itemfunctions.lua")
Include("\\script\\class\\ktabfile.lua");
Include("\\script\\lib\\string.lua");

tItems = { -- 名称、GDP、等级、普通|泰式、可随机|固定、定制需求数量
	[553] = {"1级灵石原石",	{2,95,553,1},	1,	1,	0,	1},
	[554] = {"2级灵石原石",	{2,95,554,1},	2,	1,	0,	2},
	[555] = {"3级灵石原石",	{2,95,555,1},	3,	1,	0,	3},
	[556] = {"4级灵石原石",	{2,95,556,1},	4,	1,	0,	5},
	[557] = {"5级灵石原石",	{2,95,557,1},	5,	1,	0,	10},
	[558] = {"6级灵石原石",	{2,95,558,1},	6,	1,	0,	15},
	[559] = {"7级灵石原石",	{2,95,559,1},	7,	1,	0,	20},
	[840] = {"5级太始灵石原石",	{2,95,840,1},	5,	2,	0,	0},
	[841] = {"6级太始灵石原石",	{2,95,841,1},	6,	2,	0,	0},
	[842] = {"7级太始灵石原石",	{2,95,842,1},	7,	2,	0,	0},	
}

--消耗随机次数权值表
tAttributeNum ={--属性名	id	位置	最低等级	是否随机	消耗随机次数	等级1-7权值
	{"武器磨损概率降低",9,2,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,2,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,0,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,1,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,3,1,0,1,1,1,1,1,2,2,2},
	{"生命上限增加",11,0,1,0,3,1,1,1,1,2,2,2},
	{"生命上限增加",11,1,1,0,3,1,1,1,1,2,2,2},
	{"生命上限增加",11,3,1,0,3,1,1,1,1,2,2,2},
	{"杀死敌人生命回复" ,333,2,1,0,2,1,1,1,1,2,2,2},
	{"600秒武器耐久回复",43,2,1,1,2,1,1,1,1,2,2,2},
	{"600秒上衣耐久回复",112,1,1,1,2,1,1,1,1,2,2,2},
	{"600秒帽子耐久回复",113,0,1,1,2,1,1,1,1,2,2,2},
	{"600秒下衣耐久回复",114,3,1,1,2,1,1,1,1,2,2,2},
	{"装备需求等级减少",334,0,6,1,3,1,1,1,1,2,2,2},
	{"装备需求等级减少"	,334,1,6,1,3,1,1,1,1,2,2,2},
	{"装备需求等级减少"	,334,3,6,1,3,1,1,1,1,2,2,2},
	{"范围攻击概率",335,2,1,0,3,1,1,1,1,2,2,2},
	{"武器外攻上限增加",65,2,1,0,3,1,1,1,1,2,2,2},
	{"武器外攻下限增加"	,66,2,1,0,3,1,1,1,1,2,2,2},
	{"武器内攻上限增加"	,67,2,1,0,3,1,1,1,1,2,2,2},
	{"武器内攻下限增加"	,68,2,1,0,3,1,1,1,1,2,2,2},
	{"药效时间延长",39,0,1,0,2,1,1,2,2,3,3,4},
	{"体力上限提高",336,1,1,0,4,1,1,2,2,3,3,4},
	{"攻速提高",77,2,1,1,3,1,1,2,2,3,3,4},
	{"命中值增加",337,2,1,0,4,1,1,2,2,3,3,4},
	{"闪避值增加",338,3,1,0,5,1,1,2,2,3,3,4},
	{"反弹伤害",339,1,1,0,5,1,1,2,2,3,3,4},
	{"每10秒内力回复",340,0,5,1,5,1,1,2,2,3,3,4},
	{"每10秒内力回复",340,1,5,1,5,1,1,2,2,3,3,4},
	{"每10秒内力回复",340,3,5,1,5,1,1,2,2,3,3,4},
	{"每10秒生命回复",341,0,5,1,5,1,1,2,2,3,3,4},
	{"每10秒生命回复",341,1,5,1,5,1,1,2,2,3,3,4},
	{"每10秒生命回复",341,3,5,1,5,1,1,2,2,3,3,4},
	{"会心概率提高",342,2,1,0,4,1,1,2,2,3,3,4},
	{"内功防御增加",343,0,1,0,4,1,1,2,2,3,3,4},
	{"内功防御增加",343,1,1,0,4,1,1,2,2,3,3,4},
	{"内功防御增加",343,3,1,0,4,1,1,2,2,3,3,4},
	{"外功防御增加",344,0,1,0,4,1,1,2,2,3,3,4},
	{"外功防御增加",344,1,1,0,4,1,1,2,2,3,3,4},
	{"外功防御增加",344,3,1,0,4,1,1,2,2,3,3,4},
	{"武功耗内降低",345,0,1,0,5,1,1,2,2,3,3,4},
	{"发挥最大攻击概率",346,2,1,0,5,1,1,2,2,3,3,4},
	{"一定概率使敌人气血受损",53,2,4,0,5,1,1,2,2,3,3,4},
	{"一定概率使敌人真元受损",54,2,4,0,5,1,1,2,2,3,3,4},
	{"毒伤害减少",347,0,1,0,4,1,1,2,2,3,3,4},
	{"毒伤害减少",347,1,1,0,4,1,1,2,2,3,3,4},
	{"毒伤害减少",347,3,1,0,4,1,1,2,2,3,3,4},
	{"攻击使敌人力量减少",348,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人根骨减少",349,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人内功减少",350,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人洞察减少",351,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人身法减少",352,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人外防减少",353,2,1,0,5,1,1,2,2,3,3,4}, 
	{"攻击使敌人内防减少",354,2,1,0,5,1,1,2,2,3,3,4},
	{"受伤动作时间缩短",355,1,1,0,5,1,1,2,2,3,3,4},
	{"武功打断概率降低",356,1,3,0,6,1,1,2,2,3,3,4},
	{"根骨增加",357,2,1,0,5,1,1,2,2,3,3,4},
	{"根骨增加",357,0,1,0,5,1,1,2,2,3,3,4},
	{"根骨增加",357,1,1,0,5,1,1,2,2,3,3,4},
	{"根骨增加",357,3,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,2,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,0,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,1,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,3,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,2,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,0,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,1,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,3,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,2,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,0,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,1,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,3,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,2,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,0,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,1,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,3,1,0,5,1,1,2,2,3,3,4},
	{"抗中毒概率",100,0,1,0,6,1,1,2,2,3,3,4},
	{"抗中毒概率",100,1,1,0,6,1,1,2,2,3,3,4},
	{"抗中毒概率",100,3,1,0,6,1,1,2,2,3,3,4},
	{"受伤转化内力",46,0,5,1,6,1,1,2,2,3,3,4},
	{"受伤转化内力",46,1,5,1,6,1,1,2,2,3,3,4},
	{"攻击损耗敌人内力",49,2,5,0,6,1,2,2,3,3,4,5},
	{"破防攻击概率",362,2,5,0,7,1,2,2,3,3,4,5},
	{"攻击附带毒伤害",363,2,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,2,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,0,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,1,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,3,1,0,7,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,2,1,0,6,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,0,1,0,6,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,1,1,0,6,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,3,1,0,6,1,2,2,3,3,4,5},
	{"必闪",364,1,3,0,6,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,0,1,0,7,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,2,1,0,7,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,1,1,0,7,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,3,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,0,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,2,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,1,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,3,1,0,7,1,2,2,3,3,4,5},
	{"攻击使敌人外防削减",382,2,1,0,7,1,2,2,3,3,4,5},
	{"攻击使敌人内防削减",383,2,1,0,7,1,2,2,3,3,4,5},
	{"承受伤害减半概率",365,0,5,0,7,1,2,2,3,3,4,5},
	{"承受伤害减半概率",365,1,5,0,7,1,2,2,3,3,4,5},
	{"承受伤害减半概率",365,3,5,0,7,1,2,2,3,3,4,5},
	{"经验获得提高",366,2,5,1,5,2,2,3,3,3,4,5},
	{"经验获得提高",366,0,5,1,5,2,2,3,3,3,4,5},
	{"经验获得提高",366,1,5,1,5,2,2,3,3,3,4,5},
	{"经验获得提高",366,3,5,1,5,2,2,3,3,3,4,5},
	{"减速回避概率",373,3,4,0,8,2,2,3,3,3,4,5},
	{"迟缓回避概率",374,3,4,0,8,2,2,3,3,3,4,5},
	{"击退回避概率",375,3,4,0,8,2,2,3,3,3,4,5},
	{"击倒回避概率",376,3,4,0,8,2,2,3,3,3,4,5},
	{"麻痹回避概率",377,0,4,0,8,2,2,3,3,3,4,5},
	{"眩晕回避概率",378,0,4,0,8,2,2,3,3,3,4,5},
	{"定身回避概率",379,0,4,0,8,2,2,3,3,3,4,5},
	{"混乱回避概率",380,1,4,0,8,2,2,3,3,3,4,5},
	{"睡眠回避概率",381,1,4,0,8,2,2,3,3,3,4,5},
	{"外防降低",18,1,1,0,8,2,2,3,3,3,4,5},
	{"内防降低",19,1,1,0,8,2,2,3,3,3,4,5},
	{"增加伤害",372,2,3,0,7,2,2,3,3,3,4,5},
	{"所有属性增加",367,2,3,0,8,2,2,3,3,3,4,5},
	{"所有属性增加",367,0,3,0,8,2,2,3,3,3,4,5},
	{"所有属性增加",367,1,3,0,8,2,2,3,3,3,4,5},
	{"所有属性增加",367,3,3,0,8,2,2,3,3,3,4,5},
	{"外攻提高",368,2,3,0,8,2,2,3,3,3,4,5},
	{"内攻提高",369,2,3,0,8,2,2,3,3,3,4,5},
	{"武功发招概率提高",370,2,4,0,8,2,2,3,3,3,4,5},
	{"武功施展速度提高",371,0,3,0,8,2,2,3,3,4,5,6}
}

--镶嵌位置对应table
tXqPos = {
	{"帽子",0},
	{"上衣",1},
	{"武器",2},
	{"裤子",3},
}

function OnUse(nItemIdx)
	local g,d,p	= getItemGDP(nItemIdx);
	local szName = GetItemName(g,d,p)
	if not tItems[p] then
		return
	end
	local nNeed = tItems[p][6]
	if 0 == tItems[p][5] then
		if DelItemByIndex(nItemIdx, 1) == 1 then
			if 1 == tItems[p][4] then
				lspf_AddLingShiInBottleEx(tItems[p][3], 1);
			else
				lspf_AddTaiShiLingShiInBottleEx(tItems[p][3], 1);
			end
		end
	else
		local selTab = {};
		local szTitle = ""
		local szTitle = format("<color=green>%s<color>：可选择消耗<color=green>%d<color>个[%s]来定制属性。", szName, nNeed, szName)
		tinsert(selTab, format("我要定制属性/#lingshi_zhiding_lv(%d, %d, %d)", tItems[p][3], nItemIdx, nNeed));
		tinsert(selTab, format("我不定制/#open_source_store(%d)", nItemIdx));
		tinsert(selTab,"取消/nothing");
		Say(szTitle, getn(selTab), selTab)
	end
end

function open_source_store(nItemIdx)
	local g,d,p	= getItemGDP(nItemIdx);
	if not tItems[p] then
		return
	end
	if DelItemByIndex(nItemIdx, 1) == 1 then
		if 1 == tItems[p][4] then
			lspf_AddLingShiInBottleEx(tItems[p][3], 1);
		else
			lspf_AddTaiShiLingShiInBottleEx(tItems[p][3], 1);
		end
	end
end

function lingshi_zhiding_lv(nLv, nItemIdx, nNeed)
	local g,d,p	= getItemGDP(nItemIdx);
	local szName = GetItemName(g,d,p)
	if not tItems[p] then
		return
	end
	if GetItemCount(g,d,p) < nNeed then
		Talk(1,"", format("<color=green>%s<color>：定制属性需要消耗<color=green>%d<color>颗灵石原石，您背包的%s不足。", szName, nNeed, szName));
		return
	end
	local selTab = {};
	local szTitle = ""
	local szTitle = format("<color=green>"..szName.."<color>：请选择你要定制的灵石镶嵌位置：")
	for i = 1, getn(tXqPos) do
		local n = tXqPos[i]
		tinsert(selTab, format("%s/#lingshi_zhiding_wz(%d, %d, %d, %d, %d)", n[1], nLv, n[2], 0, nItemIdx, nNeed));
	end
	tinsert(selTab,"我再想想/nothing");
	Say(szTitle, getn(selTab), selTab)
end

function lingshi_zhiding_wz(nLv,nWz,nPage, nItemIdx, nNeed)
	local g,d,p	= getItemGDP(nItemIdx);
	local szName = GetItemName(g,d,p)
	if not tItems[p] then
		return
	end
	local tAttri = {};
	local tIdx = {}; --对应tRandNum表的索引
	for i = 1,getn(tAttributeNum) do
		if tAttributeNum[i][3] == nWz and tAttributeNum[i][4] <= nLv then
			tinsert(tAttri,tAttributeNum[i]);
			tinsert(tIdx,i)
		end
	end
	local strtab = {};
	local nPageNum = 6;
	local nRemaid = getn(tAttri)-nPageNum*nPage;
	local nDiaNum = 6;
	if nRemaid < nDiaNum then
		nDiaNum = nRemaid;
	end
	for i = 1,nDiaNum do
		tinsert(strtab,tAttri[nPage*nPageNum+i][1].."/#confirm_lingshi_zhiding("..tAttri[nPage*nPageNum+i][2]..","..nLv..","..nWz..","..tIdx[nPage*nPageNum+i]..","..nItemIdx..","..nNeed..")");
	end
	if nPage > 0 then
		tinsert(strtab,"上一页/#lingshi_zhiding_wz("..nLv..","..nWz..","..(nPage-1)..","..nItemIdx..","..nNeed..")");
	end
	if nRemaid > 6 then
		tinsert(strtab,"下一页/#lingshi_zhiding_wz("..nLv..","..nWz..","..(nPage+1)..","..nItemIdx..","..nNeed..")");
	end
	tinsert(strtab,"重新选择/#lingshi_zhiding_lv("..nLv..")");
	Say("<color=green>"..szName.."<color>：请选择你想要定制灵石属性：",
		getn(strtab),
		strtab);	
end

function confirm_lingshi_zhiding(nId,nLv,nWz,nIdx, nItemIdx, nNeed)
	local g,d,p	= getItemGDP(nItemIdx);
	local tWz = {"帽子","衣服","武器","裤子"};
	if DelItem(g,d,p, nNeed) == 1 then
		AddLingShi(nId,nWz,nLv);
		Msg2Player("您定制了属性为["..tAttributeNum[nIdx][1].."]，镶嵌位置为["..tWz[nWz+1].."]的"..nLv.."级灵石1颗");
	end
end
