-- ====================== 文件信息 ======================
-- 剑侠情缘网络版2 - 新服活动大使脚本
-- 文件名　　：路人_新服活动大使.lua
-- 翻译修改　： 
-- 联系方式　：QQ: 葫芦娃救爷爷
-- 编译时间：2020-05-16 02:00
-- ======================================================
Include("\\script\\lib\\dailogsay.lua");
Include("\\script\\lib\\awardtemplet.lua");
Include("\\script\\equip_shop\\equip_shop_head.lua")

Include("\\script\\lib\\lingshi_head.lua")
Include("\\script\\lib\\lingshi_info.lua")
Include("\\script\\lib\\lingshipeifang_info.lua")
lingshi_pf = new(KTabFile,"\\settings\\item\\lingshipeifang.txt")

strTitle = "<color=green>新服大使<color>："

tbFaction =
{
	[1] =
	{
		szShowName = "少林",
		szFactionRoute =   {2, 3, 4},
	},
	[2] =
	{
		szShowName = "武当",
		szFactionRoute =   {14, 15},
	},
	[3] =
	{
		szShowName = "峨嵋",
		szFactionRoute =   {8,9},
	},
	[4] =
	{
		szShowName = "丐帮",
		szFactionRoute =   {11, 12},
	},
	[5] =
	{
		szShowName = "唐门",
		szFactionRoute =   {6,31},
	},
	[6] =
	{
		szShowName = "杨门",
		szFactionRoute =   {17, 18},
	},
	[7] =
	{
		szShowName = "五毒",
		szFactionRoute =   {20,21},
	},
	[8] =
	{
		szShowName = "昆仑",
		szFactionRoute =   {23,32},
	},
	[9] =
	{
		szShowName = "明教",
		szFactionRoute =   {25, 26, 27},
	},
	[10] =
	{
		szShowName = "翠烟",
		szFactionRoute =   {29, 30},
	},
}

tbFactionSex =
{
	[1] = {1, 2, 4, 5, 6, 7, 8,9},
	[2] = {2, 3, 4, 5, 6, 7, 9,10},
}

tbFactionRoute = {	--路线
	[2] = "少林俗家",
	[3] = "少林禅僧",
	[4] = "少林武僧",
	[6] = "唐门",
	[8] = "峨嵋佛家",
	[9] = "峨嵋俗家",
	[11] = "丐帮净尧",
	[12] = "丐帮污尧",
	[14] = "武当道家",
	[15] = "武当俗家",
	[17] = "杨门枪骑",
	[18] = "杨门弓骑",
	[20] = "五毒邪侠",
    [21] = "五毒蛊师",
	[23] = "昆仑天师",
	[25] = "明教圣战",
	[26] = "明教阵兵",
	[27] = "明教血人",
	[29] = "翠烟舞仙",
	[30] = "翠烟灵女",
    [31] = "唐门任侠",
	[32] = "昆仑剑尊",
}

tBaguaZhuangbei = {
	[1] = {
	    {"天地玄黄盔",0,103,85},
		{"天地玄黄甲",0,100,85},
		{"天地玄黄装",0,101,85},
	},
	[2] = {
	
	   {"天地玄黄盔",0,103,86},
	   {"天地玄黄甲",0,100,86},
	   {"天地玄黄装",0,101,86},
	},
	[3] = {
	    {"天地玄黄盔",0,103,87},
		{"天地玄黄甲",0,100,87},
		{"天地玄黄装",0,101,87},
	},
	[4] = {
	    {"天地玄黄盔",0,103,88},
		{"天地玄黄甲",0,100,88},
		{"天地玄黄装",0,101,88},
	},
}

tBaguaWuqi = {
	[2] = {
		{"天地玄黄刀",0,3,120},
	},
	[3] = {
		{"天地玄黄杖",0,8,120},
	},
	[4] = {
		{"天地玄黄手",0,0,120},
	},
	[6] = {
		{"天地玄黄器",0,1,120},
	},
	[8] = {
		{"天地玄黄剑",0,2,120},
	},
	[9] = {
		{"天地玄黄琴",0,10,120},
	},
	[11] =  {
		{"天地玄黄手",0,0,121},
	},
	[12] = {
		{"天地玄黄棍",0,5,120},
	},
	[14] = {
		{"天地玄黄剑",0,2,121},
	},
	[15] = {
		{"天地玄黄笔",0,9,120},
	},
	[17] = {
		{"天地玄黄枪	",0,6,120},
	},
	[18] = {
		{"天地玄黄弓",0,4,122},
		
	},
	[20] = {
		{"天地玄黄刃",0,7,120},
	},
	[23] = {
		{"天地玄黄剑",0,2,122},
	},
	[25] = {
		{"天地玄黄刀",0,3,121},
	},
	[26] = {
		{"天地玄黄笔",0,9,121},
	},
	[27] = {
		{"天地玄黄爪",0,11,121},
	},
	[29] = {
		{"天地玄黄扇",0,13,120},
	},
	[30] = {
		{"天地玄黄笛	",0,12,120},
	},
    [21] = {
		{"天地玄黄爪",0,11,120},
	},
	
	[31] = {
		{"天地玄黄刺",0,14,120},
	},
	
	[32] = {
		{"天地玄黄剑",0,2,123},
	},		
}

tBaguaNum = {
	{"太虚八卦盘-坎",2,1,471,99},
	{"太虚八卦盘-坤",2,1,470,99},
	{"太虚八卦盘-震",2,1,474,99},
	{"太虚八卦盘-巽",2,1,476,99},
	{"太虚八卦盘-乾",2,1,469,99},
	{"太虚八卦盘-兑",2,1,472,99},
	{"太虚八卦盘-艮",2,1,475,99},
	{"太虚八卦盘-离",2,1,473,99},
	{"神木八卦",2,95,550,99},
	{"紫金八卦",2,95,551,99},
	{"月华",2,1,2002,99},
	{"月华之精",2,1,3219,99},
}

--消耗随机次数权值表
tRandNum ={--属性名	id	位置	最低等级	是否随机	消耗随机次数	等级1-7权值
	{"武器磨损概率降低",9,2,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,2,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,0,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,1,1,0,1,1,1,1,1,2,2,2},
	{"负重上限增加",110,3,1,0,1,1,1,1,1,2,2,2},
	{"生命上限增加",11,0,1,0,3,1,1,1,1,2,2,2},
	{"生命上限增加",11,1,1,0,3,1,1,1,1,2,2,2},
	{"生命上限增加",11,3,1,0,3,1,1,1,1,2,2,2},
	{"杀死敌人生命回复" ,333,2,1,0,2,1,1,1,1,2,2,2},
	{"600秒武器耐久回复",43,2,1,1,2,1,1,1,1,2,2,2},
	{"600秒上衣耐久回复",112,1,1,1,2,1,1,1,1,2,2,2},
	{"600秒帽子耐久回复",113,0,1,1,2,1,1,1,1,2,2,2},
	{"600秒下衣耐久回复",114,3,1,1,2,1,1,1,1,2,2,2},
	{"装备需求等级减少",334,0,6,1,3,1,1,1,1,2,2,2},
	{"装备需求等级减少"	,334,1,6,1,3,1,1,1,1,2,2,2},
	{"装备需求等级减少"	,334,3,6,1,3,1,1,1,1,2,2,2},
	{"范围攻击概率",335,2,1,0,3,1,1,1,1,2,2,2},
	{"武器外攻上限增加",65,2,1,0,3,1,1,1,1,2,2,2},
	{"武器外攻下限增加"	,66,2,1,0,3,1,1,1,1,2,2,2},
	{"武器内攻上限增加"	,67,2,1,0,3,1,1,1,1,2,2,2},
	{"武器内攻下限增加"	,68,2,1,0,3,1,1,1,1,2,2,2},
	{"药效时间延长",39,0,1,0,2,1,1,2,2,3,3,4},
	{"体力上限提高",336,1,1,0,4,1,1,2,2,3,3,4},
	{"攻速提高",77,2,1,1,3,1,1,2,2,3,3,4},
	{"命中值增加",337,2,1,0,4,1,1,2,2,3,3,4},
	{"闪避值增加",338,3,1,0,5,1,1,2,2,3,3,4},
	{"反弹伤害",339,1,1,0,5,1,1,2,2,3,3,4},
	{"每10秒内力回复",340,0,5,1,5,1,1,2,2,3,3,4},
	{"每10秒内力回复",340,1,5,1,5,1,1,2,2,3,3,4},
	{"每10秒内力回复",340,3,5,1,5,1,1,2,2,3,3,4},
	{"每10秒生命回复",341,0,5,1,5,1,1,2,2,3,3,4},
	{"每10秒生命回复",341,1,5,1,5,1,1,2,2,3,3,4},
	{"每10秒生命回复",341,3,5,1,5,1,1,2,2,3,3,4},
	{"会心概率提高",342,2,1,0,4,1,1,2,2,3,3,4},
	{"内功防御增加",343,0,1,0,4,1,1,2,2,3,3,4},
	{"内功防御增加",343,1,1,0,4,1,1,2,2,3,3,4},
	{"内功防御增加",343,3,1,0,4,1,1,2,2,3,3,4},
	{"外功防御增加",344,0,1,0,4,1,1,2,2,3,3,4},
	{"外功防御增加",344,1,1,0,4,1,1,2,2,3,3,4},
	{"外功防御增加",344,3,1,0,4,1,1,2,2,3,3,4},
	{"武功耗内降低",345,0,1,0,5,1,1,2,2,3,3,4},
	{"发挥最大攻击概率",346,2,1,0,5,1,1,2,2,3,3,4},
	{"一定概率使敌人气血受损",53,2,4,0,5,1,1,2,2,3,3,4},
	{"一定概率使敌人真元受损",54,2,4,0,5,1,1,2,2,3,3,4},
	{"毒伤害减少",347,0,1,0,4,1,1,2,2,3,3,4},
	{"毒伤害减少",347,1,1,0,4,1,1,2,2,3,3,4},
	{"毒伤害减少",347,3,1,0,4,1,1,2,2,3,3,4},
	{"攻击使敌人力量减少",348,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人根骨减少",349,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人内功减少",350,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人洞察减少",351,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人身法减少",352,2,1,0,5,1,1,2,2,3,3,4},
	{"攻击使敌人外防减少",353,2,1,0,5,1,1,2,2,3,3,4}, 
	{"攻击使敌人内防减少",354,2,1,0,5,1,1,2,2,3,3,4},
	{"受伤动作时间缩短",355,1,1,0,5,1,1,2,2,3,3,4},
	{"武功打断概率降低",356,1,3,0,6,1,1,2,2,3,3,4},
	{"根骨增加",357,2,1,0,5,1,1,2,2,3,3,4},
	{"根骨增加",357,0,1,0,5,1,1,2,2,3,3,4},
	{"根骨增加",357,1,1,0,5,1,1,2,2,3,3,4},
	{"根骨增加",357,3,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,2,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,0,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,1,1,0,5,1,1,2,2,3,3,4},
	{"力量增加",358,3,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,2,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,0,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,1,1,0,5,1,1,2,2,3,3,4},
	{"身法增加",359,3,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,2,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,0,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,1,1,0,5,1,1,2,2,3,3,4},
	{"洞察增加",360,3,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,2,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,0,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,1,1,0,5,1,1,2,2,3,3,4},
	{"内功增加",361,3,1,0,5,1,1,2,2,3,3,4},
	{"抗中毒概率",100,0,1,0,6,1,1,2,2,3,3,4},
	{"抗中毒概率",100,1,1,0,6,1,1,2,2,3,3,4},
	{"抗中毒概率",100,3,1,0,6,1,1,2,2,3,3,4},
	{"受伤转化内力",46,0,5,1,6,1,1,2,2,3,3,4},
	{"受伤转化内力",46,1,5,1,6,1,1,2,2,3,3,4},
	{"攻击损耗敌人内力",49,2,5,0,6,1,2,2,3,3,4,5},
	{"破防攻击概率",362,2,5,0,7,1,2,2,3,3,4,5},
	{"攻击附带毒伤害",363,2,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,2,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,0,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,1,1,0,7,1,2,2,3,3,4,5},
	{"生命上限提高-%",79,3,1,0,7,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,2,1,0,6,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,0,1,0,6,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,1,1,0,6,1,2,2,3,3,4,5},
	{"内力上限提高-%",80,3,1,0,6,1,2,2,3,3,4,5},
	{"必闪",364,1,3,0,6,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,0,1,0,7,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,2,1,0,7,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,1,1,0,7,1,2,2,3,3,4,5},
	{"攻击辅助持续时间延长",41,3,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,0,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,2,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,1,1,0,7,1,2,2,3,3,4,5},
	{"防御辅助持续时间延长",42,3,1,0,7,1,2,2,3,3,4,5},
	{"攻击使敌人外防削减",382,2,1,0,7,1,2,2,3,3,4,5},
	{"攻击使敌人内防削减",383,2,1,0,7,1,2,2,3,3,4,5},
	{"承受伤害减半概率",365,0,5,0,7,1,2,2,3,3,4,5},
	{"承受伤害减半概率",365,1,5,0,7,1,2,2,3,3,4,5},
	{"承受伤害减半概率",365,3,5,0,7,1,2,2,3,3,4,5},
	{"经验获得提高",366,2,5,1,5,2,2,3,3,3,4,5},
	{"经验获得提高",366,0,5,1,5,2,2,3,3,3,4,5},
	{"经验获得提高",366,1,5,1,5,2,2,3,3,3,4,5},
	{"经验获得提高",366,3,5,1,5,2,2,3,3,3,4,5},
	{"减速回避概率",373,3,4,0,8,2,2,3,3,3,4,5},
	{"迟缓回避概率",374,3,4,0,8,2,2,3,3,3,4,5},
	{"击退回避概率",375,3,4,0,8,2,2,3,3,3,4,5},
	{"击倒回避概率",376,3,4,0,8,2,2,3,3,3,4,5},
	{"麻痹回避概率",377,0,4,0,8,2,2,3,3,3,4,5},
	{"眩晕回避概率",378,0,4,0,8,2,2,3,3,3,4,5},
	{"定身回避概率",379,0,4,0,8,2,2,3,3,3,4,5},
	{"混乱回避概率",380,1,4,0,8,2,2,3,3,3,4,5},
	{"睡眠回避概率",381,1,4,0,8,2,2,3,3,3,4,5},
	{"外防降低",18,1,1,0,8,2,2,3,3,3,4,5},
	{"内防降低",19,1,1,0,8,2,2,3,3,3,4,5},
	{"增加伤害",372,2,3,0,7,2,2,3,3,3,4,5},
	{"所有属性增加",367,2,3,0,8,2,2,3,3,3,4,5},
	{"所有属性增加",367,0,3,0,8,2,2,3,3,3,4,5},
	{"所有属性增加",367,1,3,0,8,2,2,3,3,3,4,5},
	{"所有属性增加",367,3,3,0,8,2,2,3,3,3,4,5},
	{"外攻提高",368,2,3,0,8,2,2,3,3,3,4,5},
	{"内攻提高",369,2,3,0,8,2,2,3,3,3,4,5},
	{"武功发招概率提高",370,2,4,0,8,2,2,3,3,3,4,5},
	{"武功施展速度提高",371,0,3,0,8,2,2,3,3,4,5,6},
	--------------------------以下为太史
{"[太始]外防降低"                ,4865,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]内防降低"                ,4866,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]所有属性增加"            ,4867,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]所有属性增加"            ,4867,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]所有属性增加"            ,4867,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]所有属性增加"            ,4867,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]外攻提高"                ,4868,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]内攻提高"                ,4869,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]武功施展速度提高"        ,4870,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]增加伤害"                ,4870,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]攻击使敌人外防削减"      ,4874,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]攻击使敌人内防削减"      ,4875,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]承受伤害减半概率"        ,4876,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]承受伤害减半概率"        ,4876,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]承受伤害减半概率"        ,4876,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]根骨增加"                ,4877,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]根骨增加"                ,4877,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]根骨增加"                ,4877,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]根骨增加"                ,4877,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]力量增加"                ,4878,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]力量增加"                ,4878,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]力量增加"                ,4878,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]力量增加"                ,4878,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]身法增加"                ,4879,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]身法增加"                ,4879,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]身法增加"                ,4879,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]身法增加"                ,4879,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]洞察增加"                ,4880,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]洞察增加"                ,4880,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]洞察增加"                ,4880,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]洞察增加"                ,4880,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]内功增加"                ,4881,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]内功增加"                ,4881,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]内功增加"                ,4881,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]内功增加"                ,4881,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]减速回避概率"            ,4882,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]迟缓回避概率"            ,4883,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]击退回避概率"            ,4884,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]击倒回避概率"            ,4885,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]麻痹回避概率"            ,4886,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]眩晕回避概率"            ,4887,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]定身回避概率"            ,4888,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]混乱回避概率"            ,4889,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]睡眠回避概率"            ,4890,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]受伤动作时间缩短"        ,4891,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]生命上限提高-%"          ,4892,  0,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]生命上限提高-%"          ,4892,  1,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]生命上限提高-%"          ,4892,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]生命上限提高-%"          ,4892,  3,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]破防攻击概率"            ,4893,  2,      5,       0,      8,             2,2,3,3,4,5,6},
{"[太始]武功打断概率降低"        ,4894,  1,      5,       0,      8,             2,2,3,3,4,5,6}
}

tbWeaponEffect =
{
	{2, 1, 1250, "一闪妖煌_铁骨", 10},
	{2, 1, 1251, "一闪妖煌_百战", 10},
	{2, 1, 1252, "一闪妖煌_灼日", 10},
	{2, 1, 1253, "一闪妖煌_俊逸", 10},
	{2, 1, 1254, "一闪妖煌_桃李", 10},
	{2, 1, 1255, "一闪妖煌_名宿", 10},
	{2, 1, 1256, "一闪妖煌_落霞", 10},
	{2, 1, 1257, "一闪妖煌_凌霄", 10},
	{2, 1, 1258, "一闪妖煌_焚云", 10},
	{2, 1, 1259, "三耀龙爔_星奕", 25},
	{2, 1, 1260, "三耀龙爔_断蛟", 25},
	{2, 1, 1261, "三耀龙爔_盖世", 25},
	{2, 1, 1262, "五彩珑髓_破军", 50},
	{2, 1, 1263, "五彩珑髓_豪门", 50},
	{2, 1, 1264, "七炫瑬纹_撼天", 75},
	{2, 95, 1861, "闪耀精华", 1},	
	{2, 95, 1862, "璀璨精华", 1},	
	{2, 95, 1863, "至尊精华", 1},	
	{2, 95, 1864, "王者精华", 1},	
	{2, 114, 4, "烈武精魄", 1},
	{2, 114, 5, "光武精魄", 1},	
	{2, 114, 170, "东皇精魄", 1},		
	{2, 196, 46, "龙隐精魄", 1},
	{2, 196, 47, "苍梧精魄", 1},	
	
}

tFactionBook70 = 
{
	[2] = {"金刚般若经", 0, 107, 166,}, 
	[4] = {"潜龙寂灭经", 0, 107, 167,}, 
	[3] = {"无尘菩提经", 0, 107, 168,}, 
	[6] = {"天罗连珠录", 0, 107, 169,}, 
	[8] = {"如意金顶秘籍", 0, 107, 170,}, 
	[9] = {"碧海绝音谱", 0, 107, 171,}, 
	[11] = {"混沌镇岳秘籍", 0, 107, 172,}, 
	[12] = {"揆天游龙秘籍", 0, 107, 173,}, 
	[14] = {"幻影迷踪秘籍", 0, 107, 174,}, 
	[15] = {"君子截风秘籍", 0, 107, 175,}, 
	[17] = {"镇军飞龙枪谱", 0, 107, 176,}, 
	[18] = {"穿云落虹秘籍", 0, 107, 177,}, 
	[20] = {"幽冥封魔录", 0, 107, 178,}, 
    [21] = {"灵蛊幻邪录", 0, 107, 179,}, 
	[23] = {"九天风雷诀", 0, 107, 198,}, 
	[25] = {"回锋斩日秘籍", 0, 107, 199,},
	[26] = {"负旗行阵秘籍", 0, 107, 200,},
	[27] = {"凝血封魂秘籍", 0, 107, 201,},
	[29] = {"红尘醉梦谱", 0, 107, 202,}, 
	[30] = {"风花千叶谱", 0, 107, 203,}, 
	[31] = {"迷踪侠影录", 0, 107, 230,}, 
	[32] = {"天锋定影诀", 0, 107, 234,}, 
};

tFactionJue = {
	[1] = {"少林诀要包", 2, 0, 607}, 
	[2] = {"武当诀要包", 2, 0, 611}, 
	[3] = {"峨嵋诀要包", 2, 0, 609}, 
	[4] = {"丐帮诀要包", 2, 0, 610}, 
	[5] = {"唐门诀要包", 2, 0, 608}, 
	[6] = {"杨门诀要包", 2, 0, 612}, 
	[7] = {"五毒诀要包", 2, 0, 613}, 
	[8] = {"昆仑诀要包", 2, 0, 2000}, 
	[9] = {"明教诀要包", 2, 0, 791}, 
	[10] = {"翠烟诀要包", 2, 0, 792}, 
};

function main()
	local nRoute = GetPlayerRoute();
	local nRouteFlag = gf_IsPlayerRoute();
	local selTab = {};
	local szTitle = format("%s欢迎您来到《》，装备道具领取：", strTitle)
	if nRouteFlag ~= 1 then
		Talk(1, "", strTitle.."请先加入门派")
		return
	end
		tinsert(selTab, format("领取藏剑绿色套装/cangjianlv"));
		tinsert(selTab, format("领取步非烟武器/bufeiyanwuqi"));
		tinsert(selTab, format("领取[+10]藏剑装备/#get_cangjian(%d)", 10));
		tinsert(selTab, format("领取[+10]藏剑金装/#get_cangjian_jin(%d)", 10));
		tinsert(selTab, format("领取[+10]皓月装备/#get_suit_equipment(%d, %d)", 1, 10));
--		tinsert(selTab, format("领取[+10]藏剑皓月装备/#get_suit_equipment(%d, %d)", 2, 10));
		tinsert(selTab, format("领取[+10]耀阳装备/#get_suit_equipment(%d, %d)", 3, 10));
--		tinsert(selTab, format("领取[+15]藏剑耀阳装备/#get_suit_equipment(%d, %d)", 4, 15));
		tinsert(selTab, format("领取[+15]师门4套装备/#get_4_equipment(%d)", 15));
		tinsert(selTab, format("领取[+15]师门5套装备/#get_5_equipment(%d)", 15));
		tinsert(selTab, format("领取[+15]师门6套装备/Get_shimen6_10"));
		tinsert(selTab, format("领取速九戒指,辉煌荣耀/su9_ring"));
		tinsert(selTab, format("领取五行天仪匣/getwuxingtianyi"));
--		tinsert(selTab, format("领取1级技能石/getskillapp"));			
		tinsert(selTab, format("领取生生 黑玉 万物/getyaopin"));
		tinsert(selTab, format("领取杀手武器/kill_weapon"));
		tinsert(selTab, format("领取烈武光照烈武/Get_liewu"));
		tinsert(selTab, format("领取东皇凤鸣/Get_donghuang"));
		tinsert(selTab, format("领取龙隐/Get_longyin"));
		tinsert(selTab, format("领取披风令牌侠义令/#Get_pifenglingpai(0)"));
		tinsert(selTab, format("领取蕴灵卷轴/#yunling_effect_list(0)"));
		tinsert(selTab, format("领取灵气装备及道具/bagua_info"));
		tinsert(selTab, format("领取坐骑/get_horse"));
		tinsert(selTab, format("领取门派秘籍及贡献度/get_book"));
		tinsert(selTab, format("领取元帅军衔及军功/get_jungong"));
		tinsert(selTab, format("领取其他物品/get_other_info"));	
	tinsert(selTab,"结束对话/nothing");
	Say(szTitle, getn(selTab), selTab)
end;
function getskillapp()
     AddItem(2,22,1,100)
end;
function getwuxingtianyi()
     AddItem(2,97,213,100)
end;
function get_worldbook_item()
      AddItem(0,107,59,1)
      AddItem(0,107,60,1)
      AddItem(0,107,64,1)
	  AddItem(0,107,65,1)
	  AddItem(0,107,66,1)
end
function getyaopin()
      AddItem(1,0,16,100)
      AddItem(1,0,6,100)
      AddItem(1,0,11,100)
end

function bufeiyanwuqi()
AddItem(0,3,6001,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,5,6002,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,8,6003,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,0,6004,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,1,6005,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,2,6006,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,10,6007,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,0,6008,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,5,6009,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,2,6010,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,9,6011,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,6,6012,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,4,6013,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,7,6014,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,11,6015,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,11,6016,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,13,6017,1,4,-1,-1,-1,-1,-1,-1);
AddItem(0,12,6018,1,4,-1,-1,-1,-1,-1,-1);

end;
function Get_liewu()
      AddItem(2,95,3279,3)
      AddItem(2,95,3280,1)	
      AddItem(2,95,5447,2)
---------------------------
      AddItem(2,95,3281,3)
      AddItem(2,95,3282,1)
      AddItem(2,95,5448,2)	  
end

function Get_donghuang()
      AddItem(2,102,190,3)
      AddItem(2,102,191,1)
      AddItem(2,95,4011,2)
end

function Get_longyin()
      AddItem(2,95,4014,2)
      AddItem(2,95,4018,3)
      AddItem(2,95,4019,1)
end

tbpifenglingpaixiayi = {
{0,153,1,"辉星之江湖令",1},
{0,153,2,"皓月之恩义令",1},
{0,153,3,"耀阳之统御令",1},
{0,153,4,"洪荒令",1},
{0,153,5,"瀚宇洪荒令",1},
{0,153,6,"光昭烈武令",1},
{0,153,7,"东皇凤鸣令",1},
{0,153,8,"龙隐令",1},
{0,153,9,"苍梧龙隐令",1},
{0,152,1,"辉星之皂布披风",1},
{0,152,2,"皓月之锦缎披风",1},
{0,152,3,"耀阳之火云披风",1},
{0,152,4,"洪荒披风",1},
{0,152,5,"瀚宇洪荒披风",1},
{0,152,6,"光昭烈武披风",1},
{0,152,7,"东皇凤鸣披风",1},
{0,152,8,"龙隐披风",1},
{0,152,9,"苍梧龙隐披风",1},
{0,154,3,"风侠义令",1},
{0,154,5,"花侠义令",1},
{0,154,6,"雪侠义令",1},
{0,154,7,"月侠义令",1},
{0,154,11,"五行天仪",1},
{0,154,12,"五行天仪",1},
{0,154,13,"五行天仪",1},
{0,154,14,"五行天仪(力)",1},
{0,154,15,"五行天仪(身)",1},
{0,154,16,"五行天仪(内)",1},
{0,154,17,"五行天仪(洞)",1},
{0,154,18,"五行天仪(根)",1},
{0,154,19,"五行天仪(阳)",1},

	};	
function Get_pifenglingpai(nPage)
	local nPageNum = 7;
	local nRemaidNum = getn(tbpifenglingpaixiayi)-(nPageNum*nPage);
	local tDiaTab = {};
	local num_this_dia = 7;
	if nRemaidNum <= 7 then
		num_this_dia = nRemaidNum;
	end
	for i=1,num_this_dia do
		tinsert(tDiaTab,""..tbpifenglingpaixiayi[nPageNum*nPage+i][4].."/#pifenglingpai_detail("..nPage..","..(nPageNum*nPage+i)..")");
	end
	if nPage ~= 0 then
		tinsert(tDiaTab,"上一页/#Get_pifenglingpai("..(nPage-1)..")");
	end
	if nRemaidNum > nPageNum then
		tinsert(tDiaTab,"下一页/#Get_pifenglingpai("..(nPage+1)..")");
	end
	tinsert(tDiaTab,"返回/OnUse");
	local nSPage = nPage+1
	Say("<color=green>领取蕴灵卷轴<color>：目前仅开放1-7级,当前第"..nSPage.."页",
		getn(tDiaTab),
		tDiaTab)
end	

function pifenglingpai_detail(nPage,nType)
	AddItem(tbpifenglingpaixiayi[nType][1], tbpifenglingpaixiayi[nType][2], tbpifenglingpaixiayi[nType][3], 1, 1, -1, -1, -1, -1, -1, -1)
end








tbyunlingEffect = {
{2, 144, 2,"鹰袭（头部）等级1",1},
{2, 144, 3,"鹰袭（头部）等级2",1},
{2, 144, 4,"鹰袭（头部）等级3",1},
{2, 144, 5,"怒吟（衣服）等级1",1},
{2, 144, 6,"怒吟（衣服）等级2",1},
{2, 144, 7,"怒吟（衣服）等级3",1},
{2, 144, 8,"无量（下装）等级1",1},
{2, 144, 9,"无量（下装）等级2",1},
{2, 144, 10,"无量（下装）等级3",1},
{2, 144, 11,"目冥（下装）等级1",1},
{2, 144, 12,"目冥（下装）等级2",1},
{2, 144, 13,"目冥（下装）等级3",1},
{2, 144, 14,"裂岩（头部）等级1",1},
{2, 144, 15,"裂岩（头部）等级2",1},
{2, 144, 16,"裂岩（头部）等级3",1},
{2, 144, 17,"裂岩（衣服）等级1",1},
{2, 144, 18,"裂岩（衣服）等级2",1},
{2, 144, 19,"裂岩（衣服）等级3",1},
{2, 144, 20,"裂岩（下装）等级1",1},
{2, 144, 21,"裂岩（下装）等级2",1},
{2, 144, 22,"裂岩（下装）等级3",1},
{2, 144, 23,"破空（头部）等级1",1},
{2, 144, 24,"破空（头部）等级2",1},
{2, 144, 25,"破空（头部）等级3",1},
{2, 144, 26,"破空（衣服）等级1",1},
{2, 144, 27,"破空（衣服）等级2",1},
{2, 144, 28,"破空（衣服）等级3",1},
{2, 144, 29,"破空（下装）等级1",1},
{2, 144, 30,"破空（下装）等级2",1},
{2, 144, 31,"破空（下装）等级3",1},
{2, 144, 32,"醉剑（头部）等级1",1},
{2, 144, 33,"醉剑（头部）等级2",1},
{2, 144, 34,"醉剑（头部）等级3",1},
{2, 144, 35,"醉剑（衣服）等级1",1},
{2, 144, 36,"醉剑（衣服）等级2",1},
{2, 144, 37,"醉剑（衣服）等级3",1},
{2, 144, 38,"醉剑（下装）等级1",1},
{2, 144, 39,"醉剑（下装）等级2",1},
{2, 144, 40,"醉剑（下装）等级3",1},
{2, 144, 41,"疾风（头部）等级1",1},
{2, 144, 42,"疾风（头部）等级2",1},
{2, 144, 43,"疾风（头部）等级3",1},
{2, 144, 44,"疾风（衣服）等级1",1},
{2, 144, 45,"疾风（衣服）等级2",1},
{2, 144, 46,"疾风（衣服）等级3",1},
{2, 144, 47,"疾风（下装）等级1",1},
{2, 144, 48,"疾风（下装）等级2",1},
{2, 144, 49,"疾风（下装）等级3",1},
{2, 144, 50,"迅舞（头部）等级1",1},
{2, 144, 51,"迅舞（头部）等级2",1},
{2, 144, 52,"迅舞（头部）等级3",1},
{2, 144, 53,"迅舞（衣服）等级1",1},
{2, 144, 54,"迅舞（衣服）等级2",1},
{2, 144, 55,"迅舞（衣服）等级3",1},
{2, 144, 56,"迅舞（下装）等级1",1},
{2, 144, 57,"迅舞（下装）等级2",1},
{2, 144, 58,"迅舞（下装）等级3",1},
{2, 144, 59,"气御（头部）",1},
{2, 144, 60,"气御（衣服）",1},
{2, 144, 61,"气御（下装）",1},
{2, 144, 62,"灵心（头部）等级1",1},
{2, 144, 63,"灵心（头部）等级2",1},
{2, 144, 64,"灵心（头部）等级3",1},
{2, 144, 65,"穿云（衣服）等级1",1},
{2, 144, 66,"穿云（衣服）等级2",1},
{2, 144, 67,"穿云（衣服）等级3",1},
{2, 144, 68,"落日（衣服）等级1",1},
{2, 144, 69,"落日（衣服）等级2",1},
{2, 144, 70,"落日（衣服）等级3",1},
{2, 144, 71,"狼啸（头部）等级1",1},
{2, 144, 72,"狼啸（头部）等级2",1},
{2, 144, 73,"狼啸（头部）等级3",1},
{2, 144, 74,"止战（下装）等级1",1},
{2, 144, 75,"止战（下装）等级2",1},
{2, 144, 76,"止战（下装）等级3",1},
{2, 144, 77,"神力（头部）等级1",1},
{2, 144, 78,"神力（头部）等级2",1},
{2, 144, 79,"神力（头部）等级3",1},
{2, 144, 80,"神力（衣服）等级1",1},
{2, 144, 81,"神力（衣服）等级2",1},
{2, 144, 82,"神力（衣服）等级3",1},
{2, 144, 83,"神力（下装）等级1",1},
{2, 144, 84,"神力（下装）等级2",1},
{2, 144, 85,"神力（下装）等级3",1},
{2, 144, 86,"凝神（头部）等级1",1},
{2, 144, 87,"凝神（头部）等级2",1},
{2, 144, 88,"凝神（头部）等级3",1},
{2, 144, 89,"凝神（衣服）等级1",1},
{2, 144, 90,"凝神（衣服）等级2",1},
{2, 144, 91,"凝神（衣服）等级3",1},
{2, 144, 92,"凝神（下装）等级1",1},
{2, 144, 93,"凝神（下装）等级2",1},
{2, 144, 94,"凝神（下装）等级3",1},
{2, 144, 95,"无间（头部）等级1",1},
{2, 144, 96,"无间（头部）等级2",1},
{2, 144, 97,"无间（头部）等级3",1},
{2, 144, 98,"无间（衣服）等级1",1},
{2, 144, 99,"无间（衣服）等级2",1},
{2, 144, 100,"无间（衣服）等级3",1},
{2, 144, 101,"无间（下装）等级1",1},
{2, 144, 102,"无间（下装）等级2",1},
{2, 144, 103,"无间（下装）等级3",1},
{2, 144, 104,"无极（头部）等级1",1},
{2, 144, 105,"无极（头部）等级2",1},
{2, 144, 106,"无极（头部）等级3",1},
{2, 144, 107,"无极（衣服）等级1",1},
{2, 144, 108,"无极（衣服）等级2",1},
{2, 144, 109,"无极（衣服）等级3",1},
{2, 144, 110,"无极（下装）等级1",1},
{2, 144, 111,"无极（下装）等级2",1},
{2, 144, 112,"无极（下装）等级3",1},
{2, 144, 113,"狂韧（头部）等级1",1},
{2, 144, 114,"狂韧（头部）等级2",1},
{2, 144, 115,"狂韧（头部）等级3",1},
{2, 144, 116,"狂韧（衣服）等级1",1},
{2, 144, 117,"狂韧（衣服）等级2",1},
{2, 144, 118,"狂韧（衣服）等级3",1},
{2, 144, 119,"狂韧（下装）等级1",1},
{2, 144, 120,"狂韧（下装）等级2",1},
{2, 144, 121,"狂韧（下装）等级3",1},
{2, 144, 122,"凌锐（头部）等级1",1},
{2, 144, 123,"凌锐（头部）等级2",1},
{2, 144, 124,"凌锐（头部）等级3",1},
{2, 144, 125,"凌锐（衣服）等级1",1},
{2, 144, 126,"凌锐（衣服）等级2",1},
{2, 144, 127,"凌锐（衣服）等级3",1},
{2, 144, 128,"凌锐（下装）等级1",1},
{2, 144, 129,"凌锐（下装）等级2",1},
{2, 144, 130,"凌锐（下装）等级3",1},
{2, 144, 131,"灵猿（头部）等级1",1},
{2, 144, 132,"灵猿（头部）等级2",1},
{2, 144, 133,"灵猿（头部）等级3",1},
{2, 144, 134,"灵猿（衣服）等级1",1},
{2, 144, 135,"灵猿（衣服）等级2",1},
{2, 144, 136,"灵猿（衣服）等级3",1},
{2, 144, 137,"灵猿（下装）等级1",1},
{2, 144, 138,"灵猿（下装）等级2",1},
{2, 144, 139,"灵猿（下装）等级3",1},
{2, 144, 140,"海韵（头部）等级1",1},
{2, 144, 141,"海韵（头部）等级2",1},
{2, 144, 142,"海韵（头部）等级3",1},
{2, 144, 143,"海韵（衣服）等级1",1},
{2, 144, 144,"海韵（衣服）等级2",1},
{2, 144, 145,"海韵（衣服）等级3",1},
{2, 144, 146,"海韵（下装）等级1",1},
{2, 144, 147,"海韵（下装）等级2",1},
{2, 144, 148,"海韵（下装）等级3",1},
{2, 144, 149,"海心（头部）等级1",1},
{2, 144, 150,"海心（头部）等级2",1},
{2, 144, 151,"海心（头部）等级3",1},
{2, 144, 152,"海心（衣服）等级1",1},
{2, 144, 153,"海心（衣服）等级2",1},
{2, 144, 154,"海心（衣服）等级3",1},
{2, 144, 155,"海心（下装）等级1",1},
{2, 144, 156,"海心（下装）等级2",1},
{2, 144, 157,"海心（下装）等级3",1},
{2, 144, 158,"鹰袭（头部）等级4",1},
{2, 144, 159,"鹰袭（头部）等级5",1},
{2, 144, 160,"怒吟（衣服）等级4",1},
{2, 144, 161,"怒吟（衣服）等级5",1},
{2, 144, 162,"无量（下装）等级4",1},
{2, 144, 163,"无量（下装）等级5",1},
{2, 144, 164,"目冥（下装）等级4",1},
{2, 144, 165,"目冥（下装）等级5",1},
{2, 144, 166,"裂岩（头部）等级4",1},
{2, 144, 167,"裂岩（头部）等级5",1},
{2, 144, 168,"裂岩（衣服）等级4",1},
{2, 144, 169,"裂岩（衣服）等级5",1},
{2, 144, 170,"裂岩（下装）等级4",1},
{2, 144, 171,"裂岩（下装）等级5",1},
{2, 144, 172,"破空（头部）等级4",1},
{2, 144, 173,"破空（头部）等级5",1},
{2, 144, 174,"破空（衣服）等级4",1},
{2, 144, 175,"破空（衣服）等级5",1},
{2, 144, 176,"破空（下装）等级4",1},
{2, 144, 177,"破空（下装）等级5",1},
{2, 144, 178,"醉剑（头部）等级4",1},
{2, 144, 179,"醉剑（头部）等级5",1},
{2, 144, 180,"醉剑（衣服）等级4",1},
{2, 144, 181,"醉剑（衣服）等级5",1},
{2, 144, 182,"醉剑（下装）等级4",1},
{2, 144, 183,"醉剑（下装）等级5",1},
{2, 144, 184,"疾风（头部）等级4",1},
{2, 144, 185,"疾风（头部）等级5",1},
{2, 144, 186,"疾风（衣服）等级4",1},
{2, 144, 187,"疾风（衣服）等级5",1},
{2, 144, 188,"疾风（下装）等级4",1},
{2, 144, 189,"疾风（下装）等级5",1},
{2, 144, 190,"迅舞（头部）等级4",1},
{2, 144, 191,"迅舞（头部）等级5",1},
{2, 144, 192,"迅舞（衣服）等级4",1},
{2, 144, 193,"迅舞（衣服）等级5",1},
{2, 144, 194,"迅舞（下装）等级4",1},
{2, 144, 195,"迅舞（下装）等级5",1},
{2, 144, 196,"灵心（头部）等级4",1},
{2, 144, 197,"灵心（头部）等级5",1},
{2, 144, 198,"穿云（衣服）等级4废弃",1},
{2, 144, 199,"穿云（衣服）等级5废弃",1},
{2, 144, 200,"落日（衣服）等级4废弃",1},
{2, 144, 201,"落日（衣服）等级5废弃",1},
{2, 144, 202,"狼啸（头部）等级4废弃",1},
{2, 144, 203,"狼啸（头部）等级5废弃",1},
{2, 144, 204,"止战（下装）等级4废弃",1},
{2, 144, 205,"止战（下装）等级5废弃",1},
{2, 144, 206,"神力（头部）等级4",1},
{2, 144, 207,"神力（头部）等级5",1},
{2, 144, 208,"神力（衣服）等级4",1},
{2, 144, 209,"神力（衣服）等级5",1},
{2, 144, 210,"神力（下装）等级4",1},
{2, 144, 211,"神力（下装）等级5",1},
{2, 144, 212,"凝神（头部）等级4",1},
{2, 144, 213,"凝神（头部）等级5",1},
{2, 144, 214,"凝神（衣服）等级4",1},
{2, 144, 215,"凝神（衣服）等级5",1},
{2, 144, 216,"凝神（下装）等级4",1},
{2, 144, 217,"凝神（下装）等级5",1},
{2, 144, 218,"无间（头部）等级4",1},
{2, 144, 219,"无间（头部）等级5",1},
{2, 144, 220,"无间（衣服）等级4",1},
{2, 144, 221,"无间（衣服）等级5",1},
{2, 144, 222,"无间（下装）等级4",1},
{2, 144, 223,"无间（下装）等级5",1},
{2, 144, 224,"无极（头部）等级4",1},
{2, 144, 225,"无极（头部）等级5",1},
{2, 144, 226,"无极（衣服）等级4",1},
{2, 144, 227,"无极（衣服）等级5",1},
{2, 144, 228,"无极（下装）等级4",1},
{2, 144, 229,"无极（下装）等级5",1},
{2, 144, 230,"狂韧（头部）等级4",1},
{2, 144, 231,"狂韧（头部）等级5",1},
{2, 144, 232,"狂韧（衣服）等级4",1},
{2, 144, 233,"狂韧（衣服）等级5",1},
{2, 144, 234,"狂韧（下装）等级4",1},
{2, 144, 235,"狂韧（下装）等级5",1},
{2, 144, 236,"凌锐（头部）等级4",1},
{2, 144, 237,"凌锐（头部）等级5",1},
{2, 144, 238,"凌锐（衣服）等级4",1},
{2, 144, 239,"凌锐（衣服）等级5",1},
{2, 144, 240,"凌锐（下装）等级4",1},
{2, 144, 241,"凌锐（下装）等级5",1},
{2, 144, 242,"灵猿（头部）等级4",1},
{2, 144, 243,"灵猿（头部）等级5",1},
{2, 144, 244,"灵猿（衣服）等级4",1},
{2, 144, 245,"灵猿（衣服）等级5",1},
{2, 144, 246,"灵猿（下装）等级4",1},
{2, 144, 247,"灵猿（下装）等级5",1},
{2, 144, 248,"海韵（头部）等级4",1},
{2, 144, 249,"海韵（头部）等级5",1},
{2, 144, 250,"海韵（衣服）等级4",1},
{2, 144, 251,"海韵（衣服）等级5",1},
{2, 144, 252,"海韵（下装）等级4",1},
{2, 144, 253,"海韵（下装）等级5",1},
{2, 144, 254,"海心（头部）等级4",1},
{2, 144, 255,"海心（头部）等级5",1},
{2, 144, 256,"海心（衣服）等级4",1},
{2, 144, 257,"海心（衣服）等级5",1},
{2, 144, 258,"海心（下装）等级4",1},
{2, 144, 259,"海心（下装）等级5",1},
{2, 144, 260,"裂岩（头部）等级6",1},
{2, 144, 261,"裂岩（下装）等级6",1},
{2, 144, 262,"破空（头部）等级6",1},
{2, 144, 263,"海心（衣服）等级5",1},
{2, 144, 264,"破空（下装）等级6",1},
{2, 144, 265,"醉剑（头部）等级6",1},
{2, 144, 266,"裂岩（衣服）等级6",1},
{2, 144, 267,"醉剑（下装）等级6",1},
{2, 144, 268,"疾风（头部）等级6",1},
{2, 144, 269,"破空（衣服）等级6",1},
{2, 144, 270,"疾风（下装）等级6",1},
{2, 144, 271,"迅舞（头部）等级6",1},
{2, 144, 272,"醉剑（衣服）等级6",1},
{2, 144, 273,"迅舞（下装）等级6",1},
{2, 144, 274,"鹰袭（头部）等级6",1},
{2, 144, 275,"疾风（衣服）等级6",1},
{2, 144, 276,"无量（下装）等级6",1},
{2, 144, 277,"灵心（头部）等级6",1},
{2, 144, 278,"迅舞（衣服）等级6",1},
{2, 144, 279,"目冥（下装）等级6",1},
{2, 144, 280,"神力（头部）等级6",1},
{2, 144, 281,"化魂（衣服）等级6",1},
{2, 144, 282,"神力（下装）等级6",1},
{2, 144, 283,"凝神（头部）等级6",1},
{2, 144, 284,"怒吟（衣服）等级6",1},
{2, 144, 285,"凝神（下装）等级6",1},
{2, 144, 286,"无间（头部）等级6",1},
{2, 144, 287,"穿云（衣服）等级6",1},
{2, 144, 288,"无间（下装）等级6",1},
{2, 144, 289,"无极（头部）等级6",1},
{2, 144, 290,"神力（衣服）等级6",1},
{2, 144, 291,"无极（下装）等级6",1},
{2, 144, 292,"狂韧（头部）等级6",1},
{2, 144, 293,"凝神（衣服）等级6",1},
{2, 144, 294,"狂韧（下装）等级6",1},
{2, 144, 295,"凌锐（头部）等级6",1},
{2, 144, 296,"无间（衣服）等级6",1},
{2, 144, 297,"凌锐（下装）等级6",1},
{2, 144, 298,"灵猿（头部）等级6",1},
{2, 144, 299,"无极（衣服）等级6",1},
{2, 144, 300,"灵猿（下装）等级6",1},
{2, 144, 301,"海韵（头部）等级6",1},
{2, 144, 302,"狂韧（衣服）等级6",1},
{2, 144, 303,"海韵（下装）等级6",1},
{2, 144, 304,"海心（头部）等级6",1},
{2, 144, 305,"凌锐（衣服）等级6",1},
{2, 144, 306,"海心（下装）等级6",1},
{2, 144, 307,"裂岩（头部）等级7",1},
{2, 144, 308,"灵猿（衣服）等级6",1},
{2, 144, 309,"裂岩（下装）等级7",1},
{2, 144, 310,"破空（头部）等级7",1},
{2, 144, 311,"海韵（衣服）等级6",1},
{2, 144, 312,"破空（下装）等级7",1},
{2, 144, 313,"醉剑（头部）等级7",1},
{2, 144, 314,"海心（衣服）等级6",1},
{2, 144, 315,"醉剑（下装）等级7",1},
{2, 144, 316,"疾风（头部）等级7",1},
{2, 144, 317,"裂岩（衣服）等级7",1},
{2, 144, 318,"疾风（下装）等级7",1},
{2, 144, 319,"迅舞（头部）等级7",1},
{2, 144, 320,"破空（衣服）等级7",1},
{2, 144, 321,"迅舞（下装）等级7",1},
{2, 144, 322,"神力（头部）等级7",1},
{2, 144, 323,"醉剑（衣服）等级7",1},
{2, 144, 324,"神力（下装）等级7",1},
{2, 144, 325,"凝神（头部）等级7",1},
{2, 144, 326,"疾风（衣服）等级7",1},
{2, 144, 327,"凝神（下装）等级7",1},
{2, 144, 328,"无间（头部）等级7",1},
{2, 144, 329,"迅舞（衣服）等级7",1},
{2, 144, 330,"无间（下装）等级7",1},
{2, 144, 331,"无极（头部）等级7",1},
{2, 144, 332,"神力（衣服）等级7",1},
{2, 144, 333,"无极（下装）等级7",1},
{2, 144, 334,"狂韧（头部）等级7",1},
{2, 144, 335,"凝神（衣服）等级7",1},
{2, 144, 336,"狂韧（下装）等级7",1},
{2, 144, 337,"凌锐（头部）等级7",1},
{2, 144, 338,"无间（衣服）等级7",1},
{2, 144, 339,"凌锐（下装）等级7",1},
{2, 144, 340,"灵猿（头部）等级7",1},
{2, 144, 341,"无极（衣服）等级7",1},
{2, 144, 342,"灵猿（下装）等级7",1},
{2, 144, 343,"海韵（头部）等级7",1},
{2, 144, 344,"狂韧（衣服）等级7",1},
{2, 144, 345,"海韵（下装）等级7",1},
{2, 144, 346,"海心（头部）等级7",1},
{2, 144, 347,"凌锐（衣服）等级7",1},
{2, 144, 348,"海心（下装）等级7",1},
{2, 144, 349,"鹰袭（头部）等级7",1},
{2, 144, 350,"灵猿（衣服）等级7",1},
{2, 144, 351,"无量（下装）等级7",1},
{2, 144, 352,"灵心（头部）等级7",1},
{2, 144, 353,"海韵（衣服）等级7",1},
{2, 144, 354,"目冥（下装）等级7",1},
{2, 144, 355,"海心（衣服）等级7",1},
{2, 144, 356,"化魂（衣服）等级7",1},
{2, 144, 357,"怒吟（衣服）等级7",1},
{2, 144, 358,"穿云（衣服）等级7",1},
{2, 144, 359,"化魂（衣服）等级4",1},
{2, 144, 360,"化魂（衣服）等级5",1},

	
	};	

function yunling_effect_list(nPage)
	local nPageNum = 7;
	local nRemaidNum = getn(tbyunlingEffect)-(nPageNum*nPage);
	local tDiaTab = {};
	local num_this_dia = 7;
	if nRemaidNum <= 7 then
		num_this_dia = nRemaidNum;
	end
	for i=1,num_this_dia do
		tinsert(tDiaTab,""..tbyunlingEffect[nPageNum*nPage+i][4].."/#yunling_detail("..nPage..","..(nPageNum*nPage+i)..")");
	end
	if nPage ~= 0 then
		tinsert(tDiaTab,"上一页/#yunling_effect_list("..(nPage-1)..")");
	end
	if nRemaidNum > nPageNum then
		tinsert(tDiaTab,"下一页/#yunling_effect_list("..(nPage+1)..")");
	end
	tinsert(tDiaTab,"返回/OnUse");
	local nSPage = nPage+1
	Say("<color=green>领取蕴灵卷轴<color>：目前仅开放1-7级,当前第"..nSPage.."页",
		getn(tDiaTab),
		tDiaTab)
end	

function yunling_detail(nPage,nType)
	gf_AddItemEx({tbyunlingEffect[nType][1], tbyunlingEffect[nType][2], tbyunlingEffect[nType][3], tbyunlingEffect[nType][5]}, tbyunlingEffect[nType][4])
end

function cangjianlv()
AddItem(2,1,1059,1)
AddItem(2,1,1060,1)
AddItem(2,1,1061,1)
AddItem(2,1,1062,1)
AddItem(2,1,1063,1)
end

function su9_ring(nCon)
	local nBody = GetBody();
	if nBody == 1 then
		AddItem(0,102,15,1,1,2,24,3,14,0,0);
		AddItem(0,102,15,1,1,2,24,3,14,0,0);
	else
		AddItem(0,102,20,1,1,2,24,3,14,0,0);
		AddItem(0,102,20,1,1,2,24,3,14,0,0);
	end
		for i=18846,18847 do
				AddItem(0,102,i,1,1,-1,-1,-1,-1,-1,-1)
		end	
	
	
	
end

function choose_faction()
	if GetPlayerFaction() ~= 0 then
		Talk(1, "", strTitle.."你已经加入过门派了")
		return
	end

	local szTitle = strTitle.."一旦加入门派就不可更改，请考虑清楚"
	local nSex = GetSex();
	local tbOpt = {}
	for i=1, getn(tbFactionSex[nSex]) do
		local nIndex = tbFactionSex[nSex][i]
		tinsert(tbOpt, {tbFaction[nIndex].szShowName, set_faction_route, {tbFaction[nIndex].szFactionRoute}})
	end
	tinsert(tbOpt, {"返回上一层", main})
	tinsert(tbOpt, {"结束对话"})
	CreateNewSayEx(szTitle, tbOpt)
end

function set_faction_route(szFactionRoute)
	local szTitle = strTitle.."选择你要加入的流派，一旦选择了流派就不可更改，要考虑清楚"
	local tbOpt = {}
	for i=1, getn(szFactionRoute) do
		local nRoute = szFactionRoute[i]
		tinsert(tbOpt, {tbFactionRoute[nRoute], set_faction, {nRoute, tbFactionRoute[nRoute]}})
	end

	tinsert(tbOpt, {"返回上一层", choose_faction})
	tinsert(tbOpt, {"结束对话"})
	CreateNewSayEx(szTitle, tbOpt)
end

function set_faction(nRoute, szFactionRouteName)
	local szTitle = strTitle.."派流一旦选定则不能修改，只能以该角色加入，确认要加入<color=yellow>"..szFactionRouteName.."<color>吗？"
	local tbOpt =
	{
		{"确认", do_set_faction, {nRoute}},
		{"返回上一层", set_faction_route, {nRoute}},
		{"我再考虑一下"},
	}
	CreateNewSayEx(szTitle, tbOpt)
end

function do_set_faction(nRoute)
	local szScript = format("MikeExpRoute(%d)", nRoute)
	SendScript2VM("\\script\\gmscript.lua", szScript)
	PlaySound("\\sound\\sound_i016.wav");
	SetCurrentNpcSFX(PIdx2NpcIdx(),905,0,0)
	Msg2Player("您已成功加入了门派并学习了门派技能。")
	Talk(1,"","您已成功加入了门派并学习了门派技能。")
end

function get_horse()
	AskClientForNumber("get_horse_cb",1,10000,"输入数值"); --数值
end

function get_horse_cb(nCon)
	fe_AddFactionEquipment(105, nCon, 0)
end

function get_book()
	local strSay = "";
  	strSay = {
		strTitle.."请选择：",
--		"领取真卷/gaojimiji",
		"领取诀要/Get_Book_JueYao",
--		"领取秘籍/get_book_item",
--		"领取世界秘籍/get_worldbook_item",
--		"领取秘籍/get_book_item",
		"秒修秘籍/get_book_miao",
--		"增加师门贡献度/get_shimen_gongxian",
		"返回/main",
		"结束对话/nothing",
		}
	SelectSay(strSay);
end;


function Get_Book_JueYao()
	local tJue ={
		[2]		={1,10},
		[3]		={21,31},
		[4]		={11,20},
		[6]		={32,46},
		[8]		={47,59},
		[9]		={60,70},
		[11]	={71,79},
		[12]	={80,88},
		[14]	={89,108},
		[15]	={109,119},
		[17]	={120,130},
		[18]	={131,141},
		[20]	={142,154},
		[21]	={155,168},
		[23]	={169,182},
		[25]	={183,194},
		[26]	={195,206},
		[27]	={207,218},
		[29]	={219,229},
		[30]	={230,240},
		[31]	={241,250},	
		[32]	={251,261},		
				
	};

	local nRoute = GetPlayerRoute()
	if 1 ~= gf_CheckPlayerRoute() then
		return 0;
	end

	if 1 ~= gf_Judge_Room_Weight((tJue[nRoute][2] - tJue[nRoute][1] + 1), 1, strTitle) then
		return 0;
	end

	for i = tJue[nRoute][1],tJue[nRoute][2] do
		gf_AddItemEx({2, 6, i, 1, 4}, "诀要");
	end
end
function gaojimiji()
      AddItem(2,95,617,5)   
end
function get_shimen_gongxian()
	SetTask(336, GetTask(336) + 10000)
	Msg2Player("您的师门贡献度增加10000点")
end
function get_book_miao()
	local nBookIdx = GetPlayerEquipIndex(11)
	if nBookIdx == 0 then
		Talk(1,"",strTitle.."你需要先把秘籍佩戴在身上，不然怎么修炼？!!!");
		return 0		
	end
	for i=1,100 do LevelUpBook() end
	for i=1,100 do LevelUpBook(1) end
	Msg2Player("秘籍成功修炼到99级")
end
function get_book_item()
	local nFac = GetPlayerFaction();
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	local tbBook = tFactionBook70[nRoute]
	gf_AddItemEx({tbBook[2],tbBook[3],tbBook[4],1,4})
	local tbJue = tFactionJue[nFac]
	gf_AddItemEx({tbJue[2],tbJue[3],tbJue[4],1,4})
	gf_AddItemEx({0,112,78,1,4}, "凌波微步")
	gf_AddItemEx({0,107,155,1,4}, "五行秘籍")
end;


function get_other_info()
	local selTab = {};
	local szTitle = format("%s选择要领取的物品：", strTitle)
--	tinsert(selTab, format("领取经验丹/#_get_shengji_item(%d, %d, %d)", 95, 2017, 99));
	tinsert(selTab, format("领取千变/#_get_shengji_item(%d, %d, %d)", 95, 247, 100));
	tinsert(selTab, format("领取密令大全宝箱/#_get_shengji_item(%d, %d, %d)", 95, 18327, 1));
	tinsert(selTab, format("领取修真要诀/#_get_shengji_item(%d, %d, %d)", 0, 554, 10));
--	tinsert(selTab, format("领取龙血仙丹/#_get_shengji_item(%d, %d, %d)", 95, 2058, 1));
--	tinsert(selTab, format("领取天骄令/#_get_shengji_item(%d, %d, %d)", 97, 236, 999));
 --   tinsert(selTab, format("领取天罡令/#_get_shengji_item(%d, %d, %d)", 95, 204, 10));
--	tinsert(selTab, format("领取师门圣物/#_get_shengji_item(%d, %d, %d)", 95, 205, 99));
--	tinsert(selTab, format("领取神器/#_get_shengji_item(%d, %d, %d)", 95, 55, 99));
--	tinsert(selTab, format("领取和氏璧/#_get_shengji_item(%d, %d, %d)", 1, 1001, 1));
--	tinsert(selTab, format("领取磐龙璧/#_get_shengji_item(%d, %d, %d)", 1, 1000, 1));
--	tinsert(selTab, format("领取白金大礼包/#_get_shengji_item(%d, %d, %d)", 1, 30229, 1));
--	tinsert(selTab, format("领取天挂石/#_get_shengji_item(%d, %d, %d)", 0,1084, 4));
--	tinsert(selTab, format("领取消劫散/#_get_shengji_item(%d, %d, %d)", 0,141, 1));
	tinsert(selTab, format("领取八宝洗髓仙丹/#_get_shengji_item(%d, %d, %d)", 0,138, 1));	
	tinsert(selTab, format("领取女娲精石/#_get_shengji_item(%d, %d, %d)", 1,504, 1));		
--	tinsert(selTab, format("领取会盟令牌/#_get_shengji_item(%d, %d, %d)", 0, 125, 1));
--	tinsert(selTab, format("领取乾坤符/#_get_shengji_item(%d, %d, %d)", 0, 555, 1));
--	tinsert(selTab, format("领取陨铁碎片/#_get_shengji_item(%d, %d, %d)", 2, 7, 100));
--	tinsert(selTab, format("领取陨铁/#_get_shengji_item(%d, %d, %d)", 2, 8, 100));
--	tinsert(selTab, format("领取陨铁精石/#_get_shengji_item(%d, %d, %d)", 1, 1009, 100));
--	tinsert(selTab, format("领取陨铁灵石/#_get_shengji_item(%d, %d, %d)", 1, 1068, 1));
	tinsert(selTab, format("领取大人参果/#_get_shengji_item(%d, %d, %d)", 0,553, 1));
--	tinsert(selTab, format("城市奖章/#_get_shengji_item(%d, %d, %d)", 0,765, 100));
--	tinsert(selTab, format("领取武器特效/get_weapon_effect_list"));
	tinsert(selTab,"返回/main");
	tinsert(selTab,"结束对话/nothing");
	Say(szTitle, getn(selTab), selTab)
end;

function _get_shengji_item(nId2, nId3, nNum)
	if gf_Judge_Room_Weight(1, 10, " ") ~= 1 then
		return
	end
	gf_AddItemEx({2, nId2, nId3, nNum})
end

function get_jungong()
	local nZhanGong = GetTask(701)
	local sCampName = "";
	if nZhanGong < 0 then
		sCampName = "辽";
	elseif nZhanGong > 0 then
		sCampName = "宋";
	else
		sCampName = "中间";
	end; 
	local selTab = {
				"选择宋方/#change_camp(1)",
				"选择辽方/#change_camp(2)",
				"以后再说/nothing",
				}
	Say("您当前阵营：<color=yellow>"..sCampName.."方<color>，当前您有<color=yellow>"..abs(nZhanGong).."<color>军功。赠送你<color=yellow>将军之职<color>，并获得<color=yellow>120000<color>军功，并可以重新选择阵营，您确定使用它吗？",	
		getn(selTab),
		selTab)
end

function change_camp(nCamp)
	local nZhanGong = GetTask(701)
	local sCampName = ""
	
	if nZhanGong < 0 then
		sCampName = "辽"
	elseif (nZhanGong > 0) then
		sCampName = "宋"
	else
		sCampName = "中间"
	end
	
	if abs(nZhanGong) >= 600000 then	--如果当前军功绝对值大于等于120000
		Talk(1, "", "您当前阵营：<color=yellow>"..sCampName.."<color>方，当前您已经有<color=yellow>"..abs(nZhanGong).."<color>军功，超过<color=red>600000<color>军功已无法领取。")
		return 0
	end
	
	if (nCamp == 1) then						--成为宋方将军
		SetTask(701, 600000)						--设置宋方军功
		SetTask(704, 6)							--设置宋方当前军衔
		if (GetTask(745) < 6) then				--如果之前宋方军衔小于将军
			SetTask(745, 6)						--设置宋方最高军衔
		end
		if GetTask(702) < 600000 then
			SetTask(702,600000);	--设置宋方最高军功
		end;
		Talk(1, "", "您被提升为宋军元帅。")
	elseif (nCamp == 2) then					--成为辽方将军
		SetTask(701, -600000)					--设置辽方军功
		SetTask(704, -6)						--设置辽方当前军衔
		if GetTask(746) > -6 then	--如果之前辽方军衔小于将军
			SetTask(746,-6)	--设置辽方最高军衔
		end;
		if GetTask(703) < 600000 then
			SetTask(703,600000);	--设置辽方最高军功
		end;
		Talk(1, "", "您被提升为辽军元帅。")
	end;
end;

function kill_weapon()
	if gf_Judge_Room_Weight(1, 10, " ") ~= 1 then
		return
	end
	local nRoute = GetPlayerRoute();
	local n = tBaguaWuqi[nRoute][1]
	gf_AddItemEx({n[2],n[3],n[4],1,1,n[5],n[6],n[7],n[8],n[9],n[10],1,0})
end

function get_weapon_effect_list()
	local selTab = {};
	local szTitle = format("%s选择武器特效", strTitle)
	for i = 1, getn(tbWeaponEffect) do
		local n = tbWeaponEffect[i]
		tinsert(selTab, format("领取%d个%s/#_do_get_weapon_effect_list(%d)", n[5], n[4], i));
	end
	tinsert(selTab,"返回/get_other_info");
	tinsert(selTab,"结束对话/nothing");
	Say(szTitle, getn(selTab), selTab)
end

function _do_get_weapon_effect_list(nIndex)
	if gf_Judge_Room_Weight(1, 10, " ") ~= 1 then
		return
	end
	gf_AddItemEx({tbWeaponEffect[nIndex][1], tbWeaponEffect[nIndex][2], tbWeaponEffect[nIndex][3], tbWeaponEffect[nIndex][5]}, tbWeaponEffect[nIndex][4])
end

function no_info()
	Talk(1,"", strTitle.."还未开放，敬请期待。")
end;

function bagua_info()
	local strSay = "";
  	strSay = {
		strTitle.."领取灵气装备相关",
		"领取灵气装备/get_bagua_zhuangbei",
		"领取灵气武器/get_bagua_wuqi",
		"领取烈武八卦/get_bagua_liewu",
		"领取光昭烈武八卦/get_bagua_liewu2",		
		"领取东皇八卦/get_bagua_donghuang",		
		"领取龙隐八卦/get_bagua_longyin",			
		"领取100颗1-7级随机灵石/get_bagua_rm_linshi",
--		"定制灵石/get_bagua_linshi",
		"领取八卦盘等道具/get_bagua_pan",
		"返回/main",
		"结束对话/nothing",
		}
	SelectSay(strSay);
end;

function get_bagua_liewu()
AddItem(2,95,4000,3)--烈武装备箱（八卦）
AddItem(2,95,4001,1)--烈武武器箱（八卦）
AddItem(2,95,5447,2)--烈武首饰箱
end;
function get_bagua_liewu2()
AddItem(2,95,4003,3)--光昭烈武装备箱（八卦）
AddItem(2,95,4004,1)--光昭烈武武器箱（八卦）
AddItem(2,95,5448,2)--光昭烈武首饰箱
end;
function get_bagua_donghuang()
AddItem(2,95,4009,3)--东皇凤鸣装备箱（八卦）
AddItem(2,95,4010,1)--东皇凤鸣武器箱（八卦）
AddItem(2,95,4011,2)--东皇凤鸣首饰箱
end;
function get_bagua_longyin()
AddItem(2,95,4012,3)--龙隐装备箱（八卦）
AddItem(2,95,4013,1)--龙隐武器箱（八卦）
AddItem(2,95,4014,2)--龙隐首饰箱
end;
function get_bagua_rm_linshi()
	fe_GiveLingShi({1,100})
	fe_GiveLingShi({2,100})
	fe_GiveLingShi({3,100})
	fe_GiveLingShi({4,100})
	fe_GiveLingShi({5,100})
	fe_GiveLingShi({6,100})
	fe_GiveLingShi({7,100})
	Msg2Player("您获得100颗1-7级灵石，打开聚灵鼎查看");
end

function get_bagua_zhuangbei()
	local selTab = {};
	local szTitle = format("%s选择灵气相关装备", strTitle)

	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	
	for i = 1, getn(tBaguaZhuangbei[nBody]) do
		local nIndex = tBaguaZhuangbei[nBody][i]
		tinsert(selTab, format("领取%s/#do_get_bagua_zhuangbei(%d)", nIndex[1], i));
	end
	tinsert(selTab,"返回/bagua_info");
	tinsert(selTab,"结束对话/nothing");
	Say(szTitle, getn(selTab), selTab)
end

function do_get_bagua_zhuangbei(nIndex)
	 nPlayerIndex = PlayerIndex
	g_AskClientNumberEx(1,120, "灵气值(120以内):", {_do_get_bagua_zhuangbei, {nPlayerIndex, nIndex}})
end

function _do_get_bagua_zhuangbei(nPlayerIndex, nIndex, nEquipLingqi)
	PlayerIndex = nPlayerIndex;
	local nBody = GetBody();
	if gf_Judge_Room_Weight(1, 10, " ") ~= 1 then
		return
	end
	local tbItem = tBaguaZhuangbei[nBody][nIndex]
	local nRetCode,nItemIdx = AddItem(tbItem[2],tbItem[3],tbItem[4],1,1,0,0,0,0,0,0,0,15,nEquipLingqi);
    	SetItemMaxLingQi(nItemIDX, nEquipLingqi);
	Msg2Player("您获得了["..tbItem[1].."]×1");
end

function get_bagua_wuqi()
	local selTab = {};
	local szTitle = format("%s选择灵气相关武器", strTitle)
	local nRoute = GetPlayerRoute();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	
	for i = 1, getn(tBaguaWuqi[nRoute]) do
		local nIndex = tBaguaWuqi[nRoute][i]
		tinsert(selTab, format("领取%s/#do_get_bagua_wuqi(%d)", nIndex[1], i));
	end
	tinsert(selTab,"返回/bagua_info");
	tinsert(selTab,"结束对话/nothing");
	Say(szTitle, getn(selTab), selTab)
end

function do_get_bagua_wuqi(nIndex)
	 nPlayerIndex = PlayerIndex
	g_AskClientNumberEx(1,120, "灵气值(120以内):", {_do_do_get_bagua_wuqi, {nPlayerIndex, nIndex}})
	
end

function _do_do_get_bagua_wuqi(nPlayerIndex, nIndex, nEquipLingqi)
	PlayerIndex = nPlayerIndex;
	local nRoute = GetPlayerRoute();
	if gf_Judge_Room_Weight(1, 10, " ") ~= 1 then
		return
	end
	local tbItem = tBaguaWuqi[nRoute][nIndex]  --AddItem(g,d,p,1,1,nLv1,nMofa1,nLv2,nMofa2,nLv3,nMofa3,0,15,nLingqi)
	local nRetCode,nItemIdx = AddItem(tbItem[2],tbItem[3],tbItem[4],1,1,0,0,0,0,0,0,0,15,nEquipLingqi);
    	SetItemMaxLingQi(nItemIDX, nEquipLingqi);
	Msg2Player("您获得了["..tbItem[1].."]×1");
end

function get_bagua_pan()
	local selTab = {};
	local szTitle = format("%s选择八卦盘相关道具", strTitle)
	for i = 1, getn(tBaguaNum) do
		local nIndex = tBaguaNum[i]
		tinsert(selTab, format("领取99个%s/#do_get_bagua_pan(%d)", nIndex[1], i));
	end
	tinsert(selTab,"返回/bagua_info");
	tinsert(selTab,"结束对话/nothing");
	Say(szTitle, getn(selTab), selTab)
end

function do_get_bagua_pan(nIndex)
	if gf_Judge_Room_Weight(1, 10, " ") ~= 1 then
		return
	end
	gf_AddItemEx({tBaguaNum[nIndex][2], tBaguaNum[nIndex][3], tBaguaNum[nIndex][4], tBaguaNum[nIndex][5]}, tBaguaNum[nIndex][1])
end

function get_bagua_linshi()
	local strtab = {
		"定制特定属性的1级灵石/#lingshi_zhiding_lv(1)",
		"定制特定属性的2级灵石/#lingshi_zhiding_lv(2)",
		"定制特定属性的3级灵石/#lingshi_zhiding_lv(3)",
		"定制特定属性的4级灵石/#lingshi_zhiding_lv(4)",
		"定制特定属性的5级灵石/#lingshi_zhiding_lv(5)",
		"定制特定属性的6级灵石/#lingshi_zhiding_lv(6)",
		"定制特定属性的7级灵石/#lingshi_zhiding_lv(7)",
		"返回/bagua_info"
		}
	Say(strTitle.."请选择你要定制的灵石等级。",
		getn(strtab),
		strtab)	
end

function lingshi_zhiding_lv(nLv)
	local strtab = {
		"帽子/#lingshi_zhiding_wz("..nLv..",0,0)",
		"衣服/#lingshi_zhiding_wz("..nLv..",1,0)",
		"武器/#lingshi_zhiding_wz("..nLv..",2,0)",
		"裤子/#lingshi_zhiding_wz("..nLv..",3,0)",
		"返回/get_bagua_linshi",
		}
	Say(strTitle.."请选择你要定制灵石的镶嵌位置。",
		getn(strtab),
		strtab)
end

function lingshi_zhiding_wz(nLv,nWz,nPage)
	local tAttri = {};
	local tIdx = {}; --对应tRandNum表的索引
	for i = 1,getn(tRandNum) do
		if tRandNum[i][3] == nWz and tRandNum[i][4] <= nLv then
			tinsert(tAttri,tRandNum[i]);
			tinsert(tIdx,i)
		end
	end
	local strtab = {};
	local nPageNum = 6;
	local nRemaid = getn(tAttri)-nPageNum*nPage;
	local nDiaNum = 6;
	if nRemaid < nDiaNum then
		nDiaNum = nRemaid;
	end
	for i = 1,nDiaNum do
		tinsert(strtab,tAttri[nPage*nPageNum+i][1].."/#confirm_lingshi_zhiding("..tAttri[nPage*nPageNum+i][2]..","..nLv..","..nWz..","..tIdx[nPage*nPageNum+i]..")");
	end
	if nPage > 0 then
		tinsert(strtab,"上一页/#lingshi_zhiding_wz("..nLv..","..nWz..","..(nPage-1)..")");
	end
	if nRemaid > 6 then
		tinsert(strtab,"下一页/#lingshi_zhiding_wz("..nLv..","..nWz..","..(nPage+1)..")");
	end
	tinsert(strtab,"返回/#lingshi_zhiding_lv("..nLv..")");
	Say(strTitle.."请选择你想要定制灵石属性。",
		getn(strtab),
		strtab);	
end

function confirm_lingshi_zhiding(nId,nLv,nWz,nIdx)
	local tWz = {"帽子","衣服","武器","裤子"};
	AddLingShi(nId,nWz,nLv);
	Msg2Player("您获得属性为["..tRandNum[nIdx][1].."]，镶嵌位置为["..tWz[nWz+1].."]的"..nLv.."级灵石1颗");
end

function get_cangjian(nQianghua)
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	local nID3 = 90 + nBody;
	if zgc_pub_goods_add_chk(5,600) ~= 1 then
		return
	end
	fe_AddFactionEquipment(103, nID3, nQianghua)
	fe_AddFactionEquipment(100, nID3, nQianghua)
	fe_AddFactionEquipment(101, nID3, nQianghua)
	fe_AddFactionEquipment(102, 36, 0)
	fe_AddFactionEquipment(102, 37, 0)
end;

function get_cangjian_jin(nQianghua)
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	local nID3 = 94 + nBody;
	if zgc_pub_goods_add_chk(6,600) ~= 1 then
		return
	end
	fe_AddFactionEquipment(103, nID3, nQianghua)
	fe_AddFactionEquipment(100, nID3, nQianghua)
	fe_AddFactionEquipment(101, nID3, nQianghua)
	fe_AddFactionEquipment(102, 38, 0)
	fe_AddFactionEquipment(102, 39, 0)
	fe_AddFactionEquipment(102, 40, 0)
end;

function get_4_equipment(nQianghua)
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	if zgc_pub_goods_add_chk(6,600) ~= 1 then
		return
	end
	-- 师门4套装备
	local nGeneration = 4
	local nID2,nID3,nID4 = 0,0,0;
	local tbWeaponID2 = {nil, 3, 8, 0, nil, 1, nil, 2, 10, nil, 0, 5, nil, 2, 9, nil, 6, 4, nil, 7, 11, nil, 2, nil, 3, 9 , 11, nil, 13, 12, 14, 2};
	nID2 = tbWeaponID2[nRoute];
	if nRoute == 8 or nRoute == 9 then				--峨嵋特殊处理
		nID3 = nRoute*100+(nGeneration-1)*10+nBody-2;
	elseif nRoute == 23 or nRoute == 25 or nRoute == 26 or nRoute == 27 then				--新门派特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody;
	elseif nRoute == 29 or nRoute == 30 then				--新翠烟特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody-2;
			elseif nRoute == 31  then				--任侠特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody;	
	elseif nRoute == 32  then				--剑尊特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody;	
	else
	--else
		nID3 = nRoute*100+(nGeneration-1)*10+nBody;
	end;
	if (nRoute == 2 or nRoute == 3 or nRoute == 4 or nRoute == 8 or nRoute == 9) and nGeneration == 3 then				--另一个戒指		
		nID4 = nID3 + 2;
	else
		nID4 = nID3 + 4;
	end
	fe_AddFactionEquipment(103, nID3, nQianghua)
	fe_AddFactionEquipment(100, nID3, nQianghua)
	fe_AddFactionEquipment(101, nID3, nQianghua)
	fe_AddFactionEquipment(nID2, nID3, nQianghua)
	fe_AddFactionEquipment(102, nID3, 0)
	fe_AddFactionEquipment(102, nID4, 0)
end;
-----------------------师门5套------------------
function get_5_equipment(nQianghua)
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	if zgc_pub_goods_add_chk(6,600) ~= 1 then
		return
	end
	-- 师门5套装备
	local nGeneration = 5
	local nID2,nID3,nID4 = 0,0,0;
	local tbWeaponID2 = {nil, 3, 8, 0, nil, 1, nil, 2, 10, nil, 0, 5, nil, 2, 9, nil, 6, 4, nil, 7, 11, nil, 2, nil, 3, 9 , 11, nil, 13, 12, 14, 2};
	nID2 = tbWeaponID2[nRoute];
	if nRoute == 8 or nRoute == 9 then				--峨嵋特殊处理
		nID3 = nRoute*100+(nGeneration-1)*10+nBody-2;
	elseif nRoute == 23 or nRoute == 25 or nRoute == 26 or nRoute == 27 then				--新门派特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody;
	elseif nRoute == 29 or nRoute == 30 then				--新翠烟特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody-2;
			elseif nRoute == 31  then				--任侠特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody;	
	elseif nRoute == 32  then				--剑尊特殊处理
		nID3 = nRoute*1000+100+(nGeneration-1)*10+nBody;	
	else
	--else
		nID3 = nRoute*100+(nGeneration-1)*10+nBody;
	end;
	if (nRoute == 2 or nRoute == 3 or nRoute == 4 or nRoute == 8 or nRoute == 9) and nGeneration == 3 then				--另一个戒指		
		nID4 = nID3 + 2;
	else
		nID4 = nID3 + 4;
	end
	fe_AddFactionEquipment(103, nID3, nQianghua)
	fe_AddFactionEquipment(100, nID3, nQianghua)
	fe_AddFactionEquipment(101, nID3, nQianghua)
	fe_AddFactionEquipment(nID2, nID3, nQianghua)
	fe_AddFactionEquipment(102, nID3, 0)
	fe_AddFactionEquipment(102, nID4, 0)
end;
-----------------------师门6套------------------
function Get_shimen6_10()
	if 1 ~= gf_Judge_Room_Weight(10, 1, g_szTitle) then
				return 0;
		end

		local nRoute	= GetPlayerRoute();
		local nBody 	= GetBody();
		local nLevel  = 15;
		if nRoute == 2 and nBody ==1 then --刀男标
				AddItem(0,100,22582,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22582,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22582,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,3,140,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22655,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22657,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 2 and nBody ==2 then --刀魁梧
				AddItem(0,100,22583,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22583,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22583,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,3,141,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22656,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22658,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 3 and nBody ==1 then --禅男标
				AddItem(0,100,22584,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22584,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22584,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,8,142,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22659,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22661,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 3 and nBody ==2 then --禅魁梧
				AddItem(0,100,22585,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22585,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22585,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,8,143,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22660,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22662,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 4 and nBody ==1 then --吴少男标
				AddItem(0,100,22586,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22586,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22586,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,0,144,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22663,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22665,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 4 and nBody ==2 then --吴少魁梧
				AddItem(0,100,22587,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22587,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22587,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,0,145,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22664,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22666,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end



		
		if nRoute == 6 and nBody ==1 then --唐门男标
				AddItem(0,100,22588,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22588,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22588,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,1,146,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22667,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22671,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 6 and nBody ==2 then --唐门魁梧
				AddItem(0,100,22589,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22589,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22589,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,1,147,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22668,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22672,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 6 and nBody ==3 then --唐门性感
				AddItem(0,100,22590,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22590,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22590,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,1,148,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22669,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22673,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 6 and nBody ==4 then --唐门较小
				AddItem(0,100,22591,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22591,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22591,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,1,149,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22670,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22674,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 8 and nBody ==3 then --佛性感
				AddItem(0,100,22592,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22592,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22592,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,150,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22675,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22677,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 8 and nBody ==4 then --佛较小
				AddItem(0,100,22593,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22593,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22593,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,151,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22676,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22678,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		if nRoute == 9 and nBody ==3 then --琴性感
				AddItem(0,100,22594,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22594,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22594,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,10,152,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22679,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22681,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 9 and nBody ==4 then --琴较小
				AddItem(0,100,22595,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22595,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22595,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,10,153,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22680,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22682,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 11 and nBody ==1 then --掌男标
				AddItem(0,100,22596,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22596,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22596,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,0,154,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22683,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22687,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 11 and nBody ==2 then --掌魁梧
				AddItem(0,100,22597,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22597,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22597,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,0,155,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22684,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22688,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 11 and nBody ==3 then --掌性感
				AddItem(0,100,22598,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22598,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22598,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,0,156,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22685,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22689,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 11 and nBody ==4 then --掌较小
				AddItem(0,100,22599,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22599,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22599,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,0,157,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22686,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22690,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		if nRoute == 12 and nBody ==1 then --棍子男标
				AddItem(0,100,22600,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22600,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22600,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,5,158,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22691,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22695,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 12 and nBody ==2 then --棍子魁梧
				AddItem(0,100,22601,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22601,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22601,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,5,159,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22692,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22696,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 12 and nBody ==3 then --棍子性感
				AddItem(0,100,22602,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22602,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22602,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,5,160,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22693,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22697,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 12 and nBody ==4 then --棍子较小
				AddItem(0,100,22603,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22603,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22603,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,5,161,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22694,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22698,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 14 and nBody ==1 then --道男标
				AddItem(0,100,22604,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22604,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22604,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,162,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22699,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22703,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 14 and nBody ==2 then --道魁梧
				AddItem(0,100,22605,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22605,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22605,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,163,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22700,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22704,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 14 and nBody ==3 then --道性感
				AddItem(0,100,22606,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22606,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22606,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,164,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22701,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22705,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 14 and nBody ==4 then --道较小
				AddItem(0,100,22607,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22607,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22607,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,165,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22702,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22706,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 15 and nBody ==1 then --笔男标
				AddItem(0,100,22608,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22608,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22608,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,166,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22707,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22711,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 15 and nBody ==2 then --笔魁梧
				AddItem(0,100,22609,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22609,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22609,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,167,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22708,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22712,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 15 and nBody ==3 then --笔性感
				AddItem(0,100,22610,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22610,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22610,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,168,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22709,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22713,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 15 and nBody ==4 then --笔较小
				AddItem(0,100,22611,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22611,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22611,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,169,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22710,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22714,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 17 and nBody ==1 then --枪男标
				AddItem(0,100,22612,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22612,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22612,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,6,170,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22715,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22719,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 17 and nBody ==2 then --枪魁梧
				AddItem(0,100,22613,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22613,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22613,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,6,171,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22716,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22720,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 17 and nBody ==3 then --枪性感
				AddItem(0,100,22614,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22614,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22614,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,6,172,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22717,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22721,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 17 and nBody ==4 then --枪较小
				AddItem(0,100,22615,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22615,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22615,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,6,173,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22718,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22722,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		if nRoute == 18 and nBody ==1 then --弓男标
				AddItem(0,100,22616,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22616,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22616,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,4,174,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22723,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22727,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 18 and nBody ==2 then --弓魁梧
				AddItem(0,100,22617,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22617,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22617,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,4,175,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22724,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22728,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 18 and nBody ==3 then --弓性感
				AddItem(0,100,22618,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22618,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22618,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,4,176,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22725,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22729,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 18 and nBody ==4 then --弓较小
				AddItem(0,100,22619,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22619,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22619,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,4,177,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22726,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22730,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		if nRoute == 20 and nBody ==1 then --邪侠男标
				AddItem(0,100,22620,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22620,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22620,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,7,178,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22731,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22735,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 20 and nBody ==2 then --邪侠魁梧
				AddItem(0,100,22621,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22621,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22621,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,7,179,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22732,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22736,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 20 and nBody ==3 then --邪侠性感
				AddItem(0,100,22622,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22622,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22622,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,7,180,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22733,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22737,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 20 and nBody ==4 then --邪侠较小
				AddItem(0,100,22623,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22623,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22623,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,7,181,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22734,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22738,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 21 and nBody ==1 then --蛊师男标
				AddItem(0,100,22624,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22624,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22624,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,182,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22739,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22743,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 21 and nBody ==2 then --蛊师魁梧
				AddItem(0,100,22625,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22625,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22625,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,183,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22740,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22744,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 21 and nBody ==3 then --蛊师性感
				AddItem(0,100,22626,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22626,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22626,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,184,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22741,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22745,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 21 and nBody ==4 then --蛊师较小
				AddItem(0,100,22627,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22627,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22627,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,185,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22742,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22746,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 23 and nBody ==1 then --天师男标
				AddItem(0,100,22628,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22628,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22628,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,186,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22747,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22749,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 23 and nBody ==2 then --天师魁梧
				AddItem(0,100,22629,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22629,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22629,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,187,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22748,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22750,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 25 and nBody ==1 then --名刀男标
				AddItem(0,100,22630,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22630,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22630,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,3,188,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22751,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22755,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 25 and nBody ==2 then --名刀魁梧
				AddItem(0,100,22631,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22631,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22631,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,3,189,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22752,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22756,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 25 and nBody ==3 then --名刀性感
				AddItem(0,100,22632,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22632,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22632,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,3,190,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22753,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22757,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 25 and nBody ==4 then --名刀较小
				AddItem(0,100,22633,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22633,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22633,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,3,191,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22754,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22758,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		if nRoute == 26 and nBody ==1 then --阵兵男标
				AddItem(0,100,22634,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22634,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22634,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,192,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22759,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22763,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 26 and nBody ==2 then --阵兵魁梧
				AddItem(0,100,22635,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22635,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22635,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,193,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22760,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22764,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 26 and nBody ==3 then --阵兵性感
				AddItem(0,100,22636,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22636,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22636,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,194,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22761,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22765,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 26 and nBody ==4 then --阵兵较小
				AddItem(0,100,22637,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22637,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22637,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,9,195,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22762,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22766,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		if nRoute == 27 and nBody ==1 then --血人男标
				AddItem(0,100,22638,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22638,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22638,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,196,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22767,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22771,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 27 and nBody ==2 then --血人魁梧
				AddItem(0,100,22639,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22639,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22639,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,197,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22768,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22772,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 27 and nBody ==3 then --血人性感
				AddItem(0,100,22640,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22640,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22640,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,198,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22769,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22773,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 27 and nBody ==4 then --血人较小
				AddItem(0,100,22641,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22641,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22641,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,11,199,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22770,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22774,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		
		if nRoute == 29 and nBody ==3 then --舞女性感
				AddItem(0,100,22644,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22644,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22644,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,13,200,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22779,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22781,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 29 and nBody ==4 then --舞女较小
				AddItem(0,100,22645,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22645,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22645,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,13,201,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22780,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22782,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 30 and nBody ==3 then --灵女性感
				AddItem(0,100,22642,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22642,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22642,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,12,202,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22775,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22777,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 30 and nBody ==4 then --灵女较小
				AddItem(0,100,22643,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22643,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22643,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,12,203,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22776,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22778,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 31 and nBody ==1 then --任侠男标
				AddItem(0,100,22646,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22646,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22646,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,14,204,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22783,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22787,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 31 and nBody ==2 then --任侠魁梧
				AddItem(0,100,22647,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22647,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22647,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,14,205,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22784,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22788,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		if nRoute == 31 and nBody ==3 then --任侠性感
				AddItem(0,100,22648,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22648,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22648,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,14,206,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22785,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22789,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 31 and nBody ==4 then --任侠较小
				AddItem(0,100,22649,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22649,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22649,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,14,207,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22786,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22790,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end

		if nRoute == 32 and nBody ==1 then --剑尊男标
				AddItem(0,100,22650,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22650,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22650,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,208,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22791,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22793,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		if nRoute == 32 and nBody ==2 then --剑尊魁梧
				AddItem(0,100,22651,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,101,22651,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,103,22651,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,2,209,1,1,-1,-1,-1,-1,-1,-1,-1,nLevel)
				AddItem(0,102,22792,1,1,-1,-1,-1,-1,-1,-1,-1,0)
				AddItem(0,102,22794,1,1,-1,-1,-1,-1,-1,-1,-1,0)
		end
		
		
end


-- 1:皓月装备；2:藏剑皓月；3:耀阳装备；4:藏剑耀阳；
Tb_part = {
	[1] = {
		{3064, 1, 2}, 
		{3065, 2, 2}, 
		{3066, 1, 4}, 
		{3067, 2, 4}, 
		{3068, 1, 3}, 
		{3069, 2, 3}, 
		{3070, 1, 6}, 
		{3071, 2, 6}, 
		{3072, 3, 6}, 
		{3073, 4, 6}, 
		{3074, 3, 8}, 
		{3075, 4, 8}, 
		{3076, 3, 9}, 
		{3077, 4, 9}, 
		{3078, 1, 11}, 
		{3079, 2, 11}, 
		{3080, 3, 11}, 
		{3081, 4, 11}, 
		{3082, 1, 12}, 
		{3083, 2, 12}, 
		{3084, 3, 12}, 
		{3085, 4, 12}, 
		{3086, 1, 14}, 
		{3087, 2, 14}, 
		{3088, 3, 14}, 
		{3089, 4, 14}, 
		{3090, 1, 15}, 
		{3091, 2, 15}, 
		{3092, 3, 15}, 
		{3093, 4, 15}, 
		{3094, 1, 17}, 
		{3095, 2, 17}, 
		{3096, 3, 17}, 
		{3097, 4, 17}, 
		{3098, 1, 18}, 
		{3099, 2, 18}, 
		{3100, 3, 18}, 
		{3101, 4, 18}, 
		{3102, 1, 20}, 
		{3103, 2, 20}, 
		{3104, 3, 20}, 
		{3105, 4, 20}, 
		{3106, 1, 21}, 
		{3107, 2, 21}, 
		{3108, 3, 21}, 
		{3109, 4, 21}, 
		{3110, 1, 23}, 
		{3111, 2, 23}, 
		{3112, 1, 25}, 
		{3113, 2, 25}, 
		{3114, 3, 25}, 
		{3115, 4, 25}, 
		{3116, 1, 26}, 
		{3117, 2, 26}, 
		{3118, 3, 26}, 
		{3119, 4, 26}, 
		{3120, 1, 27}, 
		{3121, 2, 27}, 
		{3122, 3, 27}, 
		{3123, 4, 27}, 
		{3124, 3, 29}, 
		{3125, 4, 29}, 
		{3126, 3, 30}, 
		{3127, 4, 30}, 
		{4101, 1, 31}, 
		{4102, 2, 31}, 
		{4103, 3, 31}, 
		{4104, 4, 31}, 		
		{4105, 1, 32}, 
		{4106, 2, 32}, 		
	},
	[2] = {
		{13064, 1, 2}, 
		{13065, 2, 2}, 
		{13066, 1, 4}, 
		{13067, 2, 4}, 
		{13068, 1, 3}, 
		{13069, 2, 3}, 
		{13070, 1, 6}, 
		{13071, 2, 6}, 
		{13072, 3, 6}, 
		{13073, 4, 6}, 
		{13074, 3, 8}, 
		{13075, 4, 8}, 
		{13076, 3, 9}, 
		{13077, 4, 9}, 
		{13078, 1, 11}, 
		{13079, 2, 11}, 
		{13080, 3, 11}, 
		{13081, 4, 11}, 
		{13082, 1, 12}, 
		{13083, 2, 12}, 
		{13084, 3, 12}, 
		{13085, 4, 12}, 
		{13086, 1, 14}, 
		{13087, 2, 14}, 
		{13088, 3, 14}, 
		{13089, 4, 14}, 
		{13090, 1, 15}, 
		{13091, 2, 15}, 
		{13092, 3, 15}, 
		{13093, 4, 15}, 
		{13094, 1, 17}, 
		{13095, 2, 17}, 
		{13096, 3, 17}, 
		{13097, 4, 17}, 
		{13098, 1, 18}, 
		{13099, 2, 18}, 
		{13100, 3, 18}, 
		{13101, 4, 18}, 
		{13102, 1, 20}, 
		{13103, 2, 20}, 
		{13104, 3, 20}, 
		{13105, 4, 20}, 
		{13106, 1, 21}, 
		{13107, 2, 21}, 
		{13108, 3, 21}, 
		{13109, 4, 21}, 
		{13110, 1, 23}, 
		{13111, 2, 23}, 
		{13112, 1, 25}, 
		{13113, 2, 25}, 
		{13114, 3, 25}, 
		{13115, 4, 25}, 
		{13116, 1, 26}, 
		{13117, 2, 26}, 
		{13118, 3, 26}, 
		{13119, 4, 26}, 
		{13120, 1, 27}, 
		{13121, 2, 27}, 
		{13122, 3, 27}, 
		{13123, 4, 27}, 
		{13124, 3, 29}, 
		{13125, 4, 29}, 
		{13126, 3, 30}, 
		{13127, 4, 30}, 
		{14101, 1, 31}, 
		{14102, 2, 31}, 
		{14103, 3, 31}, 
		{14104, 4, 31}, 		
		{14105, 1, 32}, 
		{14106, 2, 32}, 	
	},
	[3] = {
		{3128, 1, 2},
		{3129, 2, 2},
		{3130, 1, 4},
		{3131, 2, 4},
		{3132, 1, 3},
		{3133, 2, 3},
		{3134, 1, 6},
		{3135, 2, 6},
		{3136, 3, 6},
		{3137, 4, 6},
		{3138, 3, 8},
		{3139, 4, 8},
		{3140, 3, 9},
		{3141, 4, 9},
		{3142, 1, 11},
		{3143, 2, 11},
		{3144, 3, 11},
		{3145, 4, 11},
		{3146, 1, 12},
		{3147, 2, 12},
		{3148, 3, 12},
		{3149, 4, 12},
		{3150, 1, 14},
		{3151, 2, 14},
		{3152, 3, 14},
		{3153, 4, 14},
		{3154, 1, 15},
		{3155, 2, 15},
		{3156, 3, 15},
		{3157, 4, 15},
		{3158, 1, 17},
		{3159, 2, 17},
		{3160, 3, 17},
		{3161, 4, 17},
		{3162, 1, 18},
		{3163, 2, 18},
		{3164, 3, 18},
		{3165, 4, 18},
		{3166, 1, 20},
		{3167, 2, 20},
		{3168, 3, 20},
		{3169, 4, 20},
		{3170, 1, 21},
		{3171, 2, 21},
		{3172, 3, 21},
		{3173, 4, 21},
		{3174, 1, 23},
		{3175, 2, 23},
		{3176, 1, 25},
		{3177, 2, 25},
		{3178, 3, 25},
		{3179, 4, 25},
		{3180, 1, 26},
		{3181, 2, 26},
		{3182, 3, 26},
		{3183, 4, 26},
		{3184, 1, 27},
		{3185, 2, 27},
		{3186, 3, 27},
		{3187, 4, 27},
		{3188, 3, 29},
		{3189, 4, 29},
		{3190, 3, 30},
		{3191, 4, 30},
		{4107, 1, 31}, 
		{4108, 2, 31}, 
		{4109, 3, 31}, 
		{4110, 4, 31}, 		
		{4111, 1, 32}, 
		{4112, 2, 32}, 
	},
	[4] = {
		{15128, 1, 2}, 
		{15129, 2, 2}, 
		{15130, 1, 4}, 
		{15131, 2, 4}, 
		{15132, 1, 3}, 
		{15133, 2, 3}, 
		{15134, 1, 6}, 
		{15135, 2, 6}, 
		{15136, 3, 6}, 
		{15137, 4, 6}, 
		{15138, 3, 8}, 
		{15139, 4, 8}, 
		{15140, 3, 9}, 
		{15141, 4, 9}, 
		{15142, 1, 11}, 
		{15143, 2, 11}, 
		{15144, 3, 11}, 
		{15145, 4, 11}, 
		{15146, 1, 12}, 
		{15147, 2, 12}, 
		{15148, 3, 12}, 
		{15149, 4, 12}, 
		{15150, 1, 14}, 
		{15151, 2, 14}, 
		{15152, 3, 14}, 
		{15153, 4, 14}, 
		{15154, 1, 15}, 
		{15155, 2, 15}, 
		{15156, 3, 15}, 
		{15157, 4, 15}, 
		{15158, 1, 17}, 
		{15159, 2, 17}, 
		{15160, 3, 17}, 
		{15161, 4, 17}, 
		{15162, 1, 18}, 
		{15163, 2, 18}, 
		{15164, 3, 18}, 
		{15165, 4, 18}, 
		{15166, 1, 20}, 
		{15167, 2, 20}, 
		{15168, 3, 20}, 
		{15169, 4, 20}, 
		{15170, 1, 21}, 
		{15171, 2, 21}, 
		{15172, 3, 21}, 
		{15173, 4, 21}, 
		{15174, 1, 23}, 
		{15175, 2, 23}, 
		{15176, 1, 25}, 
		{15177, 2, 25}, 
		{15178, 3, 25}, 
		{15179, 4, 25}, 
		{15180, 1, 26}, 
		{15181, 2, 26}, 
		{15182, 3, 26}, 
		{15183, 4, 26}, 
		{15184, 1, 27}, 
		{15185, 2, 27}, 
		{15186, 3, 27}, 
		{15187, 4, 27}, 
		{15188, 3, 29}, 
		{15189, 4, 29}, 
		{15190, 3, 30}, 
		{15191, 4, 30}, 
		{14101, 1, 31}, 
		{14102, 2, 31}, 
		{14103, 3, 31}, 
		{14104, 4, 31}, 
		{16107, 1, 31}, 
		{16108, 2, 31}, 
		{16109, 3, 31}, 
		{16110, 4, 31}, 
		{16111, 1, 32}, 
		{16112, 2, 32}, 
	},
}

Tb_weapon = {
	[1] = {
		{8972, 2}, 
		{8973, 4}, 
		{8974, 3}, 
		{8975, 6}, 
		{8976, 8}, 
		{8977, 9}, 
		{8978, 11}, 
		{8979, 12}, 
		{8980, 14}, 
		{8981, 15}, 
		{8982, 17}, 
		{8983, 18}, 
		{8984, 20}, 
		{8985, 21}, 
		{8986, 23}, 
		{8987, 25}, 
		{8988, 26}, 
		{8989, 27}, 
		{8990, 29}, 
		{8991, 30}, 
		{9055, 31},
		{9056, 32},
	},
	[2] = {
		{28972, 2}, 
		{28973, 4}, 
		{28974, 3}, 
		{28975, 6}, 
		{28976, 8}, 
		{28977, 9}, 
		{28978, 11}, 
		{28979, 12}, 
		{28980, 14}, 
		{28981, 15}, 
		{28982, 17}, 
		{28983, 18}, 
		{28984, 20}, 
		{28985, 21}, 
		{28986, 23}, 
		{28987, 25}, 
		{28988, 26}, 
		{28989, 27}, 
		{28990, 29}, 
		{28991, 30}, 
		{29055, 31},
		{29056, 32},
	},
	[3] = {
		{8992, 2},
		{8993, 4},
		{8994, 3},
		{8995, 6},
		{8996, 8},
		{8997, 9},
		{8998, 11},
		{8999, 12},
		{9000, 14},
		{9001, 15},
		{9002, 17},
		{9003, 18},
		{9004, 20},
		{9005, 21},
		{9006, 23},
		{9007, 25},
		{9008, 26},
		{9009, 27},
		{9010, 29},
		{9011, 30},
		{9065, 31},
		{9064, 32},		
	},
	[4] = {
		{20992, 2}, 
		{20993, 4}, 
		{20994, 3}, 
		{20995, 6}, 
		{20996, 8}, 
		{20997, 9}, 
		{20998, 11}, 
		{20999, 12}, 
		{21000, 14}, 
		{21001, 15}, 
		{21002, 17}, 
		{21003, 18}, 
		{21004, 20}, 
		{21005, 21}, 
		{21006, 23}, 
		{21007, 25}, 
		{21008, 26}, 
		{21009, 27}, 
		{21010, 29}, 
		{21011, 30},
		{21065, 31}, 
		{21064, 32}, 
	},
}

Tb_ring = {
	[1] = {3175, 3177, 3179, 3181, 3183},
	[2] = {3175, 3177, 3179, 3181, 3183},
	[3] = {3176, 3178, 3180, 3182, 3184},
	[4] = {3176, 3178, 3180, 3182, 3184},
}

function get_suit_equipment(nType, nQianghua)
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = gf_IsPlayerRoute();
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能领取。");
		return
	end;
	local nID2,nID3,nID4 = 0,0,0;
	local tbWeaponID2 = {nil, 3, 8, 0, nil, 1, nil, 2, 10, nil, 0, 5, nil, 2, 9, nil, 6, 4, nil, 7, 11, nil, 2, nil, 3, 9 , 11, nil, 13, 12, 14, 2};
	nID2 = tbWeaponID2[nRoute];
	
	for i,v in Tb_part[nType] do
		if Tb_part[nType][i][2] == nBody and Tb_part[nType][i][3] == nRoute then
			nID3 = Tb_part[nType][i][1];
		end;
	end;
	
	for i,v in Tb_weapon[nType] do
		if Tb_weapon[nType][i][2] == nRoute then
			nID4 = Tb_weapon[nType][i][1];
		end;
	end;
	
	if zgc_pub_goods_add_chk(9,600) ~= 1 then
		return
	end

	fe_AddFactionEquipment(103, nID3, nQianghua)
	fe_AddFactionEquipment(100, nID3, nQianghua)
	fe_AddFactionEquipment(101, nID3, nQianghua)
	fe_AddFactionEquipment(nID2, nID4, nQianghua)
	for i = 1, getn(Tb_ring[nType]) do
		fe_AddFactionEquipment(102, Tb_ring[nType][i], 0)
	end
end;

function fe_AddFactionEquipment(nID2, nID3, nQianghua)
	local name = GetItemName(0,nID2,nID3)
	if nID2 == 102 or nID2 == 105 or nQianghua == 0 then
		AddItem(0,nID2,nID3,1,4,-1,-1,-1,-1,-1,-1,-1);
	elseif nID2 == 196 or nID2 == 114  then
		AddItem(2,nID2,nID3,1,1);
	elseif nID2 == 154 then
		local _, nIndex = AddItem(0,nID2,nID3,1,4,-1,-1,-1,-1,-1,-1,-1,nQianghua);
		FeedItem(nIndex,1000000)
	else
		AddItem(0,nID2,nID3,1,4,-1,-1,-1,-1,-1,-1,-1,nQianghua);
	end
	Msg2Player("您获得了["..name.."]×1");
end;

--给灵石
function fe_GiveLingShi(tPara)
	local nLevel = tPara[1]
	local nCount = tPara[2]
	if nCount > 0 then
		lspf_AddLingShiInBottle(nLevel,nCount);
	end;
end

function zgc_pub_goods_add_chk(goods_num,goods_weight)
	if GetFreeItemRoom() < goods_num then
		Talk (1,"","您的背包空间不足<color=yellow>"..goods_num.."<color>，获取失败！")
		return 0
	elseif (GetMaxItemWeight() - GetCurItemWeight()) < goods_weight then			--判断玩家负重和空间
		Talk (1,"","您的背包负重不足<color=yellow>"..goods_weight.."<color>，获取失败！")
		return 0
	else 
		return 1
	end
end

function nothing()
end;
