Include("\\script\\class\\ktabfile.lua");
Include("\\script\\lib\\getrectangle_point.lua") --获得矩形点

tbKunLun = {}
tbKunLun.nMapId		= 509

tbKunLun.tbDialogNpc	= 
{
	--昆仑相关
	{"昆仑掌门新","周不惑",509,1592,3200,"\\script\\西北区\\昆仑\\npc\\周不惑.lua"},
	{"秦不智","秦不智",509,1578,3194,"\\script\\西北区\\昆仑\\npc\\秦不智.lua"},
	{"陈不为","陈不为",509,1536,3228,"\\script\\西北区\\昆仑\\npc\\陈不为.lua"},
	{"马不前","马不前",509,1581,3249,"\\script\\西北区\\昆仑\\npc\\马不前.lua"},
	{"王不凡","王不凡",509,1427,3443,"\\script\\西北区\\昆仑\\npc\\王不凡.lua"},
	{"昆仑副掌门新","梅不容",509,1561,3270,"\\script\\西北区\\昆仑\\npc\\梅不容.lua"},
	{"昆仑长老新","叶子秋",509,1551,3214,"\\script\\西北区\\昆仑\\npc\\叶子秋.lua"},
	{"昆仑长老新","赵子平",509,1432,3305,"\\script\\西北区\\昆仑\\npc\\赵子平.lua"},
	{"云望舒","云望舒",509,1618,3160,"\\script\\西北区\\昆仑\\npc\\云望舒.lua"},
	{"云羲和","云羲和",509,1615,3213,"\\script\\西北区\\昆仑\\npc\\云羲和.lua"},
	{"西南储物柜","物品保管人",509,1600,3229,"\\script\\西北区\\昆仑\\npc\\物品保管人.lua"},
	{"狐妖","妖狐",509,1581,3109,"\\script\\西北区\\昆仑\\npc\\妖狐.lua"},
--	{"昆仑天师首席大弟子","昆仑首席大弟子",509,1588,3215,"\\script\\西北区\\昆仑\\npc\\昆仑首席大弟子.lua"},
	{"天元法阵石柱","天元法阵石柱",509,1577,3098,"\\script\\西北区\\昆仑\\npc\\石柱.lua"},
	{"天元法阵石柱","天元法阵石柱",509,1587,3099,"\\script\\西北区\\昆仑\\npc\\石柱.lua"},
	{"天元法阵石柱","天元法阵石柱",509,1589,3115,"\\script\\西北区\\昆仑\\npc\\石柱.lua"},
	{"天元法阵石柱","天元法阵石柱",509,1580,3120,"\\script\\西北区\\昆仑\\npc\\石柱.lua"},
	{"天元法阵石柱","天元法阵石柱",509,1572,3112,"\\script\\西北区\\昆仑\\npc\\石柱.lua"},
--	{"门派练功木桩","门派练功木桩",404,1455,2624,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
--	{"门派练功木桩","门派练功木桩",404,1446,2634,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
--	{"门派练功木桩","门派练功木桩",404,1452,2644,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
--	{"门派练功木桩","门派练功木桩",404,1459,2634,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
}
