
-- ====================== 文件信息 ======================

-- 剑侠情缘onlineII 随机任务数据头文件
-- Edited by peres
-- 2005/08/08 PM 13:45

-- 只有晚上他们是在一起的
-- 他靠近她，拥抱她
-- 他的手指和皮肤
-- 她看着他，心里柔软而疼痛
-- 她想，她还是爱他
-- 她不想抱怨什么
-- 每天晚上他们都在做爱
-- 她不知道，除了这种接触，她的安全感和温暖，还能从哪里取得
-- 她喜欢那一瞬间。仿佛在黑暗的大海上，漂向世界的尽头

-- ======================================================

  FactionBossName = {

	-- 少林
 [1]="玄慈",

	-- 武当
  [2]="紫鹤真人",

	-- 峨眉
 [3]="真如师太",

	-- 丐帮
  [4]="龙在天",

	-- 唐门
 [5]="“老老”",

	-- 杨门
  [6]="车太君",

	-- 五毒
  [7]="白盈盈",

}


  FactionBossTitle = {

	-- 少林
 [1]="方丈",

	-- 武当
 [2]="掌门",

	-- 峨眉
 [3]="掌门",

	-- 丐帮
 [4]="帮主",

	-- 唐门
 [5]="“老老”",

	-- 杨门
 [6]="掌门",

	-- 五毒
 [7]="教主",
}

  WorldInsidePos = {

  [200] = {200,1254,2738},
  [300] = {300,1702,3665},
    [204] = {204,1501,3328}, -- 未知位置
    [209] = {209,1528,3246}, -- 未知位置
    [303] = {303,1810,3007}, -- 未知位置
    [305] = {305,1440,3105}, -- 未知位置
    [312] = {312,1713,3469}, -- 未知位置
  [350] = {350,1525,2862},


}
