
DEBUG_VERSION 					= 0;				--1表示调试版本，0表示外网发布版本
IB_VERSION 						= 1				--1表示是免费区，0表示收费区

g_nLastCheckTime 					= 0;				-- 保存上次检测服务器人数的时间点
g_CHECKINTERVAL 				= 10*60;		--检测服务器人数的最小间隔

--活动时间
SP_START = {2021, 02, 06, 0, 0, 0};
SP_END  = {2021, 02, 25, 23, 59, 59};

TSK_YEARS_BEGIN_DATE 			= 1357;      		-- 欢度佳节称号领取开始时间 
TSK_YEARS_END_DATE 			= 1358;       		-- 欢度佳节称号领取结束时间
TSK_YEARS_EXP_DATE 				= 1359;       		--当天是否领满了经验
TSK_YEARS_EXP_NUM 				= 1360;         		--当天给了多少次经验

TASK_YEARS_BIT 					= 1313         		-- BIT:20-22
TASKID_OPEN_BOX 				= 896;         		-- 每日拾取年兽数量
TASK_YEARS_DAILYDEVOTE 		= 897			-- 记录新春活动每日贡献点
TASK_YEARS_DEVOTE 				= 898			-- 记录新春活动总贡献点

GiveLiBaoTag 						= 20; 			--是否领取欢度佳节礼盒
OpenBoxFlag 						= 21;
GiveZhiZunTag 						= 22; 			--是否领取贡献至尊礼盒

g_nYearsDays 						= 7;              		--经验持续时间：天
g_nYearsExpNums 					= 120;          		--每天起效经验次数：次

SP_MISSION_ID 					= 84;
SP_TIMER_ID 						= 100;

SP_MISION_V1 						= 1;

SP_NIANSHOU_POS = {
	{200, 1381, 2894, "汴京(172,180)"},
	{300, 1764, 3554, "成都(220,222)"},
	{100, 1416, 2996, "泉州(176,187)"},	
}

SP_NIANSHOU_AI_POS = {
	[200] = {{1380,2906},{1369,2893},{1380,2880},{1393,2893}},
	[300] = {{1763,3565},{1752,3554},{1763,3539},{1776,3553}},
	[100] = {{1416,3007},{1403,2995},{1416,2982},{1428,2995}},
}

SP_NIANSHOU_FIGHT_POS = {
	{203,1461,3002,182,187,"汴京府西"},
	{301,1517,3023,189,188,"成都府西"},
	{108,1565,3093,195,193,"泉州府北"},
}

tNewYearItem = {
	{"鸿运当头", {2,95,5970}, 2},
	{"年年有鱼", {2,95,5971}, 4},
	{"岁岁平安", {2,95,5972}, 6},
	{"五福临门", {2,95,5973}, 8},
	{"欢乐今宵", {2,95,5974}, 15},
}
