--脚本功能：海上龙舟战字符串集合
--功能设计：大熊、小宇宙
--功能开发：波波、村长
--功能测试：小熊、饭姐
--开发时间：2011-8-23
--修改记录：
sNpcNameEntrance="<color=green>龙舟战接引人<color>:"
sNpcNameNeeder="<color=green>军需官<color>:"
sNpcNamePilot="<color=green>海上领航员<color>: "
tSTRING_NPC_SAY = {
	--接引NPC对话
	[1] = {
		[1] = {
			sNpcNameEntrance.."我在海上设计了一个龙舟竞技场，不知道您是否愿意参加?",
			{
				"◆ 参加龙舟战(报名费6金)/join_mission",
				"◆ 领取上一场奖励/get_award_infor",				
				"◆ 海上龙舟战介绍/mision_info",
				"◆ 结束对话/nothing",
			},
		},
		[2] = {
			sNpcNameEntrance.."老人对这次海建龙洲战役非常热心，希望伟大的英雄们可以运用他们的卓越技能",
			{
				"◆ 参加条件/mission_condition",
				"◆ 活动时间/mission_open_time",
				"◆ 龙舟战规则/mission_rule",
				"◆ 龙舟战奖励/mission_prize",
				"◆ 返回/main",
				"◆ 结束对话/nothing",
			},
		},
		
	},

}
--============介绍信息
tSTRING_INTRODUCE = {
	[1] = "达到条件的每一个玩家在活动开启时间都可以报名参加，报名费6金",
	[2] = "活动时间:  10:00 - 11:00, 16:00 - 17:00,  22:00 - 23:00",
	[3] = "\n\t<color=green>1.<color> 报名参加的玩家将随机分配到宋或辽阵营.当双方达到1人时，战斗将开始。 \n\t<color=green>2.<color> 每边有100个积分点，随着战斗的进行，得分将逐渐降低，先将得分减去0的那边将输掉比赛对手获胜； \n\t<color=green>3.<color> 战斗时间持续40分钟，系统自动结束比赛，得分较高的一方将获胜； \n\t<color=green>4.<color> 如果双方的得分相等，则失去统治地位的一方将失去得分。 如果统治2的一方没有被击败，那么战斗就开始了.\n",
	[4] = "\n\t<color=green>1.<color> 获胜者将获得200,000经验，失败者将获得100,000经验； \n\t<color=green>2.<color> 每个角色每天最多可获得60万点经验.",
}
--====TALK对话
tSTRING_NPC_TALK = {
	[1] = "海上龙舟战还未开始，请在10：00-11：00、16：00-17：00或22：00-23：00 参加.",
	[2] = "海上龙舟战非常危险，等侠士等级达到 %d 级，再回来参加!",
	[3] = "你没有加入任务流派,不能参加活动!!",
	[4] = "参加海上龙舟战你得学会至少一套55技能!",
	[5] = "你上次的奖励还没有领取,请先领取了再来报名!",
	[6] = "组队不能参加龙舟战,请先离开队伍.﹏.",
	[7] = "少侠没参加过海战龙珠,赶快去报名吧!",
	[8] = "每天最多只能获得60万的经验，超过了无法再获得经验奖励.",
	[9] = "龙州海战取得胜利,少侠获得奖励%d经验! ",
	[10] = "前一场龙州海战战败,少侠只能获得%d经验!",
	[11] = "所有的地图都满了,我们稍后再来。",
	[12] = "今天的经验成绩限制已满",
	[13] = "前一场龙州海战已成平局,少侠可获得%d经验奖励!",
	[14] = "你带不到6金,不能参加海战龙州。",
}
--===系统消息
tSRING_SYS_MSG = {
	[1] = "%s加入海上龙舟战!",
	[2] = "进入战场,找军需官领取龙舟.准备战斗",
	[3] = "装备龙舟进入战斗,每种龙舟将获得3个<龙舟战技能>, 请参阅技能列表页面并设置快捷键.",
	[4] = "对战阶段：%s\n对战时间：%s\n对战人数：宋%d<->%d辽\n对战积分：宋%d vs 辽%d",
}

--====军需官对话
tSTRING_NEEDER_DLG = {
	[1] = "介绍如何玩龙舟战/introduce",
	[2] = "龙舟特色介绍/drag_specialty",
	[3] = "领取龙舟/get_drag",
	[4] = "离开战场/exit_battle",
	[5] = "结束对话/do_nothing",
}
--======龙舟种类
tSTRING_DRAG_KIND = {
	[1] = "青龙龙舟(中速,中防御,中伤害)/qing_long",
	[2] = "玄武龙舟(低速,高防御,低伤害)/xuan_wu",
	[3] = "白虎龙舟(高速,低防御,中伤害)/bai_hu",
	[4] = "朱雀龙舟(低速,低防御,高伤害)/zhu_que",
	[5] = "结束对话/main",
}

--=======领取龙舟NPC对话
tSTRING_DRAG_NPC = {
	[1] = "少侠已经接收龙船了",
	[2] = "大军即将下水 少侠要赶快准备行装, 为国家而战!",
	[3] = "少侠可以根据自己的喜好选择龙舟!",
	[4] = "少侠想知道更多吗?",
	[5] = "缺乏确定性想要离开战场?",
	[6] = "离开战场/exit_ensure",
	[7] = "有什么事吗?",
	[8] = "目前，战斗尚未开始，无法进入.",
	[9] = "无需乘坐龙舟，我们可以进入战场.",
	[10] = "需要取下装备才能进入战场!",
	[11] = "所有地图都已满，请稍后再来!",
	[12] = "进入战场需要找军需官领取龙舟",
	[13] = "进入战场之前清除身上的坐骑",
}
--========战场规则
tSTRING_BATTLE_RULE = {
	[1] = "战斗规则/fight_rule",
	[2] = "指挥船规则/firedrag_rule",
	[3] = "胜负规则/sf_rule",
	[4] = "结束对话/main",
}
--=====规则
tSTRING_RULE_DETAIL = {
	[1] = "为了打败敌人,需要军士们的全力支持,少侠请到柔关军挑选并接收各种准备攻击敌人的龙船.",
	[2] = "这场战斗持续了一段时间,指挥官会派火船攻击敌人,因为火船充满了火药,所以需要骑士护送到敌人的营地.当火船被运到敌人的营区时敌人会造成巨大的杀伤,导致敌人迅速分崩离析.",
	[3] = "骑士们可以打败敌人的龙舟,或者护送火船进入敌人的营地,减少敌人的战斗点, 当敌人的战斗点降到零时,我们这边就赢了,如果我们先退到零,我们就完蛋了.",
}
--======龙舟特点
tSTRING_DRAG_SPECAIL = {
	[1] = "<color=green>青龙龙舟:<color>中等速度,中等防御,中等攻击,快速的机器攻击,具有震撼技能,被击败时不会自我毁灭.",
	[2] = "<color=green>玄武龙舟<color>低速,高护甲,低攻击,控制人群,麻醉技能,可以恢复盟友的生命力.",
	[3] = "<color=green>白虎龙舟<color>高速,低护甲,中度攻击,线路攻击,击退敌人,提高团队速度的能力.",
	[4] = "<color=green>朱雀龙舟:<color>低速,低护甲,高攻击,团队攻击,可以抵抗暴击伤害,也可以进入狂潮.",
}
--=======计时器脚本内的字符串
tSTRING_MISSION = {
	[1] = "龙舟海战双方兵力不足%d战斗无法开启.",
	[2] = "龙舟海战将在%d分钟内开始,火船是胜利的关键所在,英雄们,做好准备.",
	[3] = "%s 和 %s 海战龙舟 %d 不分胜负.",
	[4] = "水督军: 战争开始了,大家赶快上战场吧.",
	[5] = "%s 赢得了这次海战.",
	[6] = "现在双方的人数是: %s[%d]: [%d]%s",
	[7] = "杨七秀: 下次本姑娘会让你们惨败.",
	[8] = "萧秦: 哎哟,我怕得发抖, 嘿,这位老人已经准备好等你们把尸体搬到这里来了.",
	[9] = "龙舟海战结束了, %s 赢得了胜利.英雄们都表现得很出色,去找<color=yellow>海战接引使<color>来获得奖励.",
	[10] = "龙舟海战结束了, %s 赢得了胜利.英雄们都表现得很出色,去找<color=yellow>海战接引使<color>来获得奖励.",
	[11] = "龙舟海战结束了,敌我不分胜负.英雄们都表现得很出色,去找<color=yellow>海战接引使<color>来获得奖励.",
	[12] = "敌人面前竟敢打瞌睡, 不,不!",
	[13] = "杨七秀: 萧秦,快出来应战.",
	[14] = "杨七秀: 小子,你怕我了吗,本姑娘不是那么容易欺负的.",
	[15] = "萧秦:哈哈,小丫头跟我打,还早几年,回去再练吧.",
	[16] = "萧秦:哇,今天大胜,回去庆祝吧!",
	[17] = "辽军派火船出征",
	[18] = "萧秦:小丫头,看我的厉害,把它们烧了!",
	[19] = "宋军派火船出征",
	[20] = "杨七秀:小子,看我烧光你的军营吧.",
	[21] = "支援出现了",
	[22] = "宋军的火船成功闯入辽营,辽军的战斗点锐减。",
	[23] = "辽军的火船成功闯入宋营,宋军的战斗点锐减。",
	[24] = "宋军的火船被摧毁了,宋军的战斗点也缩小了",
	[25] = "辽军的火船被摧毁了,辽军的战斗点也缩小了",
	[26] = "杨七秀被打败了宋军的战斗点减少了15",
	[27] = "萧秦战败,辽军的战斗点减少了15",
}
--=========异常字符串
tSTRING_MISSION_LOG = {
	[1] = "[H秈 Chi課 Long Ch﹗]: b総 u l鏸 kh玭g x竎 nh",
	[2] = "[H秈 Chi課 Long Ch﹗]: FreeDynamicMap l鏸, nRetCode:",
	[3] = "[H秈 Chi課 Long Ch﹗]: LZZ_GetMSPlayerIndex h祄 s?g苝 s?c?s?ngi trong tr薾 doanh so v韎 getn(tIndex) s?lng kh玭g gi鑞g nhau. S?ngi trong tr薾 doanh l?",
	[4] = "[H秈 Chi課 Long Ch﹗]: LZZ_OperateAllPlayer(), ti誴 d蒼 c馻 ngi ch琲 trong IDTab nh?h琻 ho芻 b籲g 0",
	[5] = "[H秈 Chi課 Long Ch﹗]: kh雐 ng ng nh藀 th蕋 b筰",
	[6] = "[H秈 Chi課 Long Ch﹗]: k?n╪g ID: %d x鉧 th蕋 b筰",
	[7] = "[H秈 Chi課 Long Ch﹗]: x鉧 thuy襫 r錸g th蕋 b筰",
}
--============领航员相关
tSTRING_PILOT_NPC = {
	[1] = "我想进入战场/begin_fight",
	[2] = "结束对话/do_nothing",
}

--==========漂流箱相关
tSTRING_FLOAT_BOX = {
	[1] = "获得效果: 伤害增加，持续30秒，效果不叠加.",
	[2] = "获得效果: 提高防御力，持续30秒，没有叠加效果.",
	[3] = "获得效果: 移动速度提高，持续30秒，没有叠加效果.",
	[4] = "获得效果: 隐身状态，持续30秒，如果切换为战斗，隐身将消失，效果不会叠加.",
}