Include("\\script\\class\\ktabfile.lua");

tbYuRongFeng = {}

tbYuRongFeng.tbDialogNpc	= 
{
	--玉融峰相关
	{"西南马车船夫","车夫",426,1605,3175,"\\script\\西南区\\玉融峰\\npc\\npc_chehu.lua"},
	{"玉辰子宣辕","玉辰子宣辕",426,1511,3095,"\\script\\missions\\dixuangong\\npc\\entrynpc.lua"},
	{"素仙秋若水对话","素仙秋若水",426,1535,2956,"\\script\\missions\\hunduantongtianding\\ttd_mission_entry_npc.lua"},	
	{"无为上人杨胤秋","无为上人杨胤秋",426,1664,3099,"\\script\\missions\\dixuangong\\npc\\entrynpc.lua"},	
	
	{"澄信","澄信",426,1533,3149,"\\script\\西南区\\玉融峰\\npc\\澄信.lua"},
	{"袁玉","袁玉",426,1488,3105,"\\script\\西南区\\玉融峰\\npc\\袁玉.lua"},
	{"聂海风","聂海风",426,1519,2954,"\\script\\西南区\\玉融峰\\npc\\聂海风.lua"},
	{"李远筹","李远筹",426,1545,2907,"\\script\\西南区\\玉融峰\\npc\\李远筹.lua"},
	{"沈醉","沈醉",426,1581,2914,"\\script\\西南区\\玉融峰\\npc\\沈醉.lua"},
	{"吴念","吴念",426,1558,2970,"\\script\\西南区\\玉融峰\\npc\\吴念.lua"},
	{"中原储物柜","物品保管员(少阳)",426,1495,2990,"\\script\\西南区\\玉融峰\\npc\\中原储物柜.lua"},
	{"范星澜","【天枢剑】范星澜",426,1478,3010,"\\script\\西南区\\玉融峰\\npc\\范星澜.lua"},
	{"澄德","澄德",426,1517,3082,"\\script\\西南区\\玉融峰\\npc\\澄德.lua"},
	{"邝少常","邝少常",426,1532,3090,"\\script\\西南区\\玉融峰\\npc\\邝少常.lua"},
	{"澄涵","澄涵",426,1571,3134,"\\script\\西南区\\玉融峰\\npc\\澄涵.lua"},
	{"鲁伯能","药店老板(少阳)",426,1549,3108,"\\script\\西南区\\玉融峰\\npc\\药店老板.lua"},
	{"鲁伯能","药店老板(文史)",426,1629,3101,"\\script\\西南区\\玉融峰\\npc\\药店老板.lua"},
	{"清澜","清澜",426,1649,3138,"\\script\\西南区\\玉融峰\\npc\\清澜.lua"},
	{"龚慈心","龚慈心",426,1683,3118,"\\script\\西南区\\玉融峰\\npc\\龚慈心.lua"},
	{"清文","清文",426,1659,3060,"\\script\\西南区\\玉融峰\\npc\\清文.lua"},
	{"清虚","清虚",426,1658,2980,"\\script\\西南区\\玉融峰\\npc\\清虚.lua"},
	{"方音","【琴君】方音",426,1640,2965,"\\script\\西南区\\玉融峰\\npc\\方音.lua"},
	{"中原储物柜","物品保管员(文史)",426,1626,2950,"\\script\\西南区\\玉融峰\\npc\\中原储物柜.lua"},
	{"薛怀月","薛怀月",426,1629,2985,"\\script\\西南区\\玉融峰\\npc\\薛怀月.lua"},
	{"郎秋水","郎秋水",426,1599,3043,"\\script\\西南区\\玉融峰\\npc\\郎秋水.lua"},
	{"铸月锤李壕","铸月锤李壕",426,1587,3039,"\\script\\西南区\\玉融峰\\npc\\铸月锤李壕.lua"},
	{"摘星手迟东","摘星手迟东",426,1572,3039,"\\script\\西南区\\玉融峰\\npc\\摘星手迟东.lua"},
	{"融日火谭娜","融日火谭娜",426,1579,3047,"\\script\\西南区\\玉融峰\\npc\\融日火谭娜.lua"},
	{"融日火谭娜","公冶梦",426,1575,3044,"\\script\\西南区\\玉融峰\\npc\\公冶梦.lua"},
	{"关中客楚天行","关中客楚天行",426,1576,3017,"\\script\\西南区\\玉融峰\\npc\\关中客楚天行.lua"},
	{"叶孤棠","叶孤棠",426,1556,3038,"\\script\\西南区\\玉融峰\\npc\\叶孤棠.lua"},
	{"未开启的霜风崖","未开启的霜风崖",426,1579,3039,"\\script\\西南区\\玉融峰\\npc\\未开启的霜风崖.lua"},
	{"未开启的天阴圣地","未开启的天阴圣地",426,1564,2911,"\\script\\西南区\\玉融峰\\npc\\未开启的天阴圣地.lua"},	
	{"开启的血泊岭","开启的血泊岭",426,1535,2947,"\\script\\西南区\\玉融峰\\npc\\开启的血泊岭.lua"},	

	
}
