Include("\\settings\\static_script\\missions\\base\\mission_award_base.lua")
Include("\\script\\lib\\define.lua")
Include("\\script\\missions\\liangshan\\head.lua")
Include("\\script\\missions\\liangshan\\runtime_data_stat.lua")
Include("\\script\\online_activites\\head\\activity_normal_head.lua")

T_GOLD_BoxScript = {
	nil,
	nil,
	nil,
	"\\script\\missions\\liangshan\\npc\\box_gold4.lua",
	nil,
	nil,
	nil,
	"\\script\\missions\\liangshan\\npc\\box_gold8.lua",
}

T_GOLD_BOX_IDX = {}
function remove_gold_box()
--	for i,v in T_GOLD_BOX_IDX do
--		if GetNpcName(i) == "黄金宝箱" then
	--		SetNpcLifeTime(i, 0);
--		end
--	end
--	T_GOLD_BOX_IDX = {}
end

function create_box_gold(m,x,y, nStage)
	if not T_GOLD_BoxScript[nStage] then
		return
	end
	--local m, x, y = GetNpcWorldPos(nNpcIdx);
	local x2, y2 = x + random(-5, 5), y + random(-5, 5);
	local npc = CreateNpc("步非烟的百宝箱", "黄金宝箱", m, x2, y2);
	if npc and npc > 0 then
		T_GOLD_BOX_IDX[npc] = npc
		--SetNpcLifeTime(npc, 180);
		SetNpcScript(npc, T_GOLD_BoxScript[nStage]);
	else
		print("create 步非烟的百宝箱 fail")
	end
end

function box_gold_create_ib_card_require()
	local tRequire = {};
	for i = 1,8 do
		tinsert(tRequire,{2, 97, 236,2});--图标显示
	end
	return tRequire;
end

function on_open_box_gold_card_stage4(nId)
	on_open_gold_box_card(4,nId)
end
function on_open_box_gold_card_stage8(nId)
	on_open_gold_box_card(8,nId)
end

function on_open_gold_box_card(nStage, nId)
	local m = GetWorldPos();
	if m < 65537 then
		SendScript2Client('Open([[ma]])');
		return 0;
	end
	local nRet = MissionAward_RandAward(nStage, nId, t_card_award, nil);
	
	if nRet == 1 then
		if nId < 8 then
		--_stat_when_open_free_card()
	else
		--_stat_when_open_ib_card()
--		_gold_box_stat_when_ib_consume(1)--IB消耗统计
  	end
	end
end

function on_open_box_gold(nStage)
	local szFunc = format("on_open_box_gold_card_stage%d", nStage)
	MA_Mission_OpenUI(MISSION_ID,0, T_GOLD_BoxScript[nStage], szFunc, box_gold_create_ib_card_require());
	SetNpcLifeTime(GetTargetNpc(), 0);
	SetNpcScript(GetTargetNpc(), "");
--	gf_TeamOperateEX(vaf_award_api, "tLiangShanJinBox") --2XU活动
end

_t_free_award_no_stage =
{
	n_other_group_rate = 10000,--随机到代币组的概率
	t_daibi_group =
	{
		--t_item_para = {name, {g,d,p,n,bind}, expire_days,bGblMsg, {nNeedRoom, nNeedWeight}}
        --{{"紫霞秘籍",{0,107,65,1, 4}, 720, bGblMsg}, 150},
        --t_item_para = {{function, {nCount, nBind, nExpireDays, bGblMsg, {nNeedRoom, nNeedWeight}}}, rate}
        --{{MissionAward_GiveFactionEquip4, {1, nil, nil, 0}}, 10000},
	},
	--------------------------------------------
	t_equip_group = --杂物组
	{
	},
};

_t_free_award_stage =
{
	[4] = {
		n_equip_group_rate = 0,--随机到装备组的概率
		n_daibi_group_rate = 0,--随机到代币组的概率
        	t_other_group = { --装备组
        		----tPara = {nCount, nBind, nExpireDays, bGblMsg}
			{ {"4级蕴灵宝箱", {2, 95, 18329,1}, nil,nil, {1, 100}}, 1000},				
			{ {"凌波微步", {0, 112, 78,1}, nil,nil, {1, 100}}, 100},						
			{ {"神器", {2,95,55,1}, nil,nil, {1, 100}}, 1000},						
			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 1000},				
			{ {"大人参果", {2,0,553,1}, nil,nil, {1, 100}}, 1000},				
			{ {"军功章", {2,1,9999,1}, nil,nil, {1, 100}}, 1000},					
			{ {"千变梵天券", {2,95,247,1}, nil,nil, {1, 100}}, 1900},				
			{ {"陨铁碎片", {2,2,7,1}, nil,nil, {1, 100}}, 1000},
			{ {"陨铁", {2,2,8,1}, nil,nil, {1, 100}}, 1000},
			{ {"陨铁精石", {2,1,1009,1}, nil,nil, {1, 100}}, 1000},				
				
			
--			{ {"九转逍遥丹（力根）", {1, 0, 277,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（力身）", {1, 0, 278,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（力洞）", {1, 0, 279,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（力内）", {1, 0, 280,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（内根）", {1, 0, 281,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（内身）", {1, 0, 282,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（内洞）", {1, 0, 283,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（身根）", {1, 0, 284,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（身洞）", {1, 0, 285,1}, nil,nil, {1, 100}}, 10},
--			{ {"九转逍遥丹（洞根）", {1, 0, 286,1}, nil,nil, {1, 100}}, 10},				
--			{ {"陨铁碎片", {2,2,7,1}, nil,nil, {1, 100}}, 1500},
--			{ {"陨铁", {2,2,8,1}, nil,nil, {1, 100}}, 1500},
--			{ {"陨铁精石", {2,1,1009,1}, nil,nil, {1, 100}}, 1000},				
--			{ {"神器", {2,95,55,1}, nil,nil, {1, 100}}, 2500},				
--			{ {"军功章", {2,1,9999,1}, nil,nil, {1, 100}}, 2000},					
--			{ {"般若树种", {2,0,398,1,1}, nil,nil, {1, 100}}, 1000},				
--			{ {"金钱袋", {2,95,662,1}, nil,nil, {1, 100}}, 3000},				
--			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 1000},							
--			{ {"九转回魂丹", {1,0,32,1}, nil,nil, {1, 100}}, 500},								
--			{ {"神器", {2,95,55,1}, nil,nil, {1, 100}}, 2000},	
--			{ {"师门圣物", {2,95,205,1}, nil,nil, {1, 100}}, 2000},				
--			{ {"般若树种", {2,0,398,1,1}, nil,nil, {1, 100}}, 1000},				
--			{ {"金钱袋", {2,95,662,1}, nil,nil, {1, 100}}, 3000},				
--			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 1000},				
--			{ {"陨铁精石", {2,1,1009,1}, nil,nil, {1, 100}}, 500},				
--			{ {"九转回魂丹", {1,0,32,1}, nil,nil, {1, 100}}, 500},								
--			{ {"2级灵石原石", {2,95,554,1}, nil,nil,{1, 100} }, 500},
--			{ {"3级灵石原石", {2,95,555,1}, nil,nil,{1, 100} }, 1000},
--			{ {"4级灵石原石", {2,95,556,1}, nil,nil,{1, 100} }, 1000},
--			{ {"5级灵石原石", {2,95,557,1}, nil,nil,{1, 100} }, 500},
--			{ {"6级灵石原石", {2,95,558,1}, nil,nil, {1, 100}}, 500},
--			{ {"师门真卷残页", {2,96,176,1}, nil,nil, {1, 100}}, 200},
--			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 500},
--			{ {"小人参果", {2,0,552,1}, nil,nil, {1, 100}}, 800},
--			{ {"金钱袋", {2,95,662,1}, nil,nil, {1, 100}}, 200},
--			{ {"陨铁碎片", {2,2,7,1}, nil,nil, {1, 100}}, 400},
--			{ {"陨铁", {2,2,8,1}, nil,nil, {1, 100}}, 400},
--			{ {"陨铁精石", {2,1,1009,1}, nil,nil, {1, 100}}, 100},
--			{ {"神器", {2,95,55,1}, nil,nil, {1, 100}}, 200},
--			{ {"大人参果", {2,0,553,1}, nil,nil, {1, 100}}, 500},
--			{ {"九转回魂丹", {1,0,32,1}, nil,nil, {1, 100}}, 200},
--			{ {"师门圣物", {2,95,205,1}, nil,nil, {1, 100}}, 500},
--			{ {"梁山特产", {2,95,207,1}, nil,nil, {1, 100}}, 1000},
--			{ {"般若树种", {2,0,398,1,1}, nil,nil, {1, 100}}, 200},
--			{ {"星辰碎片", {2,201,1,1}, nil,nil, {1, 100}}, 100},

--			{ {"高级师门秘籍包裹", {2,97,128,1}, nil,nil,{1, 100} }, 200},
        	},
	},
	[8] = {
		n_equip_group_rate = 0,--随机到装备组的概率
		n_daibi_group_rate = 0,--随机到代币组的概率
        	t_other_group = {--装备组
			{ {"4级蕴灵宝箱", {2, 95, 18329,1}, nil,nil, {1, 100}}, 1000},				
			{ {"凌波微步", {0, 112, 78,1}, nil,nil, {1, 100}}, 100},						
			{ {"神器", {2,95,55,1}, nil,nil, {1, 100}}, 1000},						
			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 1000},				
			{ {"大人参果", {2,0,553,1}, nil,nil, {1, 100}}, 1000},				
			{ {"军功章", {2,1,9999,1}, nil,nil, {1, 100}}, 1000},					
			{ {"千变梵天券", {2,95,247,1}, nil,nil, {1, 100}}, 1900},				
			{ {"陨铁碎片", {2,2,7,1}, nil,nil, {1, 100}}, 1000},
			{ {"陨铁", {2,2,8,1}, nil,nil, {1, 100}}, 1000},
			{ {"陨铁精石", {2,1,1009,1}, nil,nil, {1, 100}}, 1000},							
--			{ {"2级灵石原石", {2,95,554,1}, nil,nil,{1, 100} }, 500},
--			{ {"3级灵石原石", {2,95,555,1}, nil,nil,{1, 100} }, 1000},
--			{ {"4级灵石原石", {2,95,556,1}, nil,nil,{1, 100} }, 1000},
--			{ {"5级灵石原石", {2,95,557,1}, nil,nil,{1, 100} }, 500},
--			{ {"6级灵石原石", {2,95,558,1}, nil,nil, {1, 100}}, 500},
--			{ {"师门真卷残页", {2,96,176,1}, nil,nil, {1, 100}}, 200},
--			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 500},
--			{ {"小人参果", {2,0,552,1}, nil,nil, {1, 100}}, 800},
--			{ {"金钱袋", {2,95,662,1}, nil,nil, {1, 100}}, 200},
--			{ {"陨铁碎片", {2,2,7,1}, nil,nil, {1, 100}}, 400},
--			{ {"陨铁", {2,2,8,1}, nil,nil, {1, 100}}, 400},
--			{ {"陨铁精石", {2,1,1009,1}, nil,nil, {1, 100}}, 100},
--			{ {"神器", {2,95,55,1}, nil,nil, {1, 100}}, 200},
--			{ {"大人参果", {2,0,553,1}, nil,nil, {1, 100}}, 500},
--			{ {"九转回魂丹", {1,0,32,1}, nil,nil, {1, 100}}, 200},
--			{ {"师门圣物", {2,95,205,1}, nil,nil, {1, 100}}, 500},
--			{ {"梁山特产", {2,95,207,1}, nil,nil, {1, 100}}, 1000},
--			{ {"般若树种", {2,0,398,1,1}, nil,nil, {1, 100}}, 200},
--			{ {"星辰碎片", {2,201,1,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（力根）", {1, 0, 277,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（力身）", {1, 0, 278,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（力洞）", {1, 0, 279,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（力内）", {1, 0, 280,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（内根）", {1, 0, 281,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（内身）", {1, 0, 282,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（内洞）", {1, 0, 283,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（身根）", {1, 0, 284,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（身洞）", {1, 0, 285,1}, nil,nil, {1, 100}}, 100},
--			{ {"九转逍遥丹（洞根）", {1, 0, 286,1}, nil,nil, {1, 100}}, 100},
--			{ {"高级师门秘籍包裹", {2,97,128,1}, nil,nil,{1, 100} }, 200},
        	},
	},
}

_t_fix_award_stage =
{
}

function _gold_box_stat_when_ib_consume(nConsume)
	--SetTask(TASKID_DXG_SCORE, GetTask(TASKID_DXG_SCORE) + nConsume, TASK_ACCESS_CODE_DXG_MISSION);
	gf_ModifyTask(VET_MS_TASKID_JUYILING, nConsume);
	local nNeedTianjiao = GetTask(VET_MS_TASKID_JUYILING)
	if nNeedTianjiao >= T_NEED_TIANJIAOLING then
		local nR = random(1,100);
		local nNum = 0
		if nR <= 45 then
			nNum = 1;
		elseif nR > 46 and nR <= 80 then
			nNum = 2;
		else
			nNum = 3;
		end;
		gf_AddItemEx({TTGLInfo[1],TTGLInfo[2],TTGLInfo[3],1}, TTGLInfo[4], nNum)
		SaveNow(); -- 立即存盘
		local szNotice = format("恭喜%s在%s获得[%s]×%d", GetName(), "梁山群雄会", TTGLInfo[4], nNum)
		Msg2SubWorld(szNotice);
		SetTask(VET_MS_TASKID_JUYILING, 0, 0)
	end
	_stat_when_ib_consume(nConsume)
	--AddRunTimeStat(3,10,0,nConsume)
end

_t_ib_award_no_stage4 =
{
	t_cost = --消耗
	{
		--{"紫霞秘籍",{0,107,65,1, 4}},
		{"天骄令",{2,97,236,2}, _gold_box_stat_when_ib_consume},		
	},
	t_ib_award =--ib奖励
	{
			{ {"经验造化丹", {2, 95, 2017,1}, nil,nil, {1, 100}}, 500},		
			{ {"4级蕴灵宝箱", {2, 95, 18329,1}, nil,nil, {1, 100}}, 500},		
	    	{ {"极品师门真卷残页", {2, 95, 18344,1}, nil,nil, {1, 100}}, 500},		
			{ {"凌波微步", {0, 112, 78,1}, nil,nil, {1, 100}}, 500},	
		    { {"天罡令",{2,95,204, 1}, nil, nil,{1, 100}, {2689, 0}}, 500}, -- VET_MS_TASKID_JUYILING = 2689;	
			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 1000},				
			{ {"大人参果", {2,0,553,1}, nil,nil, {1, 100}}, 1000},		
     		{ {"迎宾宴", {1,1,32,1}, nil,nil, {1, 100}}, 1000},
	    	{ {"金猪全席", {1,1,39,1}, nil,nil, {1, 100}}, 1000},
		    { {"蒙顶石花茶", {1,1,40,1}, nil,nil, {1, 100}}, 1000},
			{ {"军功章", {2,1,9999,1}, nil,nil, {1, 100}}, 1000},	
            { {"大军功章", {2,1,9998,1}, nil,nil, {1, 100}}, 1000},
            { {"辉煌军功章", {2,1,9977,1}, nil,nil, {1, 100}}, 250},		
            { {"四灵无双谱全本", {0,107,165,1}, nil,nil, {1, 100}}, 250},				
			
					
					
		
	
--		{{"3级灵石原石", {2,95,555,1}, nil,nil,{1, 100} }, 100},
--		{{"4级灵石原石", {2,95,556,1}, nil,nil,{1, 100} }, 200},
--		{{"5级灵石原石", {2,95,557,1}, nil,nil,{1, 100} }, 1000},
--		{{"6级灵石原石", {2,95,558,1}, nil,nil, {1, 100}}, 1000},
--		{{"7级灵石原石", {2,95,559,1}, nil,nil, {1, 100}}, 10},
--		{{"五行秘籍", {0,107,155,1}, nil,nil, {1, 100}}, 100},
--		{{"师门真卷残页", {2,96,176,1}, nil,nil, {1, 100}}, 100},
--		{{"陨铁", {2,2,8,5}, nil,nil, {1, 100}}, 100},
--		{{"陨铁精石", {2,1,1009,2}, nil,nil, {1, 100}}, 100},
--		{{"强化精石（11级）", {2,101,12,1}, nil,nil, {1, 100}}, 20},
--		{{"强化精石（12级）", {2,101,13,1}, nil,nil, {1, 100}}, 10},
--		{{"军功章", {2,1,9999,1}, nil,nil,{1, 100} }, 210},
 --       {{"大军功章", {2,1,9998,1}, nil,nil, {1, 100}}, 100},
--		{{"金钱袋", {2,95,662,5}, nil,nil, {1, 100}}, 4500},
--		{{"消劫散", {2,0,141,1,1}, nil,nil, {1, 100}}, 100},
--		{{"八宝粽子", {2,1,1125,1}, nil,nil, {1, 100}}, 100},
--		{{"师门圣物", {2,95,205,1}, nil,nil, {1, 100}}, 200},
--		{{"金猪全席", {1,1,39,1}, nil,nil, {1, 100}}, 100},
--		{{"蒙顶石花茶", {1,1,40,1}, nil,nil, {1, 100}}, 100},
--		{{"迎宾宴", {1,1,32,1}, nil,nil, {1, 100}}, 200},
--		{{"玲珑真元丹", {1,0,67,1}, nil,nil, {1, 100}}, 200},
--		{{"九转逍遥丹（力根）", {1, 0, 277,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（力身）", {1, 0, 278,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（力洞）", {1, 0, 279,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（力内）", {1, 0, 280,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（内根）", {1, 0, 281,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（内身）", {1, 0, 282,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（内洞）", {1, 0, 283,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（身根）", {1, 0, 284,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（身洞）", {1, 0, 285,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（洞根）", {1, 0, 286,1}, nil,nil, {1, 100}}, 100},
--		{{"小军绩牌", {2,1,9975,1}, nil,nil, {1, 100}}, 200},
--		{{"神器", {2,95,55,1}, nil,nil, {1, 100}}, 100},
--		{{"星辰碎片", {2,201,1,1}, nil,nil, {1, 100}}, 200},
--		{{"披风碎片", {2,95,5516,5}, nil,nil, {1, 100}}, 20},
--		{{"徽章碎片", {2,95,5517,5}, nil,nil, {1, 100}}, 20},
--		{{"天罡令",{2,95,204, 1}, nil, 1,{1, 100}, {2689, 0}}, 10}, -- VET_MS_TASKID_JUYILING = 2689;
	},
}

_t_ib_award_no_stage8 =
{
	t_cost = --消耗
	{
		--{"紫霞秘籍",{0,107,65,1, 4}},
		{"天骄令",{2,97,236,2}, _gold_box_stat_when_ib_consume},	
		
	},
	t_ib_award =--ib奖励
	{
			{ {"经验造化丹", {2, 95, 2017,1}, nil,nil, {1, 100}}, 500},		
			{ {"4级蕴灵宝箱", {2, 95, 18329,1}, nil,nil, {1, 100}}, 500},		
	    	{ {"极品师门真卷残页", {2, 95, 18344,1}, nil,nil, {1, 100}}, 500},		
			{ {"凌波微步", {0, 112, 78,1}, nil,nil, {1, 100}}, 500},	
		    { {"天罡令",{2,95,204, 1}, nil, nil,{1, 100}, {2689, 0}}, 500}, -- VET_MS_TASKID_JUYILING = 2689;	
			{ {"修真要诀", {2,0,554,1}, nil,nil, {1, 100}}, 1000},				
			{ {"大人参果", {2,0,553,1}, nil,nil, {1, 100}}, 1000},		
     		{ {"迎宾宴", {1,1,32,1}, nil,nil, {1, 100}}, 1000},
	    	{ {"金猪全席", {1,1,39,1}, nil,nil, {1, 100}}, 1000},
		    { {"蒙顶石花茶", {1,1,40,1}, nil,nil, {1, 100}}, 1000},
			{ {"军功章", {2,1,9999,1}, nil,nil, {1, 100}}, 1000},	
            { {"大军功章", {2,1,9998,1}, nil,nil, {1, 100}}, 1000},
            { {"辉煌军功章", {2,1,9977,1}, nil,nil, {1, 100}}, 250},		
            { {"四灵无双谱全本", {0,107,165,1}, nil,nil, {1, 100}}, 250},		
--		{{"3级灵石原石", {2,95,555,1}, nil,nil,{1, 100} }, 100},
--		{{"4级灵石原石", {2,95,556,1}, nil,nil,{1, 100} }, 200},
--		{{"5级灵石原石", {2,95,557,1}, nil,nil,{1, 100} }, 1000},
--		{{"6级灵石原石", {2,95,558,1}, nil,nil, {1, 100}}, 1000},
--		{{"7级灵石原石", {2,95,559,1}, nil,nil, {1, 100}}, 10},
--		{{"五行秘籍", {0,107,155,1}, nil,nil, {1, 100}}, 100},
--		{{"师门真卷残页", {2,96,176,1}, nil,nil, {1, 100}}, 100},
--		{{"陨铁", {2,2,8,5}, nil,nil, {1, 100}}, 100},
--		{{"陨铁精石", {2,1,1009,2}, nil,nil, {1, 100}}, 100},
--		{{"强化精石（11级）", {2,101,12,1}, nil,nil, {1, 100}}, 20},
--		{{"强化精石（12级）", {2,101,13,1}, nil,nil, {1, 100}}, 10},
--		{{"军功章", {2,1,9999,1}, nil,nil,{1, 100} }, 210},
 --       {{"大军功章", {2,1,9998,1}, nil,nil, {1, 100}}, 100},
--		{{"金钱袋", {2,95,662,5}, nil,nil, {1, 100}}, 4500},
--		{{"消劫散", {2,0,141,1,1}, nil,nil, {1, 100}}, 100},
--		{{"八宝粽子", {2,1,1125,1}, nil,nil, {1, 100}}, 100},
--		{{"师门圣物", {2,95,205,1}, nil,nil, {1, 100}}, 200},
--		{{"金猪全席", {1,1,39,1}, nil,nil, {1, 100}}, 100},
--		{{"蒙顶石花茶", {1,1,40,1}, nil,nil, {1, 100}}, 100},
--		{{"迎宾宴", {1,1,32,1}, nil,nil, {1, 100}}, 200},
--		{{"玲珑真元丹", {1,0,67,1}, nil,nil, {1, 100}}, 200},
--		{{"九转逍遥丹（力根）", {1, 0, 277,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（力身）", {1, 0, 278,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（力洞）", {1, 0, 279,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（力内）", {1, 0, 280,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（内根）", {1, 0, 281,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（内身）", {1, 0, 282,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（内洞）", {1, 0, 283,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（身根）", {1, 0, 284,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（身洞）", {1, 0, 285,1}, nil,nil, {1, 100}}, 100},
--		{{"九转逍遥丹（洞根）", {1, 0, 286,1}, nil,nil, {1, 100}}, 100},
--		{{"小军绩牌", {2,1,9975,1}, nil,nil, {1, 100}}, 200},
--		{{"神器", {2,95,55,1}, nil,nil, {1, 100}}, 100},
--		{{"星辰碎片", {2,201,1,1}, nil,nil, {1, 100}}, 200},
--		{{"披风碎片", {2,95,5516,5}, nil,nil, {1, 100}}, 20},
--		{{"徽章碎片", {2,95,5517,5}, nil,nil, {1, 100}}, 20},
--		{{"天罡令",{2,95,204, 1}, nil, 1,{1, 100}, {2689, 0}}, 10}, -- VET_MS_TASKID_JUYILING = 2689;
	},
}

t_card_award = 
{
	--------------------------------------------
	t_free_award = 
	{
		sz_award_title = "几次没有得到装备时必出装备",
		--几次没有得到装备时必出装备
		t_equip_round = {},
		n_max_daibi_perday = 0,--一天最多获得多少代币
		t_stage =
		{
			[4] = inherit(_t_free_award_no_stage, _t_free_award_stage[4]),
			[8] = inherit(_t_free_award_no_stage, _t_free_award_stage[8]),
		},
	},
	
	t_fix_award = 
	{
		sz_award_title = "梁山群雄会固定奖励",
		t_stage = _t_fix_award_stage,
	},
	--------------------------------------------
	t_ib_award = 
	{
		sz_award_title = "梁山群雄会收费关卡奖励",
		t_stage = 
		{
			[4] = _t_ib_award_no_stage4,
			[8] = _t_ib_award_no_stage8,
		},
	},
}

_t_free_award_no_stage = nil
_t_free_award_stage = nil
_t_fix_award_stage = nil
_t_ib_award_no_stage1 = nil
_t_ib_award_no_stage2 = nil
