Include("\\script\\lib\\globalfunctions.lua")
Include("\\script\\missions\\liangshan\\head.lua")
Include("\\script\\online_activites\\head\\activity_normal_head.lua")

T_TongBoxScript = {
	"\\script\\missions\\liangshan\\npc\\box_tong1.lua",
	"\\script\\missions\\liangshan\\npc\\box_tong2.lua",
	"\\script\\missions\\liangshan\\npc\\box_tong3.lua",
	nil,
	"\\script\\missions\\liangshan\\npc\\box_tong5.lua",
	"\\script\\missions\\liangshan\\npc\\box_tong6.lua",
	"\\script\\missions\\liangshan\\npc\\box_tong7.lua",
}

T_TONG_BOX_IDX = {}
function remove_tong_box()
	for i,v in T_TONG_BOX_IDX do
		if GetNpcName(i) == "青铜宝箱" then
			SetNpcLifeTime(i, 0);
		end
	end
	T_TONG_BOX_IDX = {}
end

function create_box_tong(m,x,y, nBoxId)
	if not T_TongBoxScript[nBoxId] then
		return
	end
	--local m, x, y = GetNpcWorldPos(nNpcIdx);
	--天阴密箱1个
	local x2, y2 = x + random(-5, 5), y + random(-5, 5);
	local npc = CreateNpc("箱子钱", "青铜宝箱", m, x2, y2);
	if npc and npc > 0 then
		T_TONG_BOX_IDX[npc] = 1
		--SetNpcLifeTime(npc, 180);
		SetNpcScript(npc, T_TongBoxScript[nBoxId]);
	else
		print("create ls 青铜宝箱 fail")
	end
end

tClause1 = {
	{{"1级灵石原石", {2,95,553,1}}, 500},
        {{"2级灵石原石", {2,95,554,1}}, 500},
	{{"3级灵石原石", {2,95,555,1}}, 1500},
	{{"4级灵石原石", {2,95,556,1}}, 1000},
	{{"5级灵石原石", {2,95,557,1}}, 500},
	{{"6级灵石原石", {2,95,558,1}}, 500},
	{{"师门真卷残页", {2,96,176,1}}, 300},
	{{"修真要诀", {2,0,554,1}}, 500},
	{{"小人参果", {2,0,552,1}}, 500},
	{{"金钱袋", {2,95,662,1}}, 200},
	{{"陨铁碎片", {2,2,7,1}}, 400},
	{{"陨铁", {2,2,8,1}}, 400},
	{{"陨铁精石", {2,1,1009,1}}, 200},
	{{"神器", {2,95,55,1}}, 500},
	{{"大人参果", {2,0,553,1}}, 500},
	{{"九转回魂丹", {1,0,32,1}}, 500},
	{{"师门圣物", {2,95,205,1}}, 500},
        {{"梁山特产", {2,95,207,1}}, 500},
	{{"披风碎片"  ,{2,95,5516,1}},200},
	{{"徽章碎片"  ,{2,95,5517,1}},200},
	{{"小军绩牌"  ,{2,1,9975,1}},100},
}
tClause2 = {
	{{"1级灵石原石", {2,95,553,1}}, 500},
        {{"2级灵石原石", {2,95,554,1}}, 500},
	{{"3级灵石原石", {2,95,555,1}}, 1500},
	{{"4级灵石原石", {2,95,556,1}}, 1000},
	{{"5级灵石原石", {2,95,557,1}}, 500},
	{{"6级灵石原石", {2,95,558,1}}, 500},
	{{"师门真卷残页", {2,96,176,1}}, 300},
	{{"修真要诀", {2,0,554,1}}, 500},
	{{"小人参果", {2,0,552,1}}, 500},
	{{"金钱袋", {2,95,662,1}}, 200},
	{{"陨铁碎片", {2,2,7,1}}, 400},
	{{"陨铁", {2,2,8,1}}, 400},
	{{"陨铁精石", {2,1,1009,1}}, 200},
	{{"神器", {2,95,55,1}}, 500},
	{{"大人参果", {2,0,553,1}}, 500},
	{{"九转回魂丹", {1,0,32,1}}, 500},
	{{"师门圣物", {2,95,205,1}}, 500},
        {{"梁山特产", {2,95,207,1}}, 500},
	{{"披风碎片"  ,{2,95,5516,1}},200},
	{{"徽章碎片"  ,{2,95,5517,1}},200},
	{{"小军绩牌"  ,{2,1,9975,1}},100},
}
tClause3 = {
	{{"1级灵石原石", {2,95,553,1}}, 500},
        {{"2级灵石原石", {2,95,554,1}}, 500},
	{{"3级灵石原石", {2,95,555,1}}, 1500},
	{{"4级灵石原石", {2,95,556,1}}, 1000},
	{{"5级灵石原石", {2,95,557,1}}, 500},
	{{"6级灵石原石", {2,95,558,1}}, 500},
	{{"师门真卷残页", {2,96,176,1}}, 300},
	{{"修真要诀", {2,0,554,1}}, 500},
	{{"小人参果", {2,0,552,1}}, 500},
	{{"金钱袋", {2,95,662,1}}, 200},
	{{"陨铁碎片", {2,2,7,1}}, 400},
	{{"陨铁", {2,2,8,1}}, 400},
	{{"陨铁精石", {2,1,1009,1}}, 200},
	{{"神器", {2,95,55,1}}, 500},
	{{"大人参果", {2,0,553,1}}, 500},
	{{"九转回魂丹", {1,0,32,1}}, 500},
	{{"师门圣物", {2,95,205,1}}, 500},
        {{"梁山特产", {2,95,207,1}}, 500},
	{{"披风碎片"  ,{2,95,5516,1}},200},
	{{"徽章碎片"  ,{2,95,5517,1}},200},
	{{"小军绩牌"  ,{2,1,9975,1}},100},
} 
tClause5 = {
	{{"1级灵石原石", {2,95,553,1}}, 500},
        {{"2级灵石原石", {2,95,554,1}}, 500},
	{{"3级灵石原石", {2,95,555,1}}, 1500},
	{{"4级灵石原石", {2,95,556,1}}, 1000},
	{{"5级灵石原石", {2,95,557,1}}, 500},
	{{"6级灵石原石", {2,95,558,1}}, 500},
	{{"师门真卷残页", {2,96,176,1}}, 300},
	{{"修真要诀", {2,0,554,1}}, 500},
	{{"小人参果", {2,0,552,1}}, 500},
	{{"金钱袋", {2,95,662,1}}, 200},
	{{"陨铁碎片", {2,2,7,1}}, 400},
	{{"陨铁", {2,2,8,1}}, 400},
	{{"陨铁精石", {2,1,1009,1}}, 200},
	{{"神器", {2,95,55,1}}, 500},
	{{"大人参果", {2,0,553,1}}, 500},
	{{"九转回魂丹", {1,0,32,1}}, 500},
	{{"师门圣物", {2,95,205,1}}, 500},
        {{"梁山特产", {2,95,207,1}}, 500},
	{{"披风碎片"  ,{2,95,5516,1}},200},
	{{"徽章碎片"  ,{2,95,5517,1}},200},
	{{"小军绩牌"  ,{2,1,9975,1}},100},
} 
tClause6 = {
	{{"1级灵石原石", {2,95,553,1}}, 500},
        {{"2级灵石原石", {2,95,554,1}}, 500},
	{{"3级灵石原石", {2,95,555,1}}, 1500},
	{{"4级灵石原石", {2,95,556,1}}, 1000},
	{{"5级灵石原石", {2,95,557,1}}, 500},
	{{"6级灵石原石", {2,95,558,1}}, 500},
	{{"师门真卷残页", {2,96,176,1}}, 300},
	{{"修真要诀", {2,0,554,1}}, 500},
	{{"小人参果", {2,0,552,1}}, 500},
	{{"金钱袋", {2,95,662,1}}, 200},
	{{"陨铁碎片", {2,2,7,1}}, 400},
	{{"陨铁", {2,2,8,1}}, 400},
	{{"陨铁精石", {2,1,1009,1}}, 200},
	{{"神器", {2,95,55,1}}, 500},
	{{"大人参果", {2,0,553,1}}, 500},
	{{"九转回魂丹", {1,0,32,1}}, 500},
	{{"师门圣物", {2,95,205,1}}, 500},
        {{"梁山特产", {2,95,207,1}}, 500},
	{{"披风碎片"  ,{2,95,5516,1}},200},
	{{"徽章碎片"  ,{2,95,5517,1}},200},
	{{"小军绩牌"  ,{2,1,9975,1}},100},
} 
tClause7 = {
	{{"1级灵石原石", {2,95,553,1}}, 500},
        {{"2级灵石原石", {2,95,554,1}}, 500},
	{{"3级灵石原石", {2,95,555,1}}, 1500},
	{{"4级灵石原石", {2,95,556,1}}, 1000},
	{{"5级灵石原石", {2,95,557,1}}, 500},
	{{"6级灵石原石", {2,95,558,1}}, 500},
	{{"师门真卷残页", {2,96,176,1}}, 300},
	{{"修真要诀", {2,0,554,1}}, 500},
	{{"小人参果", {2,0,552,1}}, 500},
	{{"金钱袋", {2,95,662,1}}, 200},
	{{"陨铁碎片", {2,2,7,1}}, 400},
	{{"陨铁", {2,2,8,1}}, 400},
	{{"陨铁精石", {2,1,1009,1}}, 200},
	{{"神器", {2,95,55,1}}, 500},
	{{"大人参果", {2,0,553,1}}, 500},
	{{"九转回魂丹", {1,0,32,1}}, 500},
	{{"师门圣物", {2,95,205,1}}, 500},
        {{"梁山特产", {2,95,207,1}}, 500},
	{{"披风碎片"  ,{2,95,5516,1}},200},
	{{"徽章碎片"  ,{2,95,5517,1}},200},
	{{"小军绩牌"  ,{2,1,9975,1}},100},
}

tClause = {
	tClause1,
	tClause2,
	tClause3,
	nil,
	tClause5,
	tClause6,
	tClause7,
}

function on_open(nStage)
	local tItem = gf_RandRate(tClause[nStage], nil, 2)[1];
	gf_ThrowDice(tItem[2], nil, nil, nil, nil, GetTargetNpc());
	SetNpcLifeTime(GetTargetNpc(), 0);
	SetNpcScript(GetTargetNpc(), "");
	gf_TeamOperateEX(vaf_award_api, "tLiangShanTongBox")
end

