--脚本名称：IB服务器藏剑装备包换脚本
--脚本功能：使用藏剑装备包兑换对应的藏剑装备
--功能策划人：刘希
--代码编写人：赵贵春
--代码编写时间：2007-01-10
--代码修改记录：
Include("\\script\\online\\zgc_public_fun.lua")		--村长的公共函数
--=============================公共变量定义区=============================
	cangjian_bag_name = {"藏剑头冠宝箱","藏剑衣甲宝箱","藏剑靴裤宝箱","藏剑饰品宝箱","藏剑武器宝箱"}
	att_wt = {35,80,50,185,5}
	use_level_min = 70		--是否提醒使用的最低等级
function OnUse(idx)
	local id = tonumber(idx)
	--物品信息的获取和整理
	local bag_diff = GetItemParticular(id) - 1058
	--流派判断
	local player_Route = GetPlayerRoute()
	if player_route_chk(player_Route) == 0 then
		Talk(1,"","你未加入门派，无法获得藏剑装备!")
		return
	elseif GetLevel() < use_level_min then
		Say("您的等级不能使用"..cangjian_bag_name[bag_diff]..",还是想获得"..cangjian_bag_name[bag_diff].."?",
			2,
			"我要使用!/#use_cangjian_bag_det("..bag_diff..")",
			"暂时不用/end_dialog"
			)
	else
		Say("你同意使用"..cangjian_bag_name[bag_diff].."来获得门派的装备?",
			2,
			"我要使用!/#use_cangjian_bag_det("..bag_diff..")",
			"暂时不用/end_dialog"
			)
	end
end
function use_cangjian_bag_det(bag_diff)
	--玩家负重和空间检测
	if Zgc_pub_goods_add_chk(1,att_wt[bag_diff]) ~= 1 then
		return
	end
	--准备信息定义
	local canjiantao={
		{},
		{--藏剑帽子名字-----------------藏剑衣服名字------------藏剑裤/鞋名字-----------藏剑玉佩名字---------藏剑武器-副类：帽子、衣服、裤/鞋、玉配-小类-武器副类-小类
		{"金刚之逍遥冠","金刚之逍遥裳","金刚之逍遥装","金刚之逍遥佩","金刚之逍遥刀",103,100,101,102,3,271},
		{"金刚之逍遥冠","金刚之逍遥裳","金刚之逍遥装","金刚之逍遥佩","金刚之逍遥刀",103,100,101,102,3,272}
		},
		{
		{"如来之逍遥冠","如来之逍遥裳","如来之逍遥装","如来之逍遥佩","如来之逍遥杖",103,100,101,102,8,371},
		{"如来之逍遥冠","如来之逍遥裳","如来之逍遥装","如来之逍遥佩","如来之逍遥杖",103,100,101,102,8,372}
		},
		{
		{"罗汉之逍遥冠","罗汉之逍遥裳","罗汉之逍遥装","罗汉之逍遥佩","罗汉之逍遥手",103,100,101,102,0,471},
		{"罗汉之逍遥冠","罗汉之逍遥裳","罗汉之逍遥装","罗汉之逍遥佩","罗汉之逍遥手",103,100,101,102,0,472}
		},
		{},
		{
		{"侠客之逍遥冠","侠客之逍遥裳","侠客之逍遥装","侠客之逍遥佩","侠客之逍遥针",103,100,101,102,1,671},
		{"侠客之逍遥冠","侠客之逍遥裳","侠客之逍遥装","侠客之逍遥佩","侠客之逍遥针",103,100,101,102,1,672},
		{"侠客之逍遥冠","侠客之逍遥裳","侠客之逍遥装","侠客之逍遥佩","侠客之逍遥针",103,100,101,102,1,673},
		{"侠客之逍遥冠","侠客之逍遥裳","侠客之逍遥装","侠客之逍遥佩","侠客之逍遥针",103,100,101,102,1,674}
		},
		{},
		{
		{},
		{},
		{"观音之逍遥冠","观音之逍遥裳","观音之逍遥装","观音之逍遥佩","观音之逍遥剑",103,100,101,102,2,873},
		{"观音之逍遥冠","观音之逍遥裳","观音之逍遥装","观音之逍遥佩","观音之逍遥剑",103,100,101,102,2,874},
		},
		{
		{},
		{},
		{"玉女之逍遥冠","玉女之逍遥裳","玉女之逍遥装","玉女之逍遥佩","玉女之逍遥琴",103,100,101,102,10,973},
		{"玉女之逍遥冠","玉女之逍遥裳","玉女之逍遥装","玉女之逍遥佩","玉女之逍遥琴",103,100,101,102,10,974}
		},
		{},
		{
		{"降龙之逍遥冠","降龙之逍遥裳","降龙之逍遥装","降龙之逍遥佩","降龙之逍遥手",103,100,101,102,0,1171},
		{"降龙之逍遥冠","降龙之逍遥裳","降龙之逍遥装","降龙之逍遥佩","降龙之逍遥手",103,100,101,102,0,1172},
		{"降龙之逍遥冠","降龙之逍遥裳","降龙之逍遥装","降龙之逍遥佩","降龙之逍遥手",103,100,101,102,0,1173},
		{"降龙之逍遥冠","降龙之逍遥裳","降龙之逍遥装","降龙之逍遥佩","降龙之逍遥手",103,100,101,102,0,1174}
		},
		{
		{"疯魔之逍遥冠","疯魔之逍遥裳","疯魔之逍遥装","疯魔之逍遥佩","疯魔之逍遥棍",103,100,101,102,5,1271},
		{"疯魔之逍遥冠","疯魔之逍遥裳","疯魔之逍遥装","疯魔之逍遥佩","疯魔之逍遥棍",103,100,101,102,5,1272},
		{"疯魔之逍遥冠","疯魔之逍遥裳","疯魔之逍遥装","疯魔之逍遥佩","疯魔之逍遥棍",103,100,101,102,5,1273},
		{"疯魔之逍遥冠","疯魔之逍遥裳","疯魔之逍遥装","疯魔之逍遥佩","疯魔之逍遥棍",103,100,101,102,5,1274}
		},
		{},
		{
		{"真武之逍遥冠","真武之逍遥裳","真武之逍遥装","真武之逍遥佩","真武之逍遥剑",103,100,101,102,2,1471},
		{"真武之逍遥冠","真武之逍遥裳","真武之逍遥装","真武之逍遥佩","真武之逍遥剑",103,100,101,102,2,1472},
		{"真武之逍遥冠","真武之逍遥裳","真武之逍遥装","真武之逍遥佩","真武之逍遥剑",103,100,101,102,2,1473},
		{"真武之逍遥冠","真武之逍遥裳","真武之逍遥装","真武之逍遥佩","真武之逍遥剑",103,100,101,102,2,1474}
		},
		{
		{"一阳之逍遥冠","一阳之逍遥裳","一阳之逍遥装","一阳之逍遥佩","一阳之逍遥笔",103,100,101,102,9,1571},
		{"一阳之逍遥冠","一阳之逍遥裳","一阳之逍遥装","一阳之逍遥佩","一阳之逍遥笔",103,100,101,102,9,1572},
		{"一阳之逍遥冠","一阳之逍遥裳","一阳之逍遥装","一阳之逍遥佩","一阳之逍遥笔",103,100,101,102,9,1573},
		{"一阳之逍遥冠","一阳之逍遥裳","一阳之逍遥装","一阳之逍遥佩","一阳之逍遥笔",103,100,101,102,9,1574}
		},
		{},
		{
		{"车骑之将军冠","车骑之将军裳","车骑之将军装","车骑之将军佩","车骑之将军枪",103,100,101,102,6,1771},
		{"车骑之将军冠","车骑之将军裳","车骑之将军装","车骑之将军佩","车骑之将军枪",103,100,101,102,6,1772},
		{"车骑之将军冠","车骑之将军裳","车骑之将军装","车骑之将军佩","车骑之将军枪",103,100,101,102,6,1773},
		{"车骑之将军冠","车骑之将军裳","车骑之将军装","车骑之将军佩","车骑之将军枪",103,100,101,102,6,1774}
		},
		{
		{"扬威之安邦冠","扬威之安邦裳","扬威之安邦装","扬威之安邦佩","扬威之安邦弓",103,100,101,102,4,1871},
		{"扬威之安邦冠","扬威之安邦裳","扬威之安邦装","扬威之安邦佩","扬威之安邦弓",103,100,101,102,4,1872},
		{"扬威之安邦冠","扬威之安邦裳","扬威之安邦装","扬威之安邦佩","扬威之安邦弓",103,100,101,102,4,1873},
		{"扬威之安邦冠","扬威之安邦裳","扬威之安邦装","扬威之安邦佩","扬威之安邦弓",103,100,101,102,4,1874}
		},
		{},
		{
		{"幽冥之千钧冠","幽冥之千钧裳","幽冥之千钧装","幽冥之千钧佩","幽冥之千钧刀",103,100,101,102,7,2071},
		{"幽冥之千钧冠","幽冥之千钧裳","幽冥之千钧装","幽冥之千钧佩","幽冥之千钧刀",103,100,101,102,7,2072},
		{"幽冥之千钧冠","幽冥之千钧裳","幽冥之千钧装","幽冥之千钧佩","幽冥之千钧刀",103,100,101,102,7,2073},
		{"幽冥之千钧冠","幽冥之千钧裳","幽冥之千钧装","幽冥之千钧佩","幽冥之千钧刀",103,100,101,102,7,2074}
		},
		{
		{"苗门之蚀心冠","苗门之蚀心裳","苗门之蚀心装","苗门之蚀心佩","苗门之蚀心爪",103,100,101,102,11,2171},
		{"苗门之蚀心冠","苗门之蚀心裳","苗门之蚀心装","苗门之蚀心佩","苗门之蚀心爪",103,100,101,102,11,2172},
		{"苗门之蚀心冠","苗门之蚀心裳","苗门之蚀心装","苗门之蚀心佩","苗门之蚀心爪",103,100,101,102,11,2173},
		{"苗门之蚀心冠","苗门之蚀心裳","苗门之蚀心装","苗门之蚀心佩","苗门之蚀心爪",103,100,101,102,11,2174}
		}
	}
	--玩家信息获取以及整理
	local player_Route = GetPlayerRoute()
	local player_body = GetBody()
	--包存在检测
	if GetItemCount(2,1,(1058+bag_diff)) == 0 then
		Talk(1,"","请确认携带者的身份<color=green>"..cangjian_bag_name[bag_diff].."<color>!")
		return
	end
	--包使用成功检测
	if DelItem(2,1,(1058+bag_diff),1) == 0  then
		Talk(1,"","请确认携带者的身份<color=green>"..cangjian_bag_name[bag_diff].."<color>!")
		return		
	end
	local add_flag = AddItem(0,canjiantao[player_Route][player_body][bag_diff+5],canjiantao[player_Route][player_body][11],1,1,-1,-1,-1,-1,-1,-1)
	if add_flag == 1 then
		Msg2Player("恭喜你使用:"..cangjian_bag_name[bag_diff].."换取: "..canjiantao[player_Route][player_body][bag_diff].."!")
	else
		WriteLog("藏剑装备包兑换: 玩家"..GetName().."使用:"..cangjian_bag_name[bag_diff].."换取装备失败, 标记:"..add_flag)
	end
end
--*******************************玩家流派检测********************************
function player_route_chk(player_Route)
	if player_Route == 0 or player_Route == 1 or player_Route == 5 or player_Route == 7 or player_Route == 10 
	or player_Route == 13 or player_Route == 16 or player_Route == 19 then
		return 0 
	else
		return 1
	end
end
