Include("\\script\\class\\ktabfile.lua");
Include("\\script\\lib\\getrectangle_point.lua") --获得矩形点

tbCuiYan = {}
tbCuiYan.nMapId		= 404

tbCuiYan.tbDialogNpc	= 
{
	--翠烟相关
	{"李师师","柴凰儿",404,1570,2725,"\\script\\西南区\\翠烟\\npc\\柴凰儿.lua"},
	{"扈敏","扈敏",404,1599,2760,"\\script\\西南区\\翠烟\\npc\\扈敏.lua"},
	{"刘青眉","刘青眉",404,1543,2693,"\\script\\task\\faction_back_room\\npc_master.lua"},
	{"周子雯","周子雯",404,1524,2719,"\\script\\西南区\\翠烟\\npc\\周子雯.lua"},
	{"胡曼成","胡曼成",404,1577,2784,"\\script\\西南区\\翠烟\\npc\\胡曼成.lua"},
	{"何谐","何谐",404,1493,2746,"\\script\\西南区\\翠烟\\npc\\何谐.lua"},
	{"巧巧","巧巧",404,1474,2838,"\\script\\西南区\\翠烟\\npc\\巧巧.lua"},
	{"柴风儿","柴风儿",404,1552,2815,"\\script\\西南区\\翠烟\\npc\\柴风儿.lua"},
	{"桃花树","桃花树",404,1462,2835,"\\script\\西南区\\翠烟\\npc\\桃花树.lua"},
	{"蚩火妖妇","蚩火妖妇",404,1346,3144,"\\script\\西南区\\翠烟\\npc\\蚩火妖妇.lua"},
--	{"巧巧","出关传送人",423,1497,2950,"\\script\\task\\practice\\出关传送人.lua"},
--	{"翠烟舞仙首席大弟子","翠烟首席大弟子",404,1558,2740,"\\script\\西南区\\翠烟\\npc\\翠烟首席大弟子.lua"},
	{"月老","月老",404, 1642, 2603,"\\script\\结婚\\npc\\月老.lua"},
	{"少年女1","物品保管人",404,1537,2758,"\\script\\西南区\\翠烟\\npc\\物品保管人.lua"},
	{"门派练功木桩","门派练功木桩",404,1455,2624,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
	{"门派练功木桩","门派练功木桩",404,1446,2634,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
	{"门派练功木桩","门派练功木桩",404,1452,2644,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
	{"门派练功木桩","门派练功木桩",404,1459,2634,"\\script\\西南区\\翠烟\\npc\\门派练功木桩.lua"},
}
