
DebugOutput = nothing
WB_SWITCH = 1

WB_WORLD_BOSS = {
	[1] = {"北绿林盟主BOSS", "北绿林盟主"},
	[2] = {"枪神赢天BOSS", "枪神赢天"},
	[3] = {"枪神赢天BOSS", "枪神赢天"},
	[4] = {"枪神赢天BOSS", "枪神赢天"},
}

--WB_WORLD_BOSS_MAP = {
--	[1] = "泉州府北",
--	[2] = "成都府西",
	--[3] = "汴京府南",
--	[4] = "云梦泽",
--}

WB_WORLD_BOSS_POS = {
	[1] = {
		{108, 1513, 3075},--泉州北
--		{219, 1656, 3307},
	},
	[2] = {
		{108, 1513, 3075},--泉州北
--		{219, 1656, 3307},
	},
	[3] = {
		{108, 1513, 3075},--泉州北
--		{219, 1656, 3307},
	},
	[4] = {
		{108, 1513, 3075},--泉州北
--		{219, 1656, 3307},
	},
}

WB_WORLD_BOSS_INFO = {
	[1] = "世界boss出现了",
	[2] = "世界boss出现了",
	[3] = "世界boss出现了",
	[4] = "世界boss出现了",
}