Include("\\script\\isolate\\functions\\armory\\item\\armory_box.lua")

g_szLogCaption = "纹饰刻板随机";

g_tMagicAttribute.tMagicInfo = {
	[1] = { -- 头 衣服 裤子 首饰
		[1 ] = {10, 10, 10, 10, {"力量增加,根骨增加,提高五行攻击属性", {819, 2}, {819, 2}, {855, 2}, {1174, 2},{1762, 1},{2560, 5}}},
		[2 ] = {10, 10, 10, 10, {"力量增加,洞察增加,提高五行攻击属性", {820, 2}, {820, 2}, {856, 2}, {1175, 2},{1763, 1},{2561, 5}}},
		[3 ] = {20, 20, 20, 20, {"力量增加,身法增加,提高五行攻击属性", {821, 2}, {821, 2}, {857, 2}, {1176, 2},{1764, 1},{2562, 5}}},
		[4 ] = {15, 15, 15, 15, {"内功增加,洞察增加,提高五行攻击属性", {822, 2}, {822, 2}, {858, 2}, {1177, 2},{1765, 1},{2563, 5}}},
		[5 ] = {10, 10, 10, 10, {"内功增加,身法增加,提高五行攻击属性", {823, 2}, {823, 2}, {859, 2}, {1178, 2},{1766, 1},{2564, 5}}},
		[6 ] = {10, 10, 10, 10, {"内功增加,根骨增加,提高五行攻击属性", {824, 2}, {824, 2}, {860, 2}, {1179, 2},{1767, 1},{2565, 5}}},
		[7 ] = {15, 15, 15, 15, {"洞察增加,身法增加,提高五行攻击属性", {825, 2}, {825, 2}, {861, 2}, {1180, 2},{1768, 1},{2566, 5}}},
		[8 ] = {5, 5, 5, 5,     {"洞察增加,根骨增加,提高五行攻击属性", {826, 2}, {826, 2}, {862, 2}, {1181, 2},{1769, 1},{2567, 5}}},
		[9 ] = {5, 5, 5, 5,     {"身法增加,根骨增加,提高五行攻击属性", {827, 2}, {827, 2}, {863, 2}, {1182, 2},{1770, 1},{2568, 5}}},
	},
	[2] = {
		[1 ] = {10, 10, 10, 10, {"伤害增加,天命点数增加",           {790, 2}, {790, 2}, {790, 2}, {1194, 2},{1782, 1},{2579, 5}}},
		[2 ] = {10, 10, 10, 10, {"内攻提高,天命点数增加",           {790, 2}, {790, 2}, {790, 2}, {1195, 2},{1783, 1},{2580, 5}}},
		[3 ] = {10, 10, 10, 10, {"外攻提高,天命点数增加",           {795, 2}, {795, 2}, {795, 2}, {1198, 2},{1786, 1},{2581, 5}}},
	},
	[3] = {
		[1] = {1, 1, 1, 1, {"生命上限提高,内力上限提高,增加五行全抗性", {798, 2}, {799, 2}, {800, 2}, {1199, 2},{1787, 1},{2582, 5}}},
	},
};

function OnUse(idx)
	local nItemIndex	= tonumber(idx);
	local nG, nD, nP	= GetItemInfoByIndex(nItemIndex);
	local tItem		= g_tItem[nP];

	if not tItem then
		return 0;
	end

	if tItem[2] ~= nG or tItem[3] ~= nD or tItem[4] ~= nP then
		return 0;
	end
	
	Confirm(nP,nItemIndex);

	return 1;
end

