Include("\\script\\isolate\\functions\\armory\\item\\armory_box.lua")

g_szLogCaption = "纹饰刻板随机";

g_tMagicAttribute.tMagicInfo = {
		[1] = {
			[1 ] = {10,  10,  10,  10, 		{"力量对外攻影响提高/1%根骨对生命影响提高/2%",			{819, 1},	{819, 2},	{819, 3},	{819, 4},	{819, 5}}},
			[2 ] = {10,  10,  10,  10, 		{"力量对外攻影响提高/1%洞察对闪避影响提高/2%",			{820, 1},	{820, 2},	{820, 3},	{820, 4},	{820, 5}}},
			[3 ] = {20,  20,  20,  20,   	{"力量对外攻影响提高/1%身法对命中影响提高/2%",			{821, 1},	{821, 2},	{821, 3},	{821, 4},	{821, 5}}},
			[4 ] = {15,  15,  15,  15, 		{"内功对内攻影响提高/1%洞察对闪避影响提高/2%",			{822, 1},	{822, 2},	{822, 3},	{822, 4},	{822, 5}}},
			[5 ] = {10,  10,  10,  10, 		{"内功对内攻影响提高/1%身法对命中影响提高/2%",			{823, 1},	{823, 2},	{823, 3},	{823, 4},	{823, 5}}},
			[6 ] = {10,  10,  10,  10, 		{"内功对内攻影响提高/1%根骨对生命影响提高/2%",			{824, 1},	{824, 2},	{824, 3},	{824, 4},	{824, 5}}},
			[7 ] = {15,  15,  15,  15, 		{"洞察对闪避影响提高/1%身法对命中影响提高/2%",	        {825, 1},	{825, 2},	{825, 3},	{825, 4},	{825, 5}}},
			[8 ] = {5,   5,   5,   5,		{"洞察对闪避影响提高/1%根骨对生命影响提高/2%",			{826, 1},	{826, 2},	{826, 3},	{826, 4},	{826, 5}}},
			[9 ] = {5,   5,   5,   5,		{"身法对命中影响提高/1%根骨对生命影响提高/2%",			{827, 1},	{827, 2},	{827, 3},	{827, 4},	{827, 5}}},
			
		},
		[2] = {
			[1] = {50, 50, 50, 50, 	{"增加伤害/1",					                        {789, 1},	{789, 2},	{789, 3},	{789, 4},	{789, 5}}},
			[2] = {50,  50,  50,  50, 		{"内外攻提高/1%",				                        {790, 1},	{790, 2},	{790, 3},	{790, 4},	{790, 5}}},
			[3] = {50,  50,  50,  50, 		{"攻击附带毒伤害/1",			                        {791, 1},	{791, 2},	{791, 3},	{791, 4},	{791, 5}}},
			[4] = {50,  50,  50,  50, 		{"武功施展速度提高/1%",					                {794, 1},	{794, 2},	{794, 3},	{794, 4},	{794, 5}}},
			[5] = {50,  50,  50,  50, 		{"承受伤害减半概率/1%",				                    {796, 1},	{796, 2},	{796, 3},	{796, 4},	{796, 5}}},
		},
		[3] = {
			[1 ] = {1,   1,   1,   1, 		{"生命上限提高/1%内力上限提高/2%五行全抗性",	        {798, 1},   {799, 1},   {799, 2},   {799, 3},   {799, 4}}},
		},
};

function OnUse(idx)
	local nItemIndex	= tonumber(idx);
	local nG, nD, nP	= GetItemInfoByIndex(nItemIndex);
	local tItem		= g_tItem[nP];

	if not tItem then
		return 0;
	end

	if tItem[2] ~= nG or tItem[3] ~= nD or tItem[4] ~= nP then
		return 0;
	end
	
	Confirm(nP,nItemIndex);

	return 1;
end

