--脚本名称：
--脚本功能：
--功能策划：盾盾
--功能开发：朱力
--开发时间：2011-05-27
--代码修改记录

g_tEquipShop = {
	[2] = {2, "师门5套装商店"},
	[3] = {3, "师门4套装商店"},
	[25] = {25, "书籍商店"},
	[138] = {138, "生活技能商店"},
	[2040] = {2040, "紫光阁商店(头)"},
	[2041] = {2041, "紫光阁商店(衣服)"},
	[2042] = {2042, "紫光阁商店(裤子)"},
	[2044] = {2044, "紫光阁商店(首饰武器)"},
	[3001] = {3001, "炎帝装备商店"},
	[3002] = {3002, "蕴灵商店"},
	[3003] = {3003, "轩辕首饰武器商店"},
	[4000] = {4000, "太虚八卦牌兑换首饰"},
	[4001] = {4001, "随身商店"},
	[4002] = {4002, "杂货店"},
	[4003] = {4003, "藏剑商店"},
	[4004] = {4004, "战场积分商店"},
	[4005] = {4005, "战场装备兑换"},
	[4006] = {4006, "战场装备兑换"},
	[4010] = {4010, "节日活动限购商店"},	
	[4011] = {4011, "节日限购"},	
	[4012] = {4012, "日常活动商店"},
	[4013] = {4013, "帮会战场积分商店"},
	[4014] = {4014, "82级灵气装备武器兑换"},	
	[4015] = {4015, "梁山奖励兑换"},		
	[4016] = {4016, "情人节商店"},			
	[4017] = {4017, "年夜饭贡献兑换"},	
	[4018] = {4018, "天地装备兑换"},
	[3100] = {3100, "师门6套装商店"},
	[3101] = {3101, "皓月装商店"},
	[3102] = {3102, "耀阳装商店"},
	[3103] = {3103, "极品装备商店"},
	[3104] = {3104, "烈武商店"},
	[3105] = {3105, "光照烈武商店"},
	[3106] = {3106, "凤鸣商店(八卦装666灵气)"},	
	[3107] = {3107, "东皇商店(八卦装666灵气)"},	
	[3108] = {3108, "极品武器商店"},
	[3109] = {3109, "称号兑换商店"},	
	[3110] = {3110, "龙隐商店"},
	[3111] = {3111, "苍梧商店(八卦装666灵气)"},
	[3112] = {3112, "首饰商店"},};

function show_equip_shop(nIdx)
	if not g_tEquipShop[nIdx] then return end

	SendScript2Client(format("Open([[EquipShop]], %d, [[%s]]);", g_tEquipShop[nIdx][1], g_tEquipShop[nIdx][2]));
end

function open_equip_shop(nShopId, szTitle)
	SendScript2Client(format("Open([[EquipShop]], %d, [[%s]]);", nShopId or 0, szTitle or ""));
end
