Include("\\settings\\static_script\\missions\\base\\phasebase.lua");
Include("\\settings\\static_script\\missions\\base\\mission_head.lua");
Include("\\script\\lib\\define.lua");
Include("\\script\\lib\\time.lua");
Include("\\script\\lib\\message.lua");
Include("\\script\\missions\\taiyi\\box\\boxes.lua")
Include("\\script\\class\\clause3.lua")
thisFile ="\\script\\missions\\taiyi\\mission.lua";

TYT_IB_ITEM = {"天骄令",2, 97, 236};  --代币

DebugOutput = nothing

TOTAL_STAGE = 6;	--关键stage数量[策划玩法中的stage数量]
LEVEL_RANGE = TOTAL_STAGE + 3*3 + 3;	--当nStageId <= LEVEL_RANGE时为梵天林

--Difficulty Type
eDifType = {
	NORMAL = 1,
	HARD = 2,
};

eMSName = {
	FOREST = 1,
	TOWER = 2,
};

tGlbValue = {
	[eMSName.FOREST] = {
		[eDifType.NORMAL] = {GV_TY_FOREST_NORMAL_MAX_MAP, 30, "梵天林"},	--开场计数，开场上限
		[eDifType.HARD] = {GV_TY_FOREST_HARD_MAX_MAP, 30, "梵天林"},
	},
	[eMSName.TOWER] = {
		[eDifType.NORMAL] = {GV_TY_TOWER_NORMAL_MAX_MAP, 30, "太一塔"},
		[eDifType.HARD] = {GV_TY_TOWER_HARD_MAX_MAP, 30, "太一塔"},
	},
};

tOptions = {
	[eMSName.FOREST] = {
		[eDifType.NORMAL] = {
			["MemberNum"] = {1, 8},
			["MemberHaveRoute"] = 1,
			["MemberLevel"] = {50, 999},
			["PKValue"] = {0, 9},
		},
		[eDifType.HARD] = {
			["MemberNum"] = {1, 8},
			["MemberRouteNum"] = {1, 8},
			["MemberLevel"] = {50, 999},
			["MemberHaveRoute"] = 1,
			["RoomWeight"] = {1, 10},
			["PKValue"] = {0, 9},
		},
	},
	[eMSName.TOWER] = {
		[eDifType.NORMAL] = {
			["MemberNum"] = {1, 8},
			["MemberHaveRoute"] = 1,
			["MemberLevel"] = {50, 999},
			["PKValue"] = {0, 9},
		},
		[eDifType.HARD] = {
			["MemberNum"] = {1, 8},
			["MemberRouteNum"] = {1, 8},
			["MemberLevel"] = {50, 999},
			["MemberHaveRoute"] = 1,
			["RoomWeight"] = {1, 10},
			["PKValue"] = {0, 9},
		},
	},
};


--经验倍数
tExpMul = {
	[eDifType.NORMAL] = {
		[1] = 0.6,
		[2] = 0.8,
		[3] = 0.9,
		[4] = 1.0,
		[5] = 1.2,
		[6] = 1.4,
		[7] = 1.6,
		[8] = 2.0,
	},
	[eDifType.HARD] = {
		[4] = 1.0,
		[5] = 1.2,
		[6] = 1.4,
		[7] = 1.6,
		[8] = 2.0,
	},
};

tGodStates	= {
        tInfo	= {"真·天神下凡", 5},
	tState	= {
		[1] = {9920, "state_life_max_percent_add",	1000,	"生命上限提高10倍"},
		[2] = {9921, "state_p_attack_percent_add",		100,	"外功攻击 +100%"},	
		[3] = {9922, "state_m_attack_percent_add",		100,	"内功攻击 +100%"},
		[4] = {9923, "state_immune",				100,	"免疫所有负面效果"},
	},
}

--6关对应的nStageId
tMainLevelID = {
	[TOTAL_STAGE + 1*3 + 2] = 1,
	[TOTAL_STAGE + 2*3 + 2] = 2,
	[TOTAL_STAGE + 3*3 + 2] = 3,
	[TOTAL_STAGE + 4*3 + 2] = 4,
	[TOTAL_STAGE + 5*3 + 2] = 5,
	[TOTAL_STAGE + 6*3 + 2] = 6,
};

tTY = {
	name ="太一塔",
	missionID = 66,
	realMapID = 6075,
	dynamicMap = 1,
	
	----------------------
	mv_01 = 1,	--1:梵天林 2:太一塔
	mv_02 = 2,	--1:普通版 2:英雄版
	mv_03 = 3,	--1:作弊模式 0:非作弊
	mv_04 = 4,	--翻牌前的队长索引
	
	mv_20 = 20,	--当前是哪段对话
	mv_21 = 21,	--当前段对话的第几句
	mv_22 = 22,
	mv_23 = 23,
	mv_24 = 24,
	mv_25 = 25,
	mv_26 = 26,
	mv_27 = 27,
	mv_28 = 28,
	mv_29 = 29,
	mv_30 = 30,
	mv_31 = 31,
	mv_32 = 32,
	mv_33 = 33,
	mv_34 = 34,
	mv_35 = 35,		--记录谁开的箱子
	mv_36 = 36,		--记录奖励loot
	----------------------
	ms20 = 20,
};

tTY = gf_CopyInherit(missionHead, tTY);

tTY_msOption = {
	bSetPkFlag = 0, --练功模式
	bSetPkCamp = 0,
	szInitDeahScript = thisFile,
}

--地图上已经创建出的NPC缓存
tExistNpcList = {
--	[nMapIdx] = {
--		{szName, nNpcIdx},
--	},
};

--时间驱动器
tPhaseDriver = {
	timerID = 96,
	maxsecond = 120*60,
};
tPhaseDriver = gf_CopyInherit(phaseBase, tPhaseDriver);

tNpcs = {
    mgy_1 = {"先锋穆桂英","穆桂英", thisFile, CampPlayer},
	mgy_2 = {"太一伴随穆桂英","穆桂英", thisFile, CampPlayer},
	mgy_3 = {"太一穆桂英","穆桂英", thisFile, CampEnemy},
	mgy_3_1 = {"普通太一穆桂英", "穆桂英", thisFile, CampEnemy},
	
	yzb_1 = {"先锋杨宗保","杨宗保", thisFile, CampPlayer},
	yzb_2 = {"太一伴随杨宗保","杨宗保", thisFile, CampPlayer},
	yzb_3 = {"太一杨宗保","杨宗保", thisFile, CampEnemy},
	yzb_3_1 = {"普通太一杨宗保", "杨宗保", thisFile, CampEnemy},
	xy = {"玉修罗箫奕","玉修罗箫奕", thisFile, CampEnemy},
	xy_1 = {"普通玉修罗箫奕","玉修罗箫奕", thisFile, CampEnemy},
	xlsy = {"修罗碎影","修罗碎影", thisFile, CampEnemy},
	xlsy_1 = {"普通修罗碎影","修罗碎影", thisFile, CampEnemy},
	jltys1 = {"惊雷九龙吞云兽","惊雷九龙吞云兽", thisFile, CampEnemy},
	jltys1_1 = {"普通惊雷九龙吞云兽","惊雷九龙吞云兽", thisFile, CampEnemy},
	jltys2 = {"业火九龙吞云兽","惊雷九龙吞云兽", thisFile, CampEnemy},
	jltys2_1 = {"普通业火九龙吞云兽","惊雷九龙吞云兽", thisFile, CampEnemy},
	bx = {"神兽辟邪","神兽辟邪", thisFile, CampEnemy},
	bx_1 = {"普通神兽辟邪","神兽辟邪", thisFile, CampEnemy},
	hhlj = {"荒火鎏金","荒火鎏金", thisFile, CampEnemy},
	hhlj_1 = {"普通荒火鎏金","荒火鎏金", thisFile, CampEnemy},
	ljfb = {"鎏金风暴","鎏金风暴", thisFile, CampEnemy},
	ljfb_1 = {"鎏金风暴","鎏金风暴", thisFile, CampEnemy},
	ylfh = {"耶律飞鸿","耶律飞鸿", thisFile, CampEnemy},
	ylfh_1 = {"普通耶律飞鸿","耶律飞鸿", thisFile, CampEnemy},
	jjg = {"菁菁姑娘","菁菁姑娘", "\\script\\missions\\taiyi\\jjg_npc.lua", CampPlayer},
	tbjh = {"大宋英魂", "幻武枪者", thisFile, CampEnemy},
	tbjh_1 = {"普通大宋英魂", "幻武枪者", thisFile, CampEnemy},
	dsyh = {"大宋英魂", "大宋英魂", thisFile, CampEnemy},
	dsyh_1 = {"普通大宋英魂", "大宋英魂", thisFile, CampEnemy},
	yy = {"杨业", "杨业", thisFile, CampPlayer}, 
};

tNpcPos = {
	--穆桂英
	mgy = {
		[0] = {{1321, 2836},},	--梵天林准备区
		[1] = {{1453, 2908}, {1463, 2856}},	--第一关 开始位置，结束位置
		[2] = {{1611, 2915}, {1636, 2858}},
		[3] = {{1638, 3189}, {1639, 3187}},
		[4] = {{1212, 3491},},	--太一塔准备区
		[5] = {{1224, 3472}, {1249, 3439}},
		[6] = {{1443, 3529}, {1443, 3466}},
		[7] = {{1649, 3495}, {1661, 3478}}, 
	},
	yzb = {
		[0] = {{1325, 2834},},
		[1] = {{1446, 2904}, {1469, 2861}},
		[2] = {{1618, 2919}, {1642, 2857}},
		[3] = {{1632, 3183}, {1634, 3182}},
		[4] = {{1208, 3505},},	--太一塔准备区
		[5] = {{1229, 3478}, {1254, 3445}},
		[6] = {{1454, 3529}, {1456, 3468}},
		[7] = {{1654, 3502}, {1671, 3487}},
	},
	jjg = {
		[0] = {{1416, 3120},},
	},
	--萧奕
	xy = {
		[1] = {{1456, 2880},},
	},
	xlsy = {
		[1] = {{1456, 2880},},
	},
	jltys1 = {
		[2] = {{1627, 2891},},
	},
	mm = {
		[3] = {
			{1591, 3187},{1597, 3192},{1593, 3198},{1597, 3199},
			{1598, 3207},{1602, 3205},{1605, 3202},{1609, 3205},
			{1607, 3206},{1601, 3212},{1601, 3219},{1604, 3219},
			{1607, 3215},{1609, 3213},{1612, 3209},{1616, 3208},
			{1617, 3212},{1614, 3216},{1612, 3218},{1615, 3226},
			{1618, 3231},{1621, 3226},{1622, 3223},{1625, 3221},
			{1628, 3224},{1628, 3229},{1626, 3237},{1632, 3236},
			{1637, 3235},{1639, 3240},{1642, 3238},{1635, 3236},
		},
	},
	bx = {
		[5] = {
			{1241, 3461},
		},
	},
	mashroom = {
		[5] = {
			{1245, 3495},{1237, 3422},{1280, 3465},{1209, 3460}, 
			{1211, 3492},{1259, 3440},{1261, 3487},{1213, 3444},
		},
	},
	hhlj = {
		[6] = {
			{1451, 3495},
		},
	},
	ylfh = {
		[7] = {
			{1663, 3487}, {1658, 3493},
		},
	},
	yy = {
		[7] = {
			{1675, 3468},
		},
	},
	tbjh = {
		[7] = {
			{1628, 3476}, {1605, 3497}, {1614, 3518}, {1627, 3531},
			{1650, 3544}, {1670, 3526}, {1687, 3510},
		},
	},
};

tMovePos = {
	mgy = {
		[1] = {{{1456, 2880}}},
	},
};

tExitPos = {
	[100] = {1440, 2800},
	[200] = {1383, 3069},
	[300] = {1805, 3362},
	[350] = {1407, 2860},
};

--玩家闯关失败位置
tFailedPos = {
	{},
};

--玩家闯关成功刷新位置
tResetPos = {
	[1] = {1456, 2880},
};

tDeathPos = {1420, 3137};

tPlayerPos = {
	[0] = {{1320, 2853}, },
	[1] = {{1452, 2909}, {1460, 2864}},
	[2] = {{1617, 2915}, {1640, 2871}},
	[3] = {{1629, 3191}, {1630, 3192}},
	[4] = {{1212, 3491}, {1248, 3450}},
	[5] = {{1449, 3538}, {1449, 3473}},
	[6] = {{1645, 3506}, {1663, 3487}},
};

tList = {
	[2 ] = "少林俗家",
	[3 ] = "少林禅僧",
	[4 ] = "少林武僧",
	[6 ] = "唐门",
	[8 ] = "峨嵋佛家",
	[9 ] = "峨嵋俗家",
	[11] = "丐帮净衣",
	[12] = "丐帮污衣",
	[14] = "武当道家",
	[15] = "武当俗家",
	[17] = "杨门枪骑",
	[18] = "杨门弓骑",
	[20] = "五毒邪侠",
	[21] = "五毒蛊师",
	[23] = "昆仑天师",
	[25] = "明教圣战",
	[26] = "明教阵兵",
	[27] = "明教血人",
	[29] = "翠烟舞仙",
	[30] = "翠烟灵女",
	[31] = "唐门任侠",
	[32] = "昆仑剑尊",
};

tRouteList = {
	[2] = {0, {260, 260},},
	[3] = {1, {0  , 200},},
	[4] = {1, {1170,	1170},},
	[6] = {0, {210, 210},},
	[8] = {1, {260,	260},},
	[9] = {1, {260, 260},},
	[11] ={0, {195,	195},},
	[12] ={0, {260, 260},},
	[14] ={1, {500  ,	500 },},
	[15] ={0, {230, 230},},
	[17] ={0, {195,	195},},
	[18] ={0, {110, 110},},
	[20] ={1, {390,	390},},
	[21] ={1, {260, 260},},
	[23] ={1, {600  ,	600  },},
	[25] ={0, {130, 130},},
	[26] ={0, {195,	195},},
	[27] ={1, {130, 130},},
	[29] ={0, {600  ,	600  },},
	[30] ={0, {110, 110},},
	[31] ={0, {100, 100},},
	[32] ={0, {100, 100},},
};

--流派个数加成
TYT_EXP_ROUTE_COUNT_ADD = {
	[0] = 0,
	[1] = 0,
	[2] = 0,
	[3] = 0,
	[4] = 0,
	[5] = 0.2,
	[6] = 0.4,
	[7] = 0.6,
	[8] = 1,	
}

--过关经验表
TYT_EXP_AWARD = {
	[eMSName.FOREST] = {
		[eDifType.NORMAL] = {
			[1] = 1000000,
			[2] = 2000000,
			[3] = 3000000,
		},
		[eDifType.HARD] 	= {
			[1] = 5000000,
			[2] = 6000000,
			[3] = 7000000,
		},
	},
	[eMSName.TOWER] = {
		[eDifType.NORMAL] = {
			[1] = 3000000,
			[2] = 4000000,
			[3] = 4000000,
		},
		[eDifType.HARD] 	= {
			[1] = 9000000,
			[2] = 10000000,
			[3] = 15000000,
		},
	},
}

--过关掉箱子
TYT_DROP_BOX_AWARD = {
	[eMSName.FOREST] = {
		[eDifType.NORMAL] = {
			[1] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_1.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_1.lua"},
			},
			[2] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_2.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_1.lua"},
			},
			[3] = {
				{"盛世宝箱", "金宝箱", 1, "\\script\\missions\\taiyi\\box\\yin_box_2.lua"},
			},
		},
		[eDifType.HARD] 	= {
			[1] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_11.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_11.lua"},
			},
			[2] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_22.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_11.lua"},
			},
			[3] = {
				{"盛世宝箱", "金宝箱", 2, "\\script\\missions\\taiyi\\box\\yin_box_22.lua"},
			},
		},
	},
	[eMSName.TOWER] = {
		[eDifType.NORMAL] = {
			[1] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_3.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_1.lua"},
			},
			[2] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_3.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_1.lua"},
			},
			[3] = {
				{"盛世宝箱", "金宝箱", 1, "\\script\\missions\\taiyi\\box\\yin_box_2.lua"},
			},
		},
		[eDifType.HARD] 	= {
			[1] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_11.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_11.lua"},
			},
			[2] = {
				{"盛世宝箱", "铜宝箱", 1, "\\script\\missions\\taiyi\\box\\tong_box_22.lua"},
				{"盛世宝箱", "银宝箱", 4, "\\script\\missions\\taiyi\\box\\yin_box_11.lua"},
			},
			[3] = {
				{"盛世宝箱", "金宝箱", 2, "\\script\\missions\\taiyi\\box\\yin_box_22.lua"},
			},
		},
	},
}
TYT_PRICE = {
	[1] = {	--梵天林
		[1] = {		--免费翻牌
			[1] = {	--NORMAL
				{"灵石宝箱", {2,95,5435,1}, 2000},
				{"师门真卷残页", {2,96,176,1}, 1000},
				{"小人参果", {2,0,552,1}, 2000},
				{"金钱袋", {2,95,662,1}, 4000},
				{"6级灵石原石", {2,95,558,1}, 500},
				{"师门圣物", {2,95,205,1}, 1000},
				{"5级灵石原石",{2,95,557,1},3000},
				{"消劫散",{2,0,141,1},3000},
				{"陨铁碎片",{2,2,7,1},4000},
				{"陨铁", {2,2,8,1,1},4000},
				{"修真要诀", {2,0,554,1},2000},
				{"军功章", {2,1,9999,1},2000},
			},
			[2] = {	--HARD英雄模式奖励未修改
				{"皓月碎片",{2,95,740,2},5000},
				{"耀阳碎片",{2,95,741,10},500},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
				{"皓月碎片",{2,95,740,2},4000},
				{"耀阳碎片",{2,95,741,10},1000},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
			},
		},
		[2] = {		--付费翻牌
			[1] = { --NORMAL
				{"军功章", {2,1,9999,1}, 4000},
				{"大军功章", {2,1,9998,1}, 2000},
				{"辉煌军功章", {2,1,9977,1}, 500},
				{"小军绩牌", {2,1,9975,1}, 1000},
				{"陨铁晶石", {2,1,1009,1}, 3000},
				{"灵石宝箱", {2,95,5435,1}, 5000},
				{"陨铁晶石",{2,1,1009,3},3000},
				{"八宝粽子", {2,1,1125,1},1000},
				{"藏剑金令",{2,1,1139,2},500},
				{"藏宝箱钥匙",{2,95,52,2},500},
				{"天罢令", {2,95,204,1},100},
				{"皓月碎片",{2,95,740,20},5000},
				{"耀阳碎片",{2,95,741,10},500},
			},
			[2] = {	--HARD英雄模式奖励未修改
				{"皓月碎片",{2,95,740,2},4000},
				{"耀阳碎片",{2,95,741,10},1000},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
				{"天罢令", {2,95,204,1},100},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
			},
		},
	},
	[2] = {	--太一塔
		[1] = {		--免费翻牌
			[1] = {	--NORMAL
				{"灵石宝箱", {2,95,5435,1}, 2000},
				{"师门真卷残页", {2,96,176,1}, 1000},
				{"小人参果", {2,0,552,1}, 2000},
				{"金钱袋", {2,95,662,1}, 4000},
				{"6级灵石原石", {2,95,558,1}, 500},
				{"师门圣物", {2,95,205,1}, 1000},
				{"5级灵石原石",{2,95,557,1},3000},
				{"消劫散",{2,0,141,1},3000},
				{"陨铁碎片",{2,2,7,1},4000},
				{"陨铁", {2,2,8,1,1},4000},
				{"修真要诀", {2,0,554,1},2000},
				{"军功章", {2,1,9999,1},2000},
			},
			[2] = {	--HARD英雄模式奖励未修改
				{"皓月碎片",{2,95,740,2},4000},
				{"耀阳碎片",{2,95,741,10},1000},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
				{"天罢令", {2,95,204,1},100},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
			},
		},
		[2] = {		--付费翻牌
			[1] = { --NORMAL
				{"皓月碎片",{2,95,740,2},4000},
				{"耀阳碎片",{2,95,741,10},1000},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
				{"天罢令", {2,95,204,1},100},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
			},
			[2] = {	--HARD英雄模式奖励未修改
				{"皓月碎片",{2,95,740,2},4000},
				{"耀阳碎片",{2,95,741,10},1000},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},
				{"天罢令", {2,95,204,1},100},
				{"洪荒碎片", {2,95,1506,2},4000},
				{"洪荒碎片", {2,95,1506,10},2000},
				{"洪荒碎片", {2,95,1506,100},100},			
		},
         },
	},
};


tTaskID = {
	["ConsumeTaskID"] = {
		[eMSName.FOREST] = TASKID_TAIYI_FOREST_CONSUME,
		[eMSName.TOWER] = TASKID_TAIYI_TOWER_CONSUME,
	},
	["JoinInTime"] = {
		[eMSName.FOREST] = TASKID_TAIYI_FOREST_JOIN_IN_TIME,
		[eMSName.TOWER] = TASKID_TAIYI_TOWER_JOIN_IN_TIME,
	},
};

tFriendNpcPos = {
	[1] = {{1448, 2904}, {1448, 2895}, {1459, 2901}, {1459, 2907}, {1450, 2888}, {1457, 2888}, {1447, 2885}},
	[2] = {{1617, 2904}, {1612, 2898}, {1620, 2910}, {1621, 2912}, {1615, 2906}, {1611, 2920}, {1621, 2908}},
	[3] = {{1640, 3209}, {1637, 3194}, {1632, 3187}, {1627, 3190}, {1621, 3191}, {1627, 3195}, {1631, 3188}},
	[4] = {{1231, 3483}, {1227, 3475}, {1218, 3479}, {1225, 3479}, {1236, 3479}, {1227, 3478}, {1223, 3461}},
	[5] = {{1447, 3537}, {1442, 3534}, {1450, 3531}, {1455, 3534}, {1453, 3522}, {1448, 3525}, {1444, 3521}},
	[6] = {{1645, 3506}, {1641, 3500}, {1648, 3506}, {1643, 3506}, {1638, 3501}, {1645, 3508}, {1652, 3508}},
};

tFriendNpcList = {
	{"少林武僧首座", "少林武僧首座"},
	{"少林禅宗首座", "少林禅宗首座"},
	{"少林俗家首座", "少林俗家首座"},
	{"武当道家首座", "武当道家首座"},
	{"武当俗家首座", "武当俗家首座"},
	{"唐门首座", "唐门首座"},
	{"丐帮净衣首座", "丐帮净衣首座"},
	{"丐帮污衣首座", "丐帮污衣首座"},
	{"峨嵋俗家首座", "峨嵋俗家首座"},
	{"五毒蛊师首座", "五毒蛊师首座"},
	{"明教血人首座", "明教血人首座"},
	{"明教阵兵首座", "明教阵兵首座"},
	{"明教圣战首座", "明教圣战首座"},
	{"昆仑天师首座", "昆仑天师首座"},
	{"翠烟舞仙首座", "翠烟舞仙首座"},
};

--进入关卡次数限制
TYT_JOIN_TIMES_FOREST_NOMARL	= 99999
TYT_JOIN_TIMES_FOREST_HARD		=	99999
TYT_JOIN_TIMES_TOWER_NOMARL		= 99999
TYT_JOIN_TIMES_TOWER_HARD			= 99999	

--进入关卡需要消耗的精力
TYT_JOIN_COST_JINGLI = {
	[eMSName.FOREST] = {
		[eDifType.NORMAL] = 20,--进入普能太一关卡需要消耗的精力
		[eDifType.HARD] 	= 40,--进入困难太1关卡需要消耗的精力
	},
	[eMSName.TOWER] = {
		[eDifType.NORMAL] = 20,--进入普能太一关卡需要消耗的精力
		[eDifType.HARD] 	= 40,--进入困难太1关卡需要消耗的精力
	},
};

--太一塔进入要消耗的道具(收费模式)
TYT_JOIN_COST_ITEM = {
	[eMSName.FOREST] = {
		[eDifType.NORMAL] = {{2, 97, 236, 1},"天骄令"},
		[eDifType.HARD] 	= {{2, 97, 236, 1},"天骄令"},
	},
	[eMSName.TOWER] = {
		[eDifType.NORMAL] = {{2, 97, 236, 1},"天骄令"},
		[eDifType.HARD] 	= {{2, 97, 236, 1},"天骄令"},
	},	
}
