
-- ====================== 文件信息 ======================
-- 剑侠情缘onlineII 任务系统人物文件
-- Edited by peres
-- 2005/05/31 PM 15:17
-- 烟花。那一夜的烟花。
-- 她记得他在大雨的人群中，站在她的背后拥抱住她。
-- 他温暖的皮肤，他熟悉的味道。烟花照亮她的眼睛。
-- 一切无可挽回……
-- ======================================================
function main()
	i=random(1,3)
	if i==1 then 
		Talk(1,"","<color=green>韩义<color>：不知道芊芊现在怎么样呢？思来想去，这些年真是对不住他们母女啊。")
	elseif i == 2 then  
		Talk(1,"","<color=green>韩义<color>：木秀于林，风必摧之。大公子这么锋芒毕露，未知是福是祸啊！")
	else
		Talk(1,"","<color=green>韩义<color>：这次的烟雨楼聚会，定有大批江湖中人前来，可要好好防范才是。")
	end
end
