tTransportPrice =
{
	[6] = {"3", 300},
	[7] = {"9", 900},
	[8] = {"12", 1200},
	[9] = {"15", 1500},
}

TB_FACTION_PRICE =
{
	[6] = 500,
	[7] = 1000,
	[8] = 1500,
	[9] = 2000,
}

tTransportFree =
{
	[200] = {300, 100},
	[300] = {200, 100},
	[100] = {200, 300},
	[350] = {200, 300, 100, 150, 400},
	[150] = {200, 300, 100, 350, 400},
	[500] = {200, 300, 100},
	[400] = {200, 300, 100},

}

tTransportPay =
{
	[200] = {100, 300, 350, 150, 400,425,426,500,604,608},--汴京
	[300] = {200, 100, 350, 150, 400,425,426,500,604,608},--成都
	[100] = {200, 300, 350, 150, 400,425,426,500,604,608},--泉州
	[350] = {200, 100, 300, 150, 400,425,426,500,604,608},--襄阳
	[150] = {200, 100, 300, 350, 400,425,426,500,604,608},--扬州
	[500] = {200, 100, 300, 350, 150,425,426,400,604,608},--凤翔
	[400] = {200, 100, 300, 350, 150,425,426,500,604,608},--大理
	[425] = {200, 100, 300,},--武林盟
	[426] = {200, 100, 300,},--玉融峰
	[604] = {200, 100, 300,},--雁门关
	[608] = {200, 100, 300,},--会宁府	
	
}

TB_TRANSPORT_INFO = {
	[200] = {"汴京",
		{
		{200,1501,2978},
		{200,1267,2970},
		{200,1249,2732},
		{200,1249,2732},
		}
	},
	[300] = {"成都",
		{
		{300,1896,3655},
		{300,1677,3671},
		{300,1681,3464},
		{300,1911,3442},
		}
	},
	[100] = {"泉州",
		{
		{100,1521,2870},
		{100,1386,2905},
		{100,1555,3080},
		{100,1429,3005},
		}
	},
	[350] = {"襄阳",
		{
		{350,1518,3050},
		{350,1362,3053},
		{350,1332,2865},
		{350,1542,2865},
		}
	},
	[150] = {"扬州",
		{
		{150,1724,3075},
		{150,1630,3050},
		{150,1615,3175},
		{150,1757,3179},
		}
	},
	[500] = {"凤翔",
		{
		{500,1846,3043},
		{500,1800,3229},
		{500,1659,3090},
		{500,1664,3226},
		}
	},
	[400] = {"大理",
		{
		{400,1567,3117},
		{400,1434,3109},
		{400,1579,2883},
		{400,1541,2935},
		}
	},
	[425] = {"武林盟",
		{
		{425,1731,3203},
		{425,1734,3209},
		{425,1748,3200},
		{425,1744,3227},
		}
	},
	[426] = {"玉融峰",
		{
		{426,1604,3191},
		{426,1635,3106},
		{426,1528,3100},
		{426,1574,3199},
		}
	},
	[604] = {"雁门关",
		{
		{604,1376,2831},
		}
	},	
	[608] = {"会宁府",
		{
		{608,1705,3289},
		}		
		
		
	},
}

function CheckMoneyPay(nFree, nLevel)
	if nFree == 1 then
		return 1, 0, 0
	else
		local szTransportPrice, nTransportPayPrice = 0, 0
		if nLevel >= 15 and nLevel < 69 then
			nTransportPrice, nTransportPayPrice = tTransportPrice[6][1], tTransportPrice[6][2]
		elseif nLevel >= 70 and nLevel < 80 then
			nTransportPrice, nTransportPayPrice = tTransportPrice[7][1], tTransportPrice[7][2]
		elseif nLevel >= 80 and nLevel < 90 then
			nTransportPrice, nTransportPayPrice = tTransportPrice[8][1], tTransportPrice[8][2]
		elseif nLevel >= 90 then
			nTransportPrice, nTransportPayPrice = tTransportPrice[9][1], tTransportPrice[9][2]
		end
		if nLevel <15 then 
			return 1, 0, 0
		elseif GetCash() >= nTransportPayPrice then
			return 1, nTransportPrice, nTransportPayPrice
		else
			return 0, nTransportPrice, nTransportPayPrice
		end
	end
end