--BOSS诞生的地方
tPos_Boss = 
{
	[1] = {1772,3467}
};

--副本入口NPC坐标
tPos_Entrance = 
{	
	[1] = {150, 1647, 3176}
}

--地图传送NPC坐标
tPos_Chefu = 
{
	[1] = {1730,3290}
}

--进入地图后玩家的初始坐标
tPos_PlayerEnter = 
{
	[1] = {1745,3253}
}

--NPC：胆小的故衣会商人裘蒋 所在位置
tPos_Qiujiang = 
{
	[1] = {1763, 3340}
}

tPos_5Series = 
{
	[1] = {1780, 3331}, --五行金使
	[2] = {1744, 3329}, --五行木使
	[3] = {1769, 3294}, --五行土使				
	[4] = {1745, 3384}, --五行水使
	[5] = {1776, 3387}, --五行火使
}

tPos_PrizeBox = 
{
	[1] = tPos_Boss[1], --一等奖宝箱
	[2] = tPos_Boss[1], --二等奖宝箱
}

--随机小宝箱刷新时出现的位置
tPos_RandomBox = 
{
	{1737,3418},
	{1758,3417},
	{1782,3419},
	{1797,3419},
	{1798,3445},
	{1780,3448},
	{1766,3445},
	{1743,3446},
	{1744,3467},
	{1762,3467},
	{1783,3464},
	{1792,3465},
	{1793,3490},
	{1774,3494},
	{1739,3495},
}

--玩家在活动地图复活的位置
tPos_PlayerRevive = 
{
	[1] = {1761,3403}
}

--NPC：帮会峨嵋小师姐
tPos_ShiJie = 
{
	[1] = {1761, 3405}
}
