
Include("\\script\\lib\\globalfunctions.lua")

tTab =
{
	{2, 114, 4, "烈武精魄", 1, "烈武"},
	{2, 114, 5, "光武精魄", 1, "光昭烈武"},
	{2, 114, 170, "东皇精魄", 1, "东皇凤鸣"},
	{2, 196, 46, "龙隐精魄", 1, "龙隐"},
	{2, 196, 47, "苍梧精魄", 1, "苍梧龙隐"},
	{2, 177, 51, "长留云阳精魄", 1, "长留云阳"},	
}

tEffect = {
	[1] = {
		{"烈武", 28, 5},
		{"烈武(武少)", 30, 5},
		{"烈武(掌丐)", 32, 5},
	},
	[2] = {
		{"光昭", 29, 5},
		{"光昭(武少)", 31, 5},
		{"光昭(掌丐)", 33, 5},
	},
	[3] = {
		{"东皇", 34, 5},
		{"东皇(武少)", 35, 5},
		{"东皇(掌丐)", 36, 5},
	},
	[4] = {
		{"龙隐", 37, 5},
		{"龙隐(武少)", 38, 5},
		{"龙隐(掌丐)", 39, 5},
	},
	[5] = {
		{"苍梧", 40, 5},
		{"苍梧(武少)", 41, 5},
		{"苍梧(掌丐)", 42, 5},
	},
	
	[6] = {
		{"长留云阳", 43, 6},
		{"长留云阳(武少)", 44, 6},
		{"长留云阳(掌丐)", 45, 6},
	},	
	
	
	
	
	
	
	
}
--武器信息
Tb_golden_weapon_info = {
	[1]= {
		{0,3,22270,"烈武刀"},
		{0,3,22271,"烈武刀"},
		{0,8,22272,"烈武杖"},
		{0,8,22273,"烈武杖"},
		{0,0,22274,"烈武手"},
		{0,0,22275,"烈武手"},
		{0,1,22276,"烈武针"},
		{0,1,22277,"烈武针"},
		{0,1,22278,"烈武针"},
		{0,1,22279,"烈武针"},
		{0,2,22280,"烈武剑"},
		{0,2,22281,"烈武剑"},
		{0,10,22282,"烈武琴"},
		{0,10,22283,"烈武琴"},
		{0,0,22284,"烈武手"},
		{0,0,22285,"烈武手"},
		{0,0,22286,"烈武手"},
		{0,0,22287,"烈武手"},
		{0,5,22288,"烈武棍"},
		{0,5,22289,"烈武棍"},
		{0,5,22290,"烈武棍"},
		{0,5,22291,"烈武棍"},
		{0,2,22292,"烈武剑"},
		{0,2,22293,"烈武剑"},
		{0,2,22294,"烈武剑"},
		{0,2,22295,"烈武剑"},
		{0,9,22296,"烈武笔"},
		{0,9,22297,"烈武笔"},
		{0,9,22298,"烈武笔"},
		{0,9,22299,"烈武笔"},
		{0,6,22300,"烈武枪"},
		{0,6,22301,"烈武枪"},
		{0,6,22302,"烈武枪"},
		{0,6,22303,"烈武枪"},
		{0,4,22304,"烈武弓"},
		{0,4,22305,"烈武弓"},
		{0,4,22306,"烈武弓"},
		{0,4,22307,"烈武弓"},
		{0,7,22308,"烈武刃"},
		{0,7,22309,"烈武刃"},
		{0,7,22310,"烈武刃"},
		{0,7,22311,"烈武刃"},
		{0,11,22312,"烈武爪"},
		{0,11,22313,"烈武爪"},
		{0,11,22314,"烈武爪"},
		{0,11,22315,"烈武爪"},
		{0,2,22316,"烈武剑"},
		{0,2,22317,"烈武剑"},
		{0,3,22318,"烈武刀"},
		{0,3,22319,"烈武刀"},
		{0,3,22320,"烈武刀"},
		{0,3,22321,"烈武刀"},
		{0,9,22322,"烈武笔"},
		{0,9,22323,"烈武笔"},
		{0,9,22324,"烈武笔"},
		{0,9,22325,"烈武笔"},
		{0,11,22326,"烈武爪"},
		{0,11,22327,"烈武爪"},
		{0,11,22328,"烈武爪"},
		{0,11,22329,"烈武爪"},
		{0,13,22330,"烈武枝"},
		{0,13,22331,"烈武枝"},
		{0,12,22332,"烈武笛"},
		{0,12,22333,"烈武笛"},
		{0,14,22334,"烈武匕首"},
		{0,14,22335,"烈武匕首"},
		{0,14,22336,"烈武匕首"},
		{0,14,22337,"烈武匕首"},
		{0,2,22338,"烈武剑"},
		{0,2,22339,"烈武剑"},
		{0,3,22410,"烈武刀(八卦)"},
		{0,3,22411,"烈武刀(八卦)"},
		{0,8,22412,"烈武杖(八卦)"},
		{0,8,22413,"烈武杖(八卦)"},
		{0,0,22414,"烈武手(八卦)"},
		{0,0,22415,"烈武手(八卦)"},
		{0,1,22416,"烈武针(八卦)"},
		{0,1,22417,"烈武针(八卦)"},
		{0,1,22418,"烈武针(八卦)"},
		{0,1,22419,"烈武针(八卦)"},
		{0,2,22420,"烈武剑(八卦)"},
		{0,2,22421,"烈武剑(八卦)"},
		{0,10,22422,"烈武琴(八卦)"},
		{0,10,22423,"烈武琴(八卦)"},
		{0,0,22424,"烈武手(八卦)"},
		{0,0,22425,"烈武手(八卦)"},
		{0,0,22426,"烈武手(八卦)"},
		{0,0,22427,"烈武手(八卦)"},
		{0,5,22428,"烈武棍(八卦)"},
		{0,5,22429,"烈武棍(八卦)"},
		{0,5,22430,"烈武棍(八卦)"},
		{0,5,22431,"烈武棍(八卦)"},
		{0,2,22432,"烈武剑(八卦)"},
		{0,2,22433,"烈武剑(八卦)"},
		{0,2,22434,"烈武剑(八卦)"},
		{0,2,22435,"烈武剑(八卦)"},
		{0,9,22436,"烈武笔(八卦)"},
		{0,9,22437,"烈武笔(八卦)"},
		{0,9,22438,"烈武笔(八卦)"},
		{0,9,22439,"烈武笔(八卦)"},
		{0,6,22440,"烈武枪(八卦)"},
		{0,6,22441,"烈武枪(八卦)"},
		{0,6,22442,"烈武枪(八卦)"},
		{0,6,22443,"烈武枪(八卦)"},
		{0,4,22444,"烈武弓(八卦)"},
		{0,4,22445,"烈武弓(八卦)"},
		{0,4,22446,"烈武弓(八卦)"},
		{0,4,22447,"烈武弓(八卦)"},
		{0,7,22448,"烈武刃(八卦)"},
		{0,7,22449,"烈武刃(八卦)"},
		{0,7,22450,"烈武刃(八卦)"},
		{0,7,22451,"烈武刃(八卦)"},
		{0,11,22452,"烈武爪(八卦)"},
		{0,11,22453,"烈武爪(八卦)"},
		{0,11,22454,"烈武爪(八卦)"},
		{0,11,22455,"烈武爪(八卦)"},
		{0,2,22456,"烈武剑(八卦)"},
		{0,2,22457,"烈武剑(八卦)"},
		{0,3,22458,"烈武刀(八卦)"},
		{0,3,22459,"烈武刀(八卦)"},
		{0,3,22460,"烈武刀(八卦)"},
		{0,3,22461,"烈武刀(八卦)"},
		{0,9,22462,"烈武笔(八卦)"},
		{0,9,22463,"烈武笔(八卦)"},
		{0,9,22464,"烈武笔(八卦)"},
		{0,9,22465,"烈武笔(八卦)"},
		{0,11,22466,"烈武爪(八卦)"},
		{0,11,22467,"烈武爪(八卦)"},
		{0,11,22468,"烈武爪(八卦)"},
		{0,11,22469,"烈武爪(八卦)"},
		{0,13,22470,"烈武枝(八卦)"},
		{0,13,22471,"烈武枝(八卦)"},
		{0,12,22472,"烈武笛(八卦)"},
		{0,12,22473,"烈武笛(八卦)"},
		{0,14,22474,"烈武匕首(八卦)"},
		{0,14,22475,"烈武匕首(八卦)"},
		{0,14,22476,"烈武匕首(八卦)"},
		{0,14,22477,"烈武匕首(八卦)"},
		{0,2,22478,"烈武剑(八卦)"},
		{0,2,22479,"烈武剑(八卦)"},
	},
	[2] = {
		{0,3,22340,"光昭烈武刀"},
		{0,3,22341,"光昭烈武刀"},
		{0,8,22342,"光昭烈武杖"},
		{0,8,22343,"光昭烈武杖"},
		{0,0,22344,"光昭烈武手"},
		{0,0,22345,"光昭烈武手"},
		{0,1,22346,"光昭烈武针"},
		{0,1,22347,"光昭烈武针"},
		{0,1,22348,"光昭烈武针"},
		{0,1,22349,"光昭烈武针"},
		{0,2,22350,"光昭烈武剑"},
		{0,2,22351,"光昭烈武剑"},
		{0,10,22352,"光昭烈武琴"},
		{0,10,22353,"光昭烈武琴"},
		{0,0,22354,"光昭烈武手"},
		{0,0,22355,"光昭烈武手"},
		{0,0,22356,"光昭烈武手"},
		{0,0,22357,"光昭烈武手"},
		{0,5,22358,"光昭烈武棍"},
		{0,5,22359,"光昭烈武棍"},
		{0,5,22360,"光昭烈武棍"},
		{0,5,22361,"光昭烈武棍"},
		{0,2,22362,"光昭烈武剑"},
		{0,2,22363,"光昭烈武剑"},
		{0,2,22364,"光昭烈武剑"},
		{0,2,22365,"光昭烈武剑"},
		{0,9,22366,"光昭烈武笔"},
		{0,9,22367,"光昭烈武笔"},
		{0,9,22368,"光昭烈武笔"},
		{0,9,22369,"光昭烈武笔"},
		{0,6,22370,"光昭烈武枪"},
		{0,6,22371,"光昭烈武枪"},
		{0,6,22372,"光昭烈武枪"},
		{0,6,22373,"光昭烈武枪"},
		{0,4,22374,"光昭烈武弓"},
		{0,4,22375,"光昭烈武弓"},
		{0,4,22376,"光昭烈武弓"},
		{0,4,22377,"光昭烈武弓"},
		{0,7,22378,"光昭烈武刃"},
		{0,7,22379,"光昭烈武刃"},
		{0,7,22380,"光昭烈武刃"},
		{0,7,22381,"光昭烈武刃"},
		{0,11,22382,"光昭烈武爪"},
		{0,11,22383,"光昭烈武爪"},
		{0,11,22384,"光昭烈武爪"},
		{0,11,22385,"光昭烈武爪"},
		{0,2,22386,"光昭烈武剑"},
		{0,2,22387,"光昭烈武剑"},
		{0,3,22388,"光昭烈武刀"},
		{0,3,22389,"光昭烈武刀"},
		{0,3,22390,"光昭烈武刀"},
		{0,3,22391,"光昭烈武刀"},
		{0,9,22392,"光昭烈武笔"},
		{0,9,22393,"光昭烈武笔"},
		{0,9,22394,"光昭烈武笔"},
		{0,9,22395,"光昭烈武笔"},
		{0,11,22396,"光昭烈武爪"},
		{0,11,22397,"光昭烈武爪"},
		{0,11,22398,"光昭烈武爪"},
		{0,11,22399,"光昭烈武爪"},
		{0,13,22400,"光昭烈武枝"},
		{0,13,22401,"光昭烈武枝"},
		{0,12,22402,"光昭烈武笛"},
		{0,12,22403,"光昭烈武笛"},
		{0,14,22404,"光昭烈武匕首"},
		{0,14,22405,"光昭烈武匕首"},
		{0,14,22406,"光昭烈武匕首"},
		{0,14,22407,"光昭烈武匕首"},
		{0,2,22408,"光昭烈武剑"},
		{0,2,22409,"光昭烈武剑"},
		{0,3,22480,"光昭烈武刀(八卦)"},
		{0,3,22481,"光昭烈武刀(八卦)"},
		{0,8,22482,"光昭烈武杖(八卦)"},
		{0,8,22483,"光昭烈武杖(八卦)"},
		{0,0,22484,"光昭烈武手(八卦)"},
		{0,0,22485,"光昭烈武手(八卦)"},
		{0,1,22486,"光昭烈武针(八卦)"},
		{0,1,22487,"光昭烈武针(八卦)"},
		{0,1,22488,"光昭烈武针(八卦)"},
		{0,1,22489,"光昭烈武针(八卦)"},
		{0,2,22490,"光昭烈武剑(八卦)"},
		{0,2,22491,"光昭烈武剑(八卦)"},
		{0,10,22492,"光昭烈武琴(八卦)"},
		{0,10,22493,"光昭烈武琴(八卦)"},
		{0,0,22494,"光昭烈武手(八卦)"},
		{0,0,22495,"光昭烈武手(八卦)"},
		{0,0,22496,"光昭烈武手(八卦)"},
		{0,0,22497,"光昭烈武手(八卦)"},
		{0,5,22498,"光昭烈武棍(八卦)"},
		{0,5,22499,"光昭烈武棍(八卦)"},
		{0,5,22500,"光昭烈武棍(八卦)"},
		{0,5,22501,"光昭烈武棍(八卦)"},
		{0,2,22502,"光昭烈武剑(八卦)"},
		{0,2,22503,"光昭烈武剑(八卦)"},
		{0,2,22504,"光昭烈武剑(八卦)"},
		{0,2,22505,"光昭烈武剑(八卦)"},
		{0,9,22506,"光昭烈武笔(八卦)"},
		{0,9,22507,"光昭烈武笔(八卦)"},
		{0,9,22508,"光昭烈武笔(八卦)"},
		{0,9,22509,"光昭烈武笔(八卦)"},
		{0,6,22510,"光昭烈武枪(八卦)"},
		{0,6,22511,"光昭烈武枪(八卦)"},
		{0,6,22512,"光昭烈武枪(八卦)"},
		{0,6,22513,"光昭烈武枪(八卦)"},
		{0,4,22514,"光昭烈武弓(八卦)"},
		{0,4,22515,"光昭烈武弓(八卦)"},
		{0,4,22516,"光昭烈武弓(八卦)"},
		{0,4,22517,"光昭烈武弓(八卦)"},
		{0,7,22518,"光昭烈武刃(八卦)"},
		{0,7,22519,"光昭烈武刃(八卦)"},
		{0,7,22520,"光昭烈武刃(八卦)"},
		{0,7,22521,"光昭烈武刃(八卦)"},
		{0,11,22522,"光昭烈武爪(八卦)"},
		{0,11,22523,"光昭烈武爪(八卦)"},
		{0,11,22524,"光昭烈武爪(八卦)"},
		{0,11,22525,"光昭烈武爪(八卦)"},
		{0,2,22526,"光昭烈武剑(八卦)"},
		{0,2,22527,"光昭烈武剑(八卦)"},
		{0,3,22528,"光昭烈武刀(八卦)"},
		{0,3,22529,"光昭烈武刀(八卦)"},
		{0,3,22530,"光昭烈武刀(八卦)"},
		{0,3,22531,"光昭烈武刀(八卦)"},
		{0,9,22532,"光昭烈武笔(八卦)"},
		{0,9,22533,"光昭烈武笔(八卦)"},
		{0,9,22534,"光昭烈武笔(八卦)"},
		{0,9,22535,"光昭烈武笔(八卦)"},
		{0,11,22536,"光昭烈武爪(八卦)"},
		{0,11,22537,"光昭烈武爪(八卦)"},
		{0,11,22538,"光昭烈武爪(八卦)"},
		{0,11,22539,"光昭烈武爪(八卦)"},
		{0,13,22540,"光昭烈武枝(八卦)"},
		{0,13,22541,"光昭烈武枝(八卦)"},
		{0,12,22542,"光昭烈武笛(八卦)"},
		{0,12,22543,"光昭烈武笛(八卦)"},
		{0,14,22544,"光昭烈武匕首(八卦)"},
		{0,14,22545,"光昭烈武匕首(八卦)"},
		{0,14,22546,"光昭烈武匕首(八卦)"},
		{0,14,22547,"光昭烈武匕首(八卦)"},
		{0,2,22548,"光昭烈武剑(八卦)"},
		{0,2,22549,"光昭烈武剑(八卦)"},
	},
	[3] = {
		{0,3,23180,"东皇凤鸣刀"},
		{0,3,23181,"东皇凤鸣刀"},
		{0,8,23182,"东皇凤鸣杖"},
		{0,8,23183,"东皇凤鸣杖"},
		{0,0,23184,"东皇凤鸣手"},
		{0,0,23185,"东皇凤鸣手"},
		{0,1,23186,"东皇凤鸣针"},
		{0,1,23187,"东皇凤鸣针"},
		{0,1,23188,"东皇凤鸣针"},
		{0,1,23189,"东皇凤鸣针"},
		{0,2,23190,"东皇凤鸣剑"},
		{0,2,23191,"东皇凤鸣剑"},
		{0,10,23192,"东皇凤鸣琴"},
		{0,10,23193,"东皇凤鸣琴"},
		{0,0,23194,"东皇凤鸣手"},
		{0,0,23195,"东皇凤鸣手"},
		{0,0,23196,"东皇凤鸣手"},
		{0,0,23197,"东皇凤鸣手"},
		{0,5,23198,"东皇凤鸣棍"},
		{0,5,23199,"东皇凤鸣棍"},
		{0,5,23200,"东皇凤鸣棍"},
		{0,5,23201,"东皇凤鸣棍"},
		{0,2,23202,"东皇凤鸣剑"},
		{0,2,23203,"东皇凤鸣剑"},
		{0,2,23204,"东皇凤鸣剑"},
		{0,2,23205,"东皇凤鸣剑"},
		{0,9,23206,"东皇凤鸣笔"},
		{0,9,23207,"东皇凤鸣笔"},
		{0,9,23208,"东皇凤鸣笔"},
		{0,9,23209,"东皇凤鸣笔"},
		{0,6,23210,"东皇凤鸣枪"},
		{0,6,23211,"东皇凤鸣枪"},
		{0,6,23212,"东皇凤鸣枪"},
		{0,6,23213,"东皇凤鸣枪"},
		{0,4,23214,"东皇凤鸣弓"},
		{0,4,23215,"东皇凤鸣弓"},
		{0,4,23216,"东皇凤鸣弓"},
		{0,4,23217,"东皇凤鸣弓"},
		{0,7,23218,"东皇凤鸣刃"},
		{0,7,23219,"东皇凤鸣刃"},
		{0,7,23220,"东皇凤鸣刃"},
		{0,7,23221,"东皇凤鸣刃"},
		{0,11,23222,"东皇凤鸣爪"},
		{0,11,23223,"东皇凤鸣爪"},
		{0,11,23224,"东皇凤鸣爪"},
		{0,11,23225,"东皇凤鸣爪"},
		{0,2,23226,"东皇凤鸣剑"},
		{0,2,23227,"东皇凤鸣剑"},
		{0,3,23228,"东皇凤鸣刀"},
		{0,3,23229,"东皇凤鸣刀"},
		{0,3,23230,"东皇凤鸣刀"},
		{0,3,23231,"东皇凤鸣刀"},
		{0,9,23232,"东皇凤鸣笔"},
		{0,9,23233,"东皇凤鸣笔"},
		{0,9,23234,"东皇凤鸣笔"},
		{0,9,23235,"东皇凤鸣笔"},
		{0,11,23236,"东皇凤鸣爪"},
		{0,11,23237,"东皇凤鸣爪"},
		{0,11,23238,"东皇凤鸣爪"},
		{0,11,23239,"东皇凤鸣爪"},
		{0,13,23240,"东皇凤鸣扇"},
		{0,13,23241,"东皇凤鸣扇"},
		{0,12,23242,"东皇凤鸣笛"},
		{0,12,23243,"东皇凤鸣笛"},
		{0,14,23244,"东皇凤鸣匕首"},
		{0,14,23245,"东皇凤鸣匕首"},
		{0,14,23246,"东皇凤鸣匕首"},
		{0,14,23247,"东皇凤鸣匕首"},
		{0,2,23248,"东皇凤鸣剑"},
		{0,2,23249,"东皇凤鸣剑"},
		{0,3,23320,"东皇凤鸣刀(八卦)"},
		{0,3,23321,"东皇凤鸣刀(八卦)"},
		{0,8,23322,"东皇凤鸣杖(八卦)"},
		{0,8,23323,"东皇凤鸣杖(八卦)"},
		{0,0,23324,"东皇凤鸣手(八卦)"},
		{0,0,23325,"东皇凤鸣手(八卦)"},
		{0,1,23326,"东皇凤鸣针(八卦)"},
		{0,1,23327,"东皇凤鸣针(八卦)"},
		{0,1,23328,"东皇凤鸣针(八卦)"},
		{0,1,23329,"东皇凤鸣针(八卦)"},
		{0,2,23330,"东皇凤鸣剑(八卦)"},
		{0,2,23331,"东皇凤鸣剑(八卦)"},
		{0,10,23332,"东皇凤鸣琴(八卦)"},
		{0,10,23333,"东皇凤鸣琴(八卦)"},
		{0,0,23334,"东皇凤鸣手(八卦)"},
		{0,0,23335,"东皇凤鸣手(八卦)"},
		{0,0,23336,"东皇凤鸣手(八卦)"},
		{0,0,23337,"东皇凤鸣手(八卦)"},
		{0,5,23338,"东皇凤鸣棍(八卦)"},
		{0,5,23339,"东皇凤鸣棍(八卦)"},
		{0,5,23340,"东皇凤鸣棍(八卦)"},
		{0,5,23341,"东皇凤鸣棍(八卦)"},
		{0,2,23342,"东皇凤鸣剑(八卦)"},
		{0,2,23343,"东皇凤鸣剑(八卦)"},
		{0,2,23344,"东皇凤鸣剑(八卦)"},
		{0,2,23345,"东皇凤鸣剑(八卦)"},
		{0,9,23346,"东皇凤鸣笔(八卦)"},
		{0,9,23347,"东皇凤鸣笔(八卦)"},
		{0,9,23348,"东皇凤鸣笔(八卦)"},
		{0,9,23349,"东皇凤鸣笔(八卦)"},
		{0,6,23350,"东皇凤鸣枪(八卦)"},
		{0,6,23351,"东皇凤鸣枪(八卦)"},
		{0,6,23352,"东皇凤鸣枪(八卦)"},
		{0,6,23353,"东皇凤鸣枪(八卦)"},
		{0,4,23354,"东皇凤鸣弓(八卦)"},
		{0,4,23355,"东皇凤鸣弓(八卦)"},
		{0,4,23356,"东皇凤鸣弓(八卦)"},
		{0,4,23357,"东皇凤鸣弓(八卦)"},
		{0,7,23358,"东皇凤鸣刃(八卦)"},
		{0,7,23359,"东皇凤鸣刃(八卦)"},
		{0,7,23360,"东皇凤鸣刃(八卦)"},
		{0,7,23361,"东皇凤鸣刃(八卦)"},
		{0,11,23362,"东皇凤鸣爪(八卦)"},
		{0,11,23363,"东皇凤鸣爪(八卦)"},
		{0,11,23364,"东皇凤鸣爪(八卦)"},
		{0,11,23365,"东皇凤鸣爪(八卦)"},
		{0,2,23366,"东皇凤鸣剑(八卦)"},
		{0,2,23367,"东皇凤鸣剑(八卦)"},
		{0,3,23368,"东皇凤鸣刀(八卦)"},
		{0,3,23369,"东皇凤鸣刀(八卦)"},
		{0,3,23370,"东皇凤鸣刀(八卦)"},
		{0,3,23371,"东皇凤鸣刀(八卦)"},
		{0,9,23372,"东皇凤鸣笔(八卦)"},
		{0,9,23373,"东皇凤鸣笔(八卦)"},
		{0,9,23374,"东皇凤鸣笔(八卦)"},
		{0,9,23375,"东皇凤鸣笔(八卦)"},
		{0,11,23376,"东皇凤鸣爪(八卦)"},
		{0,11,23377,"东皇凤鸣爪(八卦)"},
		{0,11,23378,"东皇凤鸣爪(八卦)"},
		{0,11,23379,"东皇凤鸣爪(八卦)"},
		{0,13,23380,"东皇凤鸣扇(八卦)"},
		{0,13,23381,"东皇凤鸣扇(八卦)"},
		{0,12,23382,"东皇凤鸣笛(八卦)"},
		{0,12,23383,"东皇凤鸣笛(八卦)"},
		{0,14,23384,"东皇凤鸣匕首(八卦)"},
		{0,14,23385,"东皇凤鸣匕首(八卦)"},
		{0,14,23386,"东皇凤鸣匕首(八卦)"},
		{0,14,23387,"东皇凤鸣匕首(八卦)"},
		{0,2,23388,"东皇凤鸣剑(八卦)"},
		{0,2,23389,"东皇凤鸣剑(八卦)"},
{0,3,22894,"东皇凤鸣刀(八卦)"},
{0,3,22895,"东皇凤鸣刀(八卦)"},
{0,8,22896,"东皇凤鸣杖(八卦)"},
{0,8,22897,"东皇凤鸣杖(八卦)"},
{0,0,22898,"东皇凤鸣手(八卦)"},
{0,0,22899,"东皇凤鸣手(八卦)"},
{0,1,22900,"东皇凤鸣针(八卦)"},
{0,1,22901,"东皇凤鸣针(八卦)"},
{0,1,22902,"东皇凤鸣针(八卦)"},
{0,1,22903,"东皇凤鸣针(八卦)"},
{0,2,22904,"东皇凤鸣剑(八卦)"},
{0,2,22905,"东皇凤鸣剑(八卦)"},
{0,10,22906,"东皇凤鸣琴(八卦)"},
{0,10,22907,"东皇凤鸣琴(八卦)"},
{0,0,22908,"东皇凤鸣手(八卦)"},
{0,0,22909,"东皇凤鸣手(八卦)"},
{0,0,22910,"东皇凤鸣手(八卦)"},
{0,0,22911,"东皇凤鸣手(八卦)"},
{0,5,22912,"东皇凤鸣棍(八卦)"},
{0,5,22913,"东皇凤鸣棍(八卦)"},
{0,5,22914,"东皇凤鸣棍(八卦)"},
{0,5,22915,"东皇凤鸣棍(八卦)"},
{0,2,22916,"东皇凤鸣剑(八卦)"},
{0,2,22917,"东皇凤鸣剑(八卦)"},
{0,2,22918,"东皇凤鸣剑(八卦)"},
{0,2,22919,"东皇凤鸣剑(八卦)"},
{0,9,22920,"东皇凤鸣笔(八卦)"},
{0,9,22921,"东皇凤鸣笔(八卦)"},
{0,9,22922,"东皇凤鸣笔(八卦)"},
{0,9,22923,"东皇凤鸣笔(八卦)"},
{0,6,22924,"东皇凤鸣枪(八卦)"},
{0,6,22925,"东皇凤鸣枪(八卦)"},
{0,6,22926,"东皇凤鸣枪(八卦)"},
{0,6,22927,"东皇凤鸣枪(八卦)"},
{0,4,22928,"东皇凤鸣弓(八卦)"},
{0,4,22929,"东皇凤鸣弓(八卦)"},
{0,4,22930,"东皇凤鸣弓(八卦)"},
{0,4,22931,"东皇凤鸣弓(八卦)"},
{0,7,22932,"东皇凤鸣刃(八卦)"},
{0,7,22933,"东皇凤鸣刃(八卦)"},
{0,7,22934,"东皇凤鸣刃(八卦)"},
{0,7,22935,"东皇凤鸣刃(八卦)"},
{0,11,22936,"东皇凤鸣爪(八卦)"},
{0,11,22937,"东皇凤鸣爪(八卦)"},
{0,11,22938,"东皇凤鸣爪(八卦)"},
{0,11,22939,"东皇凤鸣爪(八卦)"},
{0,2,22940,"东皇凤鸣剑(八卦)"},
{0,2,22941,"东皇凤鸣剑(八卦)"},
{0,3,22942,"东皇凤鸣刀(八卦)"},
{0,3,22943,"东皇凤鸣刀(八卦)"},
{0,3,22944,"东皇凤鸣刀(八卦)"},
{0,3,22945,"东皇凤鸣刀(八卦)"},
{0,9,22946,"东皇凤鸣笔(八卦)"},
{0,9,22947,"东皇凤鸣笔(八卦)"},
{0,9,22948,"东皇凤鸣笔(八卦)"},
{0,9,22949,"东皇凤鸣笔(八卦)"},
{0,11,22950,"东皇凤鸣爪(八卦)"},
{0,11,22951,"东皇凤鸣爪(八卦)"},
{0,11,22952,"东皇凤鸣爪(八卦)"},
{0,11,22953,"东皇凤鸣爪(八卦)"},
{0,13,22954,"东皇凤鸣扇(八卦)"},
{0,13,22955,"东皇凤鸣扇(八卦)"},
{0,12,22956,"东皇凤鸣笛(八卦)"},
{0,12,22957,"东皇凤鸣笛(八卦)"},
{0,14,22958,"东皇凤鸣匕首(八卦)"},
{0,14,22959,"东皇凤鸣匕首(八卦)"},
{0,14,22960,"东皇凤鸣匕首(八卦)"},
{0,14,22961,"东皇凤鸣匕首(八卦)"},
{0,2,22962,"东皇凤鸣剑(八卦)"},
{0,2,22963,"东皇凤鸣剑(八卦)"},
		
		
		
		
		
		
		
		
		
		
		
		
		
	},
	[4] = {
		{0,3,40000,"龙隐刀"},
		{0,3,40001,"龙隐刀"},
		{0,8,40002,"龙隐杖"},
		{0,8,40003,"龙隐杖"},
		{0,0,40004,"龙隐手"},
		{0,0,40005,"龙隐手"},
		{0,1,40006,"龙隐针"},
		{0,1,40007,"龙隐针"},
		{0,1,40008,"龙隐针"},
		{0,1,40009,"龙隐针"},
		{0,2,40010,"龙隐剑"},
		{0,2,40011,"龙隐剑"},
		{0,10,40012,"龙隐琴"},
		{0,10,40013,"龙隐琴"},
		{0,0,40014,"龙隐手"},
		{0,0,40015,"龙隐手"},
		{0,0,40016,"龙隐手"},
		{0,0,40017,"龙隐手"},
		{0,5,40018,"龙隐棍"},
		{0,5,40019,"龙隐棍"},
		{0,5,40020,"龙隐棍"},
		{0,5,40021,"龙隐棍"},
		{0,2,40022,"龙隐剑"},
		{0,2,40023,"龙隐剑"},
		{0,2,40024,"龙隐剑"},
		{0,2,40025,"龙隐剑"},
		{0,9,40026,"龙隐笔"},
		{0,9,40027,"龙隐笔"},
		{0,9,40028,"龙隐笔"},
		{0,9,40029,"龙隐笔"},
		{0,6,40030,"龙隐枪"},
		{0,6,40031,"龙隐枪"},
		{0,6,40032,"龙隐枪"},
		{0,6,40033,"龙隐枪"},
		{0,4,40034,"龙隐弓"},
		{0,4,40035,"龙隐弓"},
		{0,4,40036,"龙隐弓"},
		{0,4,40037,"龙隐弓"},
		{0,7,40038,"龙隐刃"},
		{0,7,40039,"龙隐刃"},
		{0,7,40040,"龙隐刃"},
		{0,7,40041,"龙隐刃"},
		{0,11,40042,"龙隐爪"},
		{0,11,40043,"龙隐爪"},
		{0,11,40044,"龙隐爪"},
		{0,11,40045,"龙隐爪"},
		{0,2,40046,"龙隐剑"},
		{0,2,40047,"龙隐剑"},
		{0,3,40048,"龙隐刀"},
		{0,3,40049,"龙隐刀"},
		{0,3,40050,"龙隐刀"},
		{0,3,40051,"龙隐刀"},
		{0,9,40052,"龙隐笔"},
		{0,9,40053,"龙隐笔"},
		{0,9,40054,"龙隐笔"},
		{0,9,40055,"龙隐笔"},
		{0,11,40056,"龙隐爪"},
		{0,11,40057,"龙隐爪"},
		{0,11,40058,"龙隐爪"},
		{0,11,40059,"龙隐爪"},
		{0,13,40060,"龙隐扇"},
		{0,13,40061,"龙隐扇"},
		{0,12,40062,"龙隐笛"},
		{0,12,40063,"龙隐笛"},
		{0,14,40064,"龙隐匕首"},
		{0,14,40065,"龙隐匕首"},
		{0,14,40066,"龙隐匕首"},
		{0,14,40067,"龙隐匕首"},
		{0,2,40068,"龙隐剑"},
		{0,2,40069,"龙隐剑"},
		{0,3,40070,"龙隐刀(八卦)"},
		{0,3,40071,"龙隐刀(八卦)"},
		{0,8,40072,"龙隐杖(八卦)"},
		{0,8,40073,"龙隐杖(八卦)"},
		{0,0,40074,"龙隐手(八卦)"},
		{0,0,40075,"龙隐手(八卦)"},
		{0,1,40076,"龙隐针(八卦)"},
		{0,1,40077,"龙隐针(八卦)"},
		{0,1,40078,"龙隐针(八卦)"},
		{0,1,40079,"龙隐针(八卦)"},
		{0,2,40080,"龙隐剑(八卦)"},
		{0,2,40081,"龙隐剑(八卦)"},
		{0,10,40082,"龙隐琴(八卦)"},
		{0,10,40083,"龙隐琴(八卦)"},
		{0,0,40084,"龙隐手(八卦)"},
		{0,0,40085,"龙隐手(八卦)"},
		{0,0,40086,"龙隐手(八卦)"},
		{0,0,40087,"龙隐手(八卦)"},
		{0,5,40088,"龙隐棍(八卦)"},
		{0,5,40089,"龙隐棍(八卦)"},
		{0,5,40090,"龙隐棍(八卦)"},
		{0,5,40091,"龙隐棍(八卦)"},
		{0,2,40092,"龙隐剑(八卦)"},
		{0,2,40093,"龙隐剑(八卦)"},
		{0,2,40094,"龙隐剑(八卦)"},
		{0,2,40095,"龙隐剑(八卦)"},
		{0,9,40096,"龙隐笔(八卦)"},
		{0,9,40097,"龙隐笔(八卦)"},
		{0,9,40098,"龙隐笔(八卦)"},
		{0,9,40099,"龙隐笔(八卦)"},
		{0,6,40100,"龙隐枪(八卦)"},
		{0,6,40101,"龙隐枪(八卦)"},
		{0,6,40102,"龙隐枪(八卦)"},
		{0,6,40103,"龙隐枪(八卦)"},
		{0,4,40104,"龙隐弓(八卦)"},
		{0,4,40105,"龙隐弓(八卦)"},
		{0,4,40106,"龙隐弓(八卦)"},
		{0,4,40107,"龙隐弓(八卦)"},
		{0,7,40108,"龙隐刃(八卦)"},
		{0,7,40109,"龙隐刃(八卦)"},
		{0,7,40110,"龙隐刃(八卦)"},
		{0,7,40111,"龙隐刃(八卦)"},
		{0,11,40112,"龙隐爪(八卦)"},
		{0,11,40113,"龙隐爪(八卦)"},
		{0,11,40114,"龙隐爪(八卦)"},
		{0,11,40115,"龙隐爪(八卦)"},
		{0,2,40116,"龙隐剑(八卦)"},
		{0,2,40117,"龙隐剑(八卦)"},
		{0,3,40118,"龙隐刀(八卦)"},
		{0,3,40119,"龙隐刀(八卦)"},
		{0,3,40120,"龙隐刀(八卦)"},
		{0,3,40121,"龙隐刀(八卦)"},
		{0,9,40122,"龙隐笔(八卦)"},
		{0,9,40123,"龙隐笔(八卦)"},
		{0,9,40124,"龙隐笔(八卦)"},
		{0,9,40125,"龙隐笔(八卦)"},
		{0,11,40126,"龙隐爪(八卦)"},
		{0,11,40127,"龙隐爪(八卦)"},
		{0,11,40128,"龙隐爪(八卦)"},
		{0,11,40129,"龙隐爪(八卦)"},
		{0,13,40130,"龙隐扇(八卦)"},
		{0,13,40131,"龙隐扇(八卦)"},
		{0,12,40132,"龙隐笛(八卦)"},
		{0,12,40133,"龙隐笛(八卦)"},
		{0,14,40134,"龙隐匕首(八卦)"},
		{0,14,40135,"龙隐匕首(八卦)"},
		{0,14,40136,"龙隐匕首(八卦)"},
		{0,14,40137,"龙隐匕首(八卦)"},
		{0,2,40138,"龙隐剑(八卦)"},
		{0,2,40139,"龙隐剑(八卦)"},
	},
	[5] = {
		{0,3,40140,"苍梧龙隐刀"},
		{0,3,40141,"苍梧龙隐刀"},
		{0,8,40142,"苍梧龙隐杖"},
		{0,8,40143,"苍梧龙隐杖"},
		{0,0,40144,"苍梧龙隐手"},
		{0,0,40145,"苍梧龙隐手"},
		{0,1,40146,"苍梧龙隐针"},
		{0,1,40147,"苍梧龙隐针"},
		{0,1,40148,"苍梧龙隐针"},
		{0,1,40149,"苍梧龙隐针"},
		{0,2,40150,"苍梧龙隐剑"},
		{0,2,40151,"苍梧龙隐剑"},
		{0,10,40152,"苍梧龙隐琴"},
		{0,10,40153,"苍梧龙隐琴"},
		{0,0,40154,"苍梧龙隐手"},
		{0,0,40155,"苍梧龙隐手"},
		{0,0,40156,"苍梧龙隐手"},
		{0,0,40157,"苍梧龙隐手"},
		{0,5,40158,"苍梧龙隐棍"},
		{0,5,40159,"苍梧龙隐棍"},
		{0,5,40160,"苍梧龙隐棍"},
		{0,5,40161,"苍梧龙隐棍"},
		{0,2,40162,"苍梧龙隐剑"},
		{0,2,40163,"苍梧龙隐剑"},
		{0,2,40164,"苍梧龙隐剑"},
		{0,2,40165,"苍梧龙隐剑"},
		{0,9,40166,"苍梧龙隐笔"},
		{0,9,40167,"苍梧龙隐笔"},
		{0,9,40168,"苍梧龙隐笔"},
		{0,9,40169,"苍梧龙隐笔"},
		{0,6,40170,"苍梧龙隐枪"},
		{0,6,40171,"苍梧龙隐枪"},
		{0,6,40172,"苍梧龙隐枪"},
		{0,6,40173,"苍梧龙隐枪"},
		{0,4,40174,"苍梧龙隐弓"},
		{0,4,40175,"苍梧龙隐弓"},
		{0,4,40176,"苍梧龙隐弓"},
		{0,4,40177,"苍梧龙隐弓"},
		{0,7,40178,"苍梧龙隐刃"},
		{0,7,40179,"苍梧龙隐刃"},
		{0,7,40180,"苍梧龙隐刃"},
		{0,7,40181,"苍梧龙隐刃"},
		{0,11,40182,"苍梧龙隐爪"},
		{0,11,40183,"苍梧龙隐爪"},
		{0,11,40184,"苍梧龙隐爪"},
		{0,11,40185,"苍梧龙隐爪"},
		{0,2,40186,"苍梧龙隐剑"},
		{0,2,40187,"苍梧龙隐剑"},
		{0,3,40188,"苍梧龙隐刀"},
		{0,3,40189,"苍梧龙隐刀"},
		{0,3,40190,"苍梧龙隐刀"},
		{0,3,40191,"苍梧龙隐刀"},
		{0,9,40192,"苍梧龙隐笔"},
		{0,9,40193,"苍梧龙隐笔"},
		{0,9,40194,"苍梧龙隐笔"},
		{0,9,40195,"苍梧龙隐笔"},
		{0,11,40196,"苍梧龙隐爪"},
		{0,11,40197,"苍梧龙隐爪"},
		{0,11,40198,"苍梧龙隐爪"},
		{0,11,40199,"苍梧龙隐爪"},
		{0,13,40200,"苍梧龙隐扇"},
		{0,13,40201,"苍梧龙隐扇"},
		{0,12,40202,"苍梧龙隐笛"},
		{0,12,40203,"苍梧龙隐笛"},
		{0,14,40204,"苍梧龙隐匕首"},
		{0,14,40205,"苍梧龙隐匕首"},
		{0,14,40206,"苍梧龙隐匕首"},
		{0,14,40207,"苍梧龙隐匕首"},
		{0,2,40208,"苍梧龙隐剑"},
		{0,2,40209,"苍梧龙隐剑"},
		{0,3,40210,"苍梧龙隐刀(八卦)"},
		{0,3,40211,"苍梧龙隐刀(八卦)"},
		{0,8,40212,"苍梧龙隐杖(八卦)"},
		{0,8,40213,"苍梧龙隐杖(八卦)"},
		{0,0,40214,"苍梧龙隐手(八卦)"},
		{0,0,40215,"苍梧龙隐手(八卦)"},
		{0,1,40216,"苍梧龙隐针(八卦)"},
		{0,1,40217,"苍梧龙隐针(八卦)"},
		{0,1,40218,"苍梧龙隐针(八卦)"},
		{0,1,40219,"苍梧龙隐针(八卦)"},
		{0,2,40220,"苍梧龙隐剑(八卦)"},
		{0,2,40221,"苍梧龙隐剑(八卦)"},
		{0,10,40222,"苍梧龙隐琴(八卦)"},
		{0,10,40223,"苍梧龙隐琴(八卦)"},
		{0,0,40224,"苍梧龙隐手(八卦)"},
		{0,0,40225,"苍梧龙隐手(八卦)"},
		{0,0,40226,"苍梧龙隐手(八卦)"},
		{0,0,40227,"苍梧龙隐手(八卦)"},
		{0,5,40228,"苍梧龙隐棍(八卦)"},
		{0,5,40229,"苍梧龙隐棍(八卦)"},
		{0,5,40230,"苍梧龙隐棍(八卦)"},
		{0,5,40231,"苍梧龙隐棍(八卦)"},
		{0,2,40232,"苍梧龙隐剑(八卦)"},
		{0,2,40233,"苍梧龙隐剑(八卦)"},
		{0,2,40234,"苍梧龙隐剑(八卦)"},
		{0,2,40235,"苍梧龙隐剑(八卦)"},
		{0,9,40236,"苍梧龙隐笔(八卦)"},
		{0,9,40237,"苍梧龙隐笔(八卦)"},
		{0,9,40238,"苍梧龙隐笔(八卦)"},
		{0,9,40239,"苍梧龙隐笔(八卦)"},
		{0,6,40240,"苍梧龙隐枪(八卦)"},
		{0,6,40241,"苍梧龙隐枪(八卦)"},
		{0,6,40242,"苍梧龙隐枪(八卦)"},
		{0,6,40243,"苍梧龙隐枪(八卦)"},
		{0,4,40244,"苍梧龙隐弓(八卦)"},
		{0,4,40245,"苍梧龙隐弓(八卦)"},
		{0,4,40246,"苍梧龙隐弓(八卦)"},
		{0,4,40247,"苍梧龙隐弓(八卦)"},
		{0,7,40248,"苍梧龙隐刃(八卦)"},
		{0,7,40249,"苍梧龙隐刃(八卦)"},
		{0,7,40250,"苍梧龙隐刃(八卦)"},
		{0,7,40251,"苍梧龙隐刃(八卦)"},
		{0,11,40252,"苍梧龙隐爪(八卦)"},
		{0,11,40253,"苍梧龙隐爪(八卦)"},
		{0,11,40254,"苍梧龙隐爪(八卦)"},
		{0,11,40255,"苍梧龙隐爪(八卦)"},
		{0,2,40256,"苍梧龙隐剑(八卦)"},
		{0,2,40257,"苍梧龙隐剑(八卦)"},
		{0,3,40258,"苍梧龙隐刀(八卦)"},
		{0,3,40259,"苍梧龙隐刀(八卦)"},
		{0,3,40260,"苍梧龙隐刀(八卦)"},
		{0,3,40261,"苍梧龙隐刀(八卦)"},
		{0,9,40262,"苍梧龙隐笔(八卦)"},
		{0,9,40263,"苍梧龙隐笔(八卦)"},
		{0,9,40264,"苍梧龙隐笔(八卦)"},
		{0,9,40265,"苍梧龙隐笔(八卦)"},
		{0,11,40266,"苍梧龙隐爪(八卦)"},
		{0,11,40267,"苍梧龙隐爪(八卦)"},
		{0,11,40268,"苍梧龙隐爪(八卦)"},
		{0,11,40269,"苍梧龙隐爪(八卦)"},
		{0,13,40270,"苍梧龙隐扇(八卦)"},
		{0,13,40271,"苍梧龙隐扇(八卦)"},
		{0,12,40272,"苍梧龙隐笛(八卦)"},
		{0,12,40273,"苍梧龙隐笛(八卦)"},
		{0,14,40274,"苍梧龙隐匕首(八卦)"},
		{0,14,40275,"苍梧龙隐匕首(八卦)"},
		{0,14,40276,"苍梧龙隐匕首(八卦)"},
		{0,14,40277,"苍梧龙隐匕首(八卦)"},
		{0,2,40278,"苍梧龙隐剑(八卦)"},
		{0,2,40279,"苍梧龙隐剑(八卦)"},
	},
	
	
[6] = {
{0,3,40420,"长留云阳刀"},
{0,3,40421,"长留云阳刀"},
{0,8,40422,"长留云阳杖"},
{0,8,40423,"长留云阳杖"},
{0,0,40424,"长留云阳手"},
{0,0,40425,"长留云阳手"},
{0,1,40426,"长留云阳针"},
{0,1,40427,"长留云阳针"},
{0,1,40428,"长留云阳针"},
{0,1,40429,"长留云阳针"},
{0,2,40430,"长留云阳剑"},
{0,2,40431,"长留云阳剑"},
{0,10,40432,"长留云阳琴"},
{0,10,40433,"长留云阳琴"},
{0,0,40434,"长留云阳手"},
{0,0,40435,"长留云阳手"},
{0,0,40436,"长留云阳手"},
{0,0,40437,"长留云阳手"},
{0,5,40438,"长留云阳棍"},
{0,5,40439,"长留云阳棍"},
{0,5,40440,"长留云阳棍"},
{0,5,40441,"长留云阳棍"},
{0,2,40442,"长留云阳剑"},
{0,2,40443,"长留云阳剑"},
{0,2,40444,"长留云阳剑"},
{0,2,40445,"长留云阳剑"},
{0,9,40446,"长留云阳笔"},
{0,9,40447,"长留云阳笔"},
{0,9,40448,"长留云阳笔"},
{0,9,40449,"长留云阳笔"},
{0,6,40450,"长留云阳枪"},
{0,6,40451,"长留云阳枪"},
{0,6,40452,"长留云阳枪"},
{0,6,40453,"长留云阳枪"},
{0,4,40454,"长留云阳弓"},
{0,4,40455,"长留云阳弓"},
{0,4,40456,"长留云阳弓"},
{0,4,40457,"长留云阳弓"},
{0,7,40458,"长留云阳刃"},
{0,7,40459,"长留云阳刃"},
{0,7,40460,"长留云阳刃"},
{0,7,40461,"长留云阳刃"},
{0,11,40462,"长留云阳爪"},
{0,11,40463,"长留云阳爪"},
{0,11,40464,"长留云阳爪"},
{0,11,40465,"长留云阳爪"},
{0,2,40466,"长留云阳剑"},
{0,2,40467,"长留云阳剑"},
{0,3,40468,"长留云阳刀"},
{0,3,40469,"长留云阳刀"},
{0,3,40470,"长留云阳刀"},
{0,3,40471,"长留云阳刀"},
{0,9,40472,"长留云阳笔"},
{0,9,40473,"长留云阳笔"},
{0,9,40474,"长留云阳笔"},
{0,9,40475,"长留云阳笔"},
{0,11,40476,"长留云阳爪"},
{0,11,40477,"长留云阳爪"},
{0,11,40478,"长留云阳爪"},
{0,11,40479,"长留云阳爪"},
{0,13,40480,"长留云阳扇"},
{0,13,40481,"长留云阳扇"},
{0,12,40482,"长留云阳笛"},
{0,12,40483,"长留云阳笛"},
{0,14,40484,"长留云阳匕首"},
{0,14,40485,"长留云阳匕首"},
{0,14,40486,"长留云阳匕首"},
{0,14,40487,"长留云阳匕首"},
{0,2,40488,"长留云阳剑"},
{0,2,40489,"长留云阳剑"},
{0,3,40490,"长留云阳刀(八卦)"},
{0,3,40491,"长留云阳刀(八卦)"},
{0,8,40492,"长留云阳杖(八卦)"},
{0,8,40493,"长留云阳杖(八卦)"},
{0,0,40494,"长留云阳手(八卦)"},
{0,0,40495,"长留云阳手(八卦)"},
{0,1,40496,"长留云阳针(八卦)"},
{0,1,40497,"长留云阳针(八卦)"},
{0,1,40498,"长留云阳针(八卦)"},
{0,1,40499,"长留云阳针(八卦)"},
{0,2,40500,"长留云阳剑(八卦)"},
{0,2,40501,"长留云阳剑(八卦)"},
{0,10,40502,"长留云阳琴(八卦)"},
{0,10,40503,"长留云阳琴(八卦)"},
{0,0,40504,"长留云阳手(八卦)"},
{0,0,40505,"长留云阳手(八卦)"},
{0,0,40506,"长留云阳手(八卦)"},
{0,0,40507,"长留云阳手(八卦)"},
{0,5,40508,"长留云阳棍(八卦)"},
{0,5,40509,"长留云阳棍(八卦)"},
{0,5,40510,"长留云阳棍(八卦)"},
{0,5,40511,"长留云阳棍(八卦)"},
{0,2,40512,"长留云阳剑(八卦)"},
{0,2,40513,"长留云阳剑(八卦)"},
{0,2,40514,"长留云阳剑(八卦)"},
{0,2,40515,"长留云阳剑(八卦)"},
{0,9,40516,"长留云阳笔(八卦)"},
{0,9,40517,"长留云阳笔(八卦)"},
{0,9,40518,"长留云阳笔(八卦)"},
{0,9,40519,"长留云阳笔(八卦)"},
{0,6,40520,"长留云阳枪(八卦)"},
{0,6,40521,"长留云阳枪(八卦)"},
{0,6,40522,"长留云阳枪(八卦)"},
{0,6,40523,"长留云阳枪(八卦)"},
{0,4,40524,"长留云阳弓(八卦)"},
{0,4,40525,"长留云阳弓(八卦)"},
{0,4,40526,"长留云阳弓(八卦)"},
{0,4,40527,"长留云阳弓(八卦)"},
{0,7,40528,"长留云阳刃(八卦)"},
{0,7,40529,"长留云阳刃(八卦)"},
{0,7,40530,"长留云阳刃(八卦)"},
{0,7,40531,"长留云阳刃(八卦)"},
{0,11,40532,"长留云阳爪(八卦)"},
{0,11,40533,"长留云阳爪(八卦)"},
{0,11,40534,"长留云阳爪(八卦)"},
{0,11,40535,"长留云阳爪(八卦)"},
{0,2,40536,"长留云阳剑(八卦)"},
{0,2,40537,"长留云阳剑(八卦)"},
{0,3,40538,"长留云阳刀(八卦)"},
{0,3,40539,"长留云阳刀(八卦)"},
{0,3,40540,"长留云阳刀(八卦)"},
{0,3,40541,"长留云阳刀(八卦)"},
{0,9,40542,"长留云阳笔(八卦)"},
{0,9,40543,"长留云阳笔(八卦)"},
{0,9,40544,"长留云阳笔(八卦)"},
{0,9,40545,"长留云阳笔(八卦)"},
{0,11,40546,"长留云阳爪(八卦)"},
{0,11,40547,"长留云阳爪(八卦)"},
{0,11,40548,"长留云阳爪(八卦)"},
{0,11,40549,"长留云阳爪(八卦)"},
{0,13,40550,"长留云阳扇(八卦)"},
{0,13,40551,"长留云阳扇(八卦)"},
{0,12,40552,"长留云阳笛(八卦)"},
{0,12,40553,"长留云阳笛(八卦)"},
{0,14,40554,"长留云阳匕首(八卦)"},
{0,14,40555,"长留云阳匕首(八卦)"},
{0,14,40556,"长留云阳匕首(八卦)"},
{0,14,40557,"长留云阳匕首(八卦)"},
{0,2,40558,"长留云阳剑(八卦)"},
{0,2,40559,"长留云阳剑(八卦)"},
	
},
	

}

function OnUse(idx)
	local nItemIndex = tonumber(idx)
	local nGenre, nDetail, nParticular = GetItemInfoByIndex(nItemIndex)
	local nTabIndex = 0
	for index, value in tTab do
		if value[1] == nGenre and value[2] == nDetail and value[3] == nParticular then
			nTabIndex = index
			break
		end
	end
	
	if nTabIndex == 0 then
		return
	end
	local weapon_index = GetPlayerEquipIndex(2)
	SetTaskTemp(199,weapon_index)
	SetTaskTemp(25, nTabIndex)
	--武器切换检测
	if weapon_cha_chk() ~= 1 then
		return
	end
	local aptitude_name = weapon_effect(nTabIndex)
	local WeaponEffect = {
		"您是否要消耗<color=yellow>"..tTab[nTabIndex][5].."个"..tTab[nTabIndex][4].."<color>为您当前装备的武器附着武器特效<color=yellow>"..aptitude_name.."<color>？",
		"（持续时间：<color=yellow>30天<color>）",
		"确定/magic_add_dtm",
		"取消/no"
	}
	Say(WeaponEffect[1]..WeaponEffect[2],2,WeaponEffect[3],WeaponEffect[4])
end

function magic_add_dtm()
	local nTabIndex = GetTaskTemp(25)
	--武器切换检测
	if weapon_cha_chk() ~= 1 then
		return
	end
	local aptitude_name = weapon_effect(nTabIndex)
	if weapon_golden_chk(nTabIndex) ~= 1 then
		Talk(1,"", "<color=green>"..tTab[nTabIndex][4].."<color>只能为<color=yellow>"..tTab[nTabIndex][6].."系列武器<color>附着<color=yellow>"..aptitude_name.."<color>武器特效，大侠佩戴的好像不是"..tTab[nTabIndex][6].."武器哦！")
		return
	end
	local weapon_index = GetPlayerEquipIndex(2)
	local weapon_nume = "<color=yellow>"..GetItemName(weapon_index).."<color>"
	--判断是否已经附加了灵魄
	local cur_aptitude_name = GetBindedWeaponEffectName()
	if cur_aptitude_name  ~= "" then
		--附加了灵魄判断
		if  cur_aptitude_name == aptitude_name then
			Say("您的"..weapon_nume.."武器已经附着武器特效<color=yellow>"..cur_aptitude_name.."<color>，无需再次添加。您也可以删除特效。",
	    		2,
			"删除"..cur_aptitude_name.."特效/soul_delete",
			"算了，还是留着吧/no")
			return
		end
		Say("您的"..weapon_nume.."武器已经附着武器特效<color=yellow>"..cur_aptitude_name.."<color>，您是否更换新的武器特效<color=yellow>"..aptitude_name.."<color>!",
	    	3,
		"是的，我要替换/add_ability_dtm",
		"删除"..cur_aptitude_name.."特效/soul_delete",
		"算了，还是保留原来的/no")
		return
	end
	--武器耐久判断
	if AbradeItem(weapon_index,0) == 0 then
		Talk(1,"","您的"..weapon_nume.."武器耐久度为0，已经不能附着武器特效<color=yellow>"..aptitude_name.."<color>!")
		return
	end
	--材料数量判断
	local nHave = GetItemCount(tTab[nTabIndex][1], tTab[nTabIndex][2], tTab[nTabIndex][3])
	if nHave < tTab[nTabIndex][5] then
		Talk(1,"","您需要有<color=yellow>"..tTab[nTabIndex][5].."个"..tTab[nTabIndex][4].."<color>才可以为您的武器附着武器特效<color=yellow>"..aptitude_name.."<color>。")
		return
	end
	add_ability_dtm()
end

function add_ability_dtm()
	local nTabIndex = GetTaskTemp(25)
	local ckdelIFlag = 0
	--武器切换检测
	if weapon_cha_chk() ~= 1 then
		return
	end
	local aptitude_name, aptitude_diff, aptitude_level = weapon_effect(nTabIndex)
	--特效增加
	if BindWeaponEffect(aptitude_name, (30*86400) ) == 1 then	--86400 = 24*60*60
		Talk(1, "", "恭喜您成功为您的武器附着武器特效<color=yellow>"..aptitude_name.."<color>，可以在武器信息的<color=yellow>左下角<color>，单击红色按钮唤醒武器特效，也可以使用快捷键<color=red>F<color>唤醒或关闭武器特效。");
		Msg2Player("您为您的武器附着了武器特效："..aptitude_name.."");
		ckdelIFlag = 1;
		WriteLog("[武器特效]:"..GetName().."成功附着了武器特效："..aptitude_name);
	else
		ckdelIFlag = 0;
		WriteLog("[武器特效]:"..GetName().."附着武器特效："..aptitude_name.."失败");
		return 0;
	end
	--附加灵能 1-生命上限增加 2-全属性
	if AddWeaponEffectAttribute(1, aptitude_level) == 1 then --加生命上限
		ckdelIFlag = 1;
		WriteLog("[附加灵能]:"..GetName().."成功附着了武器特效："..aptitude_name.."并附加灵能");
	else
		ckdelIFlag = 0;
		WriteLog("[附加灵能]:"..GetName().."附着武器特效："..aptitude_name.."灵能失败");
		return 0;
	end
	if AddWeaponEffectAttribute(7, aptitude_level) == 1 then --加全属性
		ckdelIFlag = 1;
		WriteLog("[附加灵能]:"..GetName().."成功附着了武器特效："..aptitude_name.."并附加灵能");
	else
		ckdelIFlag = 0;
		WriteLog("[附加灵能]:"..GetName().."附着武器特效："..aptitude_name.."灵能失败");
		return 0;
	end
	if ckdelIFlag == 1 then
		DelItem(tTab[nTabIndex][1], tTab[nTabIndex][2], tTab[nTabIndex][3], tTab[nTabIndex][5])
	else
		WriteLog("[附加灵能]:"..GetName().."附着武器特效："..aptitude_name.."灵能失败，未知错误");
	end
end

--//删除函数
function soul_delete()
	--武器切换检测
	if weapon_cha_chk() ~= 1 then
		return
	end
	local weapon_nume = GetBindedWeaponEffectName();							 --是否有灵魄
	if weapon_nume == nil or weapon_nume == "" then
		Talk(1,"","您的"..weapon_nume.."武器已经没有武器特效。")
		return 0;
	end
	--储物箱是否锁定
	if IsBoxLocking() == 1 then
		Talk(1,"","您得储物箱已锁定，解锁后才能移除您的<color=yellow>"..weapon_nume.."<color>特效及灵能！")
		return
	end
	--武器是否锁定
	if GetItemSpecialAttr(GetPlayerEquipIndex(2),"LOCK") == 1 then
		Talk(1,"main","您的<color=yellow>"..weapon_nume.."<color>已锁定，解锁后才能移除特效及灵能！")
		return
	end
	--删除处理
	--先删灵能
	local nSoulNum, tbSoul = GetWeaponEffectAttributes();
	for i = 1, nSoulNum do												  --可能武器具有多种灵能
		RemoveWeaponEffectAttribute(tbSoul[i].id);
		WriteLog("[删除特效]:"..GetName().."成功删除武器特效："..weapon_nume.."及灵能");
	end
	--再删灵魄
	UnbindWeaponEffect();	
	Msg2Player("您成功移除了您的武器特效："..weapon_nume.."");
end

--武器效果
function weapon_effect(nTabIndex)
	local nRoute = GetPlayerRoute();
	local nEffect = tEffect[nTabIndex];
	if nRoute == 4 then
		return nEffect[2][1], nEffect[2][2], nEffect[2][3]
	elseif nRoute == 11 then
		return nEffect[3][1], nEffect[3][2], nEffect[3][3]
	else
		return nEffect[1][1], nEffect[1][2], nEffect[1][3]
	end
end

--武器更换检测
function weapon_cha_chk()
	local weapon_index = GetPlayerEquipIndex(2)
	local weapon_index_saved = GetTaskTemp(199)
	--武器装备判断
	if  weapon_index == 0 then
		Talk(1,"","您还是先装备把趁手的兵器再来给它附特效吧！")
		return 0
	end
	--武器配对检测
	if weapon_index_saved ~= weapon_index then
		Talk(1,"","您更换武器的动作太快了，等等再来给它附特效吧！")
		return 0
	end
	return 1
end

--武器判断
function weapon_golden_chk(nType)
	--武器ID获取
	local weapon_id_1st,weapon_id_2nd,weapon_3rd = GetPlayerEquipInfo(2)
	local golden_weapon_chk_flag = 0
	for i = 1, getn(Tb_golden_weapon_info[nType]) do
		if Tb_golden_weapon_info[nType][i][1] == weapon_id_1st and Tb_golden_weapon_info[nType][i][2] == weapon_id_2nd and Tb_golden_weapon_info[nType][i][3] == weapon_3rd then
			golden_weapon_chk_flag = 1
		end
	end
	if golden_weapon_chk_flag == 0 then
		return 0
	else
		return 1
	end
end

function no()
end
