Include("\\script\\class\\ktabfile.lua");

tbYangMen = {}
tbYangMen.nMapId		= 219

tbYangMen.tbDialogNpc	= 
{
	--天波杨府相关
	{"健康的余太君","佘太君",219,1529,3137,"\\script\\中原一区\\天波杨府\\npc\\佘太君.lua"},
	{"杨延昭","杨延昭",219,1543,2939,"\\script\\中原一区\\天波杨府\\npc\\杨延昭.lua"},
	{"杨排风","杨排风",219,1454,3107,"\\script\\中原一区\\天波杨府\\npc\\杨排风.lua"},
	{"杨宗保","杨宗保",219,1559,3084,"\\script\\中原一区\\天波杨府\\npc\\杨宗保.lua"},
	{"穆桂英","穆桂英",219,1481,3184,"\\script\\中原一区\\天波杨府\\npc\\穆桂英.lua"},
	{"管家","杨洪",219,1634,3278,"\\script\\中原一区\\天波杨府\\npc\\杨洪.lua"},
	{"董迦明","董迦明",219,1580,3119,"\\script\\中原一区\\天波杨府\\npc\\董迦明.lua"},
--	{"杨门枪骑首席大弟子","杨门首席大弟子",219,1543,3157,"\\script\\中原一区\\天波杨府\\npc\\杨门首席大弟子.lua"},
	{"中原储物柜","物品保管人",219,1599,3140,"\\script\\中原一区\\天波杨府\\npc\\中原储物柜.lua"},
	{"门派练功木桩","门派练功木桩",219,1669,3221},
	{"门派练功木桩","门派练功木桩",219,1674,3226},
	{"门派练功木桩","门派练功木桩",219,1678,3221},
	{"门派练功木桩","门派练功木桩",219,1674,3215},
}

function tbYangMen:CreateBattleNpc()
	local tPos = {
		{219, 1671, 3217},
		{219, 1666, 3222},
		{219, 1663, 3229},
		{219, 1656, 3235},
		{219, 1663, 3246},
		{219, 1671, 3258},
		{219, 1682, 3249},
		{219, 1690, 3239},
		{219, 1683, 3226},
		{219, 1675, 3219},
	}
	for i =1, getn(tPos) do
		CreateNpc("护卫跟班3", "黑衣壮士", tPos[i][1], tPos[i][2], tPos[i][3]);
	end
end
