Include("\\script\\class\\clause3.lua")
Include("\\script\\lib\\itemfunctions.lua")

tAllAward = {
	[1] = { --比武大会精武包（ok）
		maxRand = 10000,
		subclauses = {
			{{"藏剑金装";giveClause =function() gl_aw_addEquip(1,0,1,0,"恭喜[$n]在开启<比武大会精武包>奖励时，获得$i") end},300},
			{{"藏剑金装首饰";giveClause =function() gl_aw_addEquip(2,0,1,0,"恭喜[$n]在开启<比武大会精武包>奖励时，获得$i") end},200},
			{{"7级灵石原石", {2,95,559,1,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i", nil, 160}, 400},
			{{"灵石宝箱", {2,95,5435,20,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 100},
			{{"灵石宝箱", {2,95,5435,50,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 200},
			{{"灵石宝箱", {2,95,5435,100,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 100},
			{{"五行秘籍全本", {0,107,157,1,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 300},
			{{"师门真卷包裹", {2,95,617,1,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 500},
			{{"凌波微步残本", {2,95,146,4,1},"恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 300},
			{{"凌波微步残本", {2,95,146,8,1},"恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 100},
			{{"陨铁碎片", {2,2,7,100,1},}, 250},
			{{"陨铁", {2,2,8,50,1},}, 350},
			{{"陨铁精石", {2,1,1009,20,1},}, 500},
			{{"月华水精", {2,201,7,1,1}, }, 200},
			{{"星辰碎片", {2,201,1,4,1}, }, 400},
			{{"星辰碎片", {2,201,1,16,1},  "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 500},
			{{"陨铁精石", {2,1,1009,50,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 200},
			{{"陨铁精石", {2,1,1009,100,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i"}, 200},
			{{"强化精石（11级）", {2,101,12,1,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i！"}, 300},
			{{"强化精石（12级）", {2,101,13,1,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i！"}, 250},
			{{"强化精石（13级）", {2,101,14,1,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i！"}, 150},
			{{"辉煌军功章", {2,1,9977,1,1}, "恭喜[$n]在开启<比武大会精武包>奖励时，获得$i！"}, 200},
			{{"金钱袋", {2,95,662,30,1}}, 4000},
		},
		giveClause = ClauseRandom.giveClause,
	},
};

--比武大会精武包(ok)
function gl_aw_giveAward()
	gf_Modify("Exp",5000000);
	gf_AddItemEx({2, 94, 12, 1},"盛世金宝箱");
--	Msg2Global("恭喜["..GetName().."]在开启<比武大会精武包>奖励时，获得[盛世金宝箱]×1");
	tAllAward[1]:giveClause();
	return 1
end

function OnUse(nItem)
	if gf_Judge_Room_Weight(3,10,"") ~= 1 then
		return 0;
	end
	local g,d,p	= getItemGDP(nItem);
	if DelItem(g,d,p, 1) == 1 then
		gl_aw_giveAward()
	end
end

function nothing()
end

