
Include("\\script\\lib\\globalfunctions.lua")

tTab = {
	{2, 95, 1166, "迷你石猴", "玄天顽石", "召唤一只迷你石猴跟宠，点击一次招出跟宠，再次点击跟宠消失"},
	{2, 95, 1223, "飞信鹰", "信羽", "使用可召唤飞信金鹰，再次使用跟宠消失。"},
	{2, 96, 107, "小雪人", "小雪人", "冰冰凉的大雪球，随时能用它搭出一个小雪人跟随着你。"},
	{2, 95, 1236, "迷你红印教主", "红印教主", "使用可召唤迷你红印教主，再次使用跟宠消失。"},
	{2, 93, 63, "墨蹄6", "小墨蹄", "吹响你的墨染银驹笛，召唤你的的小墨蹄。"},
	{2, 111, 200, "雕", "雕", "使用可召唤雕跟随，再次使用跟宠消失。"},
	{2, 111, 36, "小雪狐雪色", "小雪狐雪色", "可召唤具有灵性的天山雪狐雪色，只跟随风姿卓绝之主。"},
	{2, 111, 37, "小雪狐真火", "小雪狐真火", "可召唤具有灵性的天山雪狐真火，只跟随风姿卓绝之主。"},
	{2, 111, 38, "小雪狐玄石", "小雪狐玄石", "可召唤具有灵性的天山雪狐玄石，只跟随风姿卓绝之主。"},
	{2, 111, 43, "金蛇送福", "金蛇", "金蛇送福到我家。"},
	{2, 111, 44, "独角兽", "独角兽", "传为古神兽，有吉兆。"},
	{2, 111, 87, "红鞍小熊猫", "红鞍小熊猫", "一只迷路的小熊猫，似乎在找它的妈妈。"},
	{2, 111, 88, "蓝鞍小熊猫", "蓝鞍小熊猫", "一只迷路的小熊猫，似乎在找它的妈妈。"},
	{2, 111, 89, "绿鞍小熊猫", "绿鞍小熊猫", "一只迷路的小熊猫，似乎在找它的妈妈。"},
	{2, 111, 90, "黄鞍小熊猫", "黄鞍小熊猫", "一只迷路的小熊猫，似乎在找它的妈妈。"},
	{2, 111, 95, "刺猬球球", "刺猬球球", "召唤刺猬球球，注：谨慎饲养，如果你抢了它的苹果，它会把你戳成另一只刺猬。"},
	{2, 131, 53, "天工小木人", "小木人", "小型木质人形跟宠"},
	{2, 131, 54, "天工木人", "木头人", "木质人形跟宠"},
	{2, 131, 55, "天工大木人", "大木人", "大型木质人形跟宠"},
	{2, 131, 56, "天工小铜人", "小铜人", "小型铜质人形跟宠"},
	{2, 131, 57, "天工铜人", "机关铜人", "铜质机械人形跟宠"},
	{2, 131, 58, "天工大铜人", "大铜人", "大型铜质人形跟宠"},
	{2, 111, 112, "白羊小小咩", "白羊小小咩", "白羊小咩和白羊小黑的孩子白羊小小咩，不爱说话爱吃草。"},
	{2, 111, 113, "鬼影重重", "鬼火磷石", "神秘诡谲的蓝色磷石，散发着幽深的光，好像诱惑人去点燃它……会召唤出不属于这个人世间的东西么？"},
	{2, 111, 164, "白羊小小黑", "白羊小小黑", "白羊小咩和白羊小黑的孩子白羊小小黑，傲娇腹黑爱洗澡。"},
	{2, 102, 7, "武侠鸡", "武侠鸡", "使用可召唤武侠鸡，再次使用跟宠消失。"},
	{2, 95, 172, "小驯鹿", "小驯鹿", "召唤一只小驯鹿跟宠，点击一次招出跟宠，再次点击跟宠消失"},
	{2, 95, 173, "小金牛", "小金牛", "召唤一只金牛跟宠，点击一次招出跟宠，再次点击跟宠消失"},
	{2, 95, 821, "小浣熊", "小浣熊", "召唤一只小浣熊跟宠，点击一次招出跟宠，再次点击跟宠消失"},
	{2, 95, 866, "跟随吉祥玉兔", "吉祥玉兔", "使用可召唤一只吉祥玉兔跟宠，再次使用跟宠消失。"},
	{2, 95, 867, "跟随玲珑小白熊", "玲珑小白熊", "使用可召唤一只小白熊跟宠，再次使用跟宠消失。"},
	{2, 95, 868, "跟随吉祥小白虎", "吉祥小白虎", "使用可召唤一只小白虎跟宠，再次使用跟宠消失。"},
	{2, 95, 869, "跟随玉麒麟2", "玉麒麟", "使用可召唤一只玉麒麟跟宠，再次使用跟宠消失。"},
	{2, 95, 870, "跟随小素仙", "小素仙", "使用可召唤小素仙跟宠，再次使用跟宠消失。"},
	{2, 95, 871, "跟随小花圣", "小花圣", "使用可召唤小花圣跟宠，再次使用跟宠消失。"},
	{2, 97, 32, "跟随小牦牛", "小牦牛", "使用可召唤可爱的小牦牛跟宠，再次使用跟宠消失。"},
	{2, 95, 1316, "跟随小神龙", "小神龙", "使用可召唤如意小神龙，再次使用跟宠消失。"},
	{2, 95, 1317, "跟随小火凤", "小火凤", "使用可召唤如意小火凤，再次使用跟宠消失。"},
	{2, 95, 1319, "跟随小白虎", "小白虎", "使用可召唤如意小白虎，再次使用跟宠消失。"},
	{2, 93, 63, "墨蹄6", "小墨蹄", "右键点击吹响你的墨染银驹笛，召唤你的的小墨蹄。"},
	{2, 95, 1403, "唐门任侠跟宠", "唐门任侠小伙伴", "使用放出或收起你的唐门任侠小伙伴"},
	{2, 95, 1404, "昆仑剑尊跟宠", "昆仑剑尊小伙伴", "使用放出或收起你的昆仑剑尊小伙伴"},
	{2, 95, 1295, "活动小神兽辟邪", "神兽辟邪", "使用可召唤一只辟邪跟宠，再次使用跟宠消失。"},
	{2, 95, 1495, "小神兽辟邪（碧玉）", "碧玉", "使用可召唤一只碧玉辟邪跟宠，再次使用跟宠消失。"},
	{2, 95, 1496, "小神兽辟邪（白碧玉）", "白碧玉", "使用可召唤一只白玉辟邪跟宠，再次使用跟宠消失。"},
	{2, 95, 1497, "小神兽辟邪（墨玉）", "墨玉", "使用可召唤一只墨玉辟邪跟宠，再次使用跟宠消失。"},
	{2, 95, 3252, "小伙伴剑魔", "迷你剑魔", "使用可召唤迷你剑魔，再次使用跟宠消失。"},
	{2, 95, 3253, "小伙伴盟主", "迷你绿林盟主", "使用可召唤迷你绿林盟主，再次使用跟宠消失。"},
	{2, 95, 3254, "小伙伴枪神", "迷你枪神", "使用可召唤迷你枪神，再次使用跟宠消失。"},
	{2, 95, 3255, "小伙伴冷姐姐", "迷你冷香菱", "使用可召唤迷你冷香菱，再次使用跟宠消失。"},
	{2, 95, 3551, "迷你苏依依", "迷你苏依依", "苏依依佩戴的头饰，使用可以召唤出迷你苏依依跟宠，再次使用跟宠消失。"},
	{2, 95, 3588, "迷你鬼王", "迷你鬼王", "使用可以召唤出鬼王跟宠，再次使用跟宠消失。"},
	{2, 95, 3632, "娃娃杀手", "桃花杀手", "使用可以召唤出桃花杀手跟宠，再次使用跟宠消失。"},
	{2, 95, 3766, "灵猴", "灵猴", "使用可以召唤出灵猴跟宠，再次使用跟宠消失。"},
	{2, 95, 3918, "萌企鹅", "萌企鹅", "一尾美味的鲜鱼，使用可以引诱出爱吃鱼的小企鹅，再次使用跟宠消失。"},
	{2, 95, 4551, "武林小侠", "武林小侠", "一把拥有灵气的剑，使用可以召唤出武林小侠，再次使用跟宠消失。"},
	{2, 95, 4552, "小白公猪", "小白猪", "一只小白猪，使用可以召唤出小白猪，再次使用跟宠消失。"},
	{2, 95, 4553, "小白母猪", "小母猪", "一只小白猪，使用可以召唤出小白猪，再次使用跟宠消失。"},
	{2, 95, 4554, "小黑公猪", "小黑猪", "一只小黑猪，使用可以召唤出小黑猪，再次使用跟宠消失。"},
	{2, 95, 4555, "小黑母猪", "小黑猪", "一只小黑猪，使用可以召唤出小黑猪，再次使用跟宠消失。"},
	{2, 95, 4556, "小金公猪", "小金猪", "一只小金猪，使用可以召唤出小金猪，再次使用跟宠消失。"},
	{2, 95, 4557, "小金母猪", "小金猪", "一只小金猪，使用可以召唤出小金猪，再次使用跟宠消失。"},
	{2, 95, 5855, "月兔", "小兔兔", "兔兔这么可爱怎么可以吃呢？还是吃个胡萝卜吧！"},
	{2, 97, 227, "跟随白羊驼", "白羊驼", "使用放出或收起你的羊驼小伙伴"},
	{2, 97, 228, "跟随黑羊驼", "黑羊驼", "使用放出或收起你的羊驼小伙伴"},
	{2, 97, 229, "跟随灰羊驼", "灰羊驼", "使用放出或收起你的羊驼小伙伴"},
	{2, 97, 230, "跟随乳白羊驼", "乳白羊驼", "使用放出或收起你的羊驼小伙伴"},
}

function OnUse(idx)
	local nItemIndex = tonumber(idx)
	local nGenre, nDetail, nParticular = GetItemInfoByIndex(nItemIndex)
	local nTabIndex = 0
	for index, value in tTab do
		if value[1] == nGenre and value[2] == nDetail and value[3] == nParticular then
			nTabIndex = index
			break
		end
	end
	
	if nTabIndex == 0 then
		return
	end
	local sItemName, g, d, p = get_item_info(nItemIndex)
	
	npcmodel = tTab[nTabIndex][4]
	npcname = tTab[nTabIndex][5]
	dialog = tTab[nTabIndex][6] or ""

	local itemname = "<color=green>"..sItemName.."<color>："
	local szMsg = ""
	if GetFollower() ~= 0 then
		szMsg = "\n<color=red>提示：您已跟随的有跟宠了，收回后才能再次召唤<color>。"
	end
	local szTitle = itemname..dialog..szMsg
	local tbOpt = {}
		if GetFollower() ~= 0 then	--如果身后有跟随NPC，先确认删除
			tinsert(tbOpt, {"我要收回跟宠", recall_follow_pet, {PlayerIndex}})
		else
			tinsert(tbOpt, {"我要召唤跟宠", call_follow_pet, {PlayerIndex, nItemIndex, npcmodel, npcname}})
		end
		tinsert(tbOpt, {"结束对话", nothing})
	CreateNewSayEx(szTitle, tbOpt)
end

function recall_follow_pet(nPlayerIndex)
	PlayerIndex = nPlayerIndex
	KillFollower();
end;

function call_follow_pet(nPlayerIndex, nItemIndex, npcmodel, npcname)
	PlayerIndex = nPlayerIndex
	local sItemName, g, d, p = get_item_info(nItemIndex)
	
--	if (DelItem(g, d, p, 1) == 1) then
		-- 使用替身娃娃
		local npc = SummonNpc(npcmodel, npcname)
		WriteLog("[跟宠]:"..GetName().."使用"..sItemName.."召唤一个跟宠");
--	end;
end;

function get_item_info(nItemIndex)
	local nItemId1,nItemId2,nItemId3 = GetItemInfoByIndex(nItemIndex)
	local sItemName = GetItemName(nItemId1,nItemId2,nItemId3)
	return sItemName,nItemId1,nItemId2,nItemId3
end

function nothing()
end;
