
function OnUse(nItemIndex)
   local G, D, P = GetItemInfoByIndex(nItemIndex)
        if (DelItem(G, D, P , 1) == 1) then
			for i=1,1 do
				m = random(1,getn(follow_monkey));
				AddItem(follow_monkey[m][1],follow_monkey[m][2],follow_monkey[m][3],1,4);
            end;

        end

end

follow_monkey = {
{2,95,172},--驯鹿棒
{2,95,173},--酒仙草
{2,95,821},--浣熊果
{2,95,866},--精致的胡萝卜
{2,95,867},--诱人的蜂蜜
{2,95,868},--美味的鲜肉
{2,95,869},--如意金印
{2,95,870},--素仙玉佩
{2,95,871},--花圣玉佩
{2,95,873},--酒仙草[限时]
{2,95,874},--驯鹿棒[限时]
{2,95,875},--精致的胡萝卜[限时]
{2,95,876},--诱人的蜂蜜[限时]
{2,95,877},--美味的鲜肉[限时]
{2,95,878},--如意金印[限时]
{2,95,879},--素仙玉佩[限时]
{2,95,880},--花圣玉佩[限时]
{2,95,1166},--玄天顽石
{2,97,32},--奇异草
{2,95,1223},--信羽
{2,96,107},--冰凉的小雪球
{2,95,1236},--教主金令
{2,95,1295},--辟邪金印
{2,95,1316},--神龙珠
{2,95,1317},--凤凰羽
{2,95,1319},--白虎笛
{2,93,63},--墨染银驹笛
{2,95,1403},--唐门任侠小伙伴
{2,95,1404},--昆仑剑尊小伙伴
{2,95,1495},--碧玉辟邪金印
{2,95,1496},--白玉辟邪金印
{2,95,1497},--墨玉辟邪金印
{2,95,2184},--碧玉辟邪金印(活动)
{2,95,2185},--墨玉辟邪金印(活动)
{2,95,3252},--小伙伴金令（剑魔）
{2,95,3253},--小伙伴金令（盟主）
{2,95,3254},--小伙伴金令（枪神）
{2,95,3255},--小伙伴金令（冷姐姐）
{2,95,3551},--苏依依的蝴蝶头饰
{2,95,3588},--鬼王幡
{2,95,3632},--迷你桃花枝
{2,95,3766},--诱人的大香蕉
{2,95,3918},--美味的鲜鱼
{2,95,4551},--武林小侠
{2,95,4552},--小白母猪
{2,95,4553},--小白公猪
{2,95,4554},--小黑母猪
{2,95,4555},--小黑公猪
{2,95,4556},--小金母猪
{2,95,4557},--小金公猪
{2,95,5855},--小兔兔
{2,97,227},--白羊驼
{2,97,228},--黑羊驼
{2,97,229},--灰羊驼
{2,97,230},--乳白羊驼
{2,111,200},--雕
{2,111,36},--小雪狐雪色
{2,111,37},--小雪狐真火
{2,111,38},--小雪狐玄石
{2,111,43},--金蛇送福
{2,111,44},--独角兽
{2,111,87},--红鞍小熊猫
{2,111,88},--蓝鞍小熊猫
{2,111,89},--绿鞍小熊猫
{2,111,90},--黄鞍小熊猫
{2,111,95},--刺猬球球
{2,131,53},--小木人
{2,131,54},--木头人
{2,131,55},--大木人
{2,131,56},--小铜人
{2,131,57},--机关铜人
{2,131,58},--大铜人
{2,111,112},--白羊小小咩
{2,111,113},--鬼火磷石
{2,111,164},--白羊小小黑
{2,102,7},--武侠鸡
	}
