-- ====================== 文件信息 ======================
-- 剑侠情缘onlineII 一换一公共使用文件
-- 文件名：various_item_bag.lua
-- Edited by 
-- 2020/04/02 PM 18:32
-- ======================================================
tItemInfo =
{
	{2, 95, 2025, "消劫散", 2, 0, 141},
	{2, 95, 2026, "修真要诀", 2, 0, 554},
	{2, 95, 2027, "大修真要诀", 2, 95, 585},
	{2, 95, 2028, "强效修身丸", 2, 95, 224},
	{2, 95, 2029, "紫光密宝", 2, 0, 761},
	{2, 95, 2030, "磐龙璧", 2, 1, 1000},
	{2, 95, 2031, "五行玉", 2, 97, 202},
	{2, 95, 2032, "替身符", 2, 0, 556},
	{2, 103, 228, "生活手札", 2, 19, 1},
	{2, 95, 2135, "和氏璧", 2, 1, 1001},
	{2, 95, 5463, "般若树种", 2, 0, 398},
	{2, 95, 5464, "小般若树种", 2, 0, 504},	
	{2, 95, 5487, "强化精石（1级）", 2, 101, 2},
	{2, 95, 5488, "强化精石（2级）", 2, 101, 3},
	{2, 95, 5489, "强化精石（3级）", 2, 101, 4},
	{2, 95, 5490, "强化精石（4级）", 2, 101, 5},
	{2, 95, 5491, "强化精石（5级）", 2, 101, 6},
	{2, 95, 5492, "强化精石（6级）", 2, 101, 7},
	{2, 95, 5493, "强化精石（7级）", 2, 101, 8},
	{2, 95, 5494, "强化精石（8级）", 2, 101, 9},
	{2, 95, 5495, "强化精石（9级）", 2, 101, 10},
	{2, 95, 5496, "强化精石（10级）", 2, 101, 11},
	{2, 95, 5497, "强化精石（11级）", 2, 101, 12},
	{2, 95, 5498, "强化精石（12级）", 2, 101, 13},
	{2, 95, 5499, "强化精石（13级）", 2, 101, 14},
	{2, 95, 5500, "强化精石（14级）", 2, 101, 15},
	{2, 95, 5502, "披风令强化精石(1级)", 2, 114, 62},
	{2, 95, 5503, "披风令强化精石(2级)", 2, 114, 63},
	{2, 95, 5504, "披风令强化精石(3级)", 2, 114, 64},
	{2, 95, 5505, "披风令强化精石(4级)", 2, 114, 65},
	{2, 95, 5506, "披风令强化精石(5级)", 2, 114, 66},
	{2, 95, 5507, "披风令强化精石(6级)", 2, 114, 67},
	{2, 95, 5508, "披风令强化精石(7级)", 2, 114, 68},
	{2, 95, 5509, "披风令强化精石(8级)", 2, 114, 69},
	{2, 95, 5510, "披风令强化精石(9级)", 2, 114, 70},
	{2, 95, 5511, "披风令强化精石(10级)", 2, 114, 71},
	{2, 95, 5512, "披风令强化精石(11级)", 2, 114, 72},
	{2, 95, 5513, "披风令强化精石(12级)", 2, 114, 73},
	{2, 95, 5514, "披风令强化精石(13级)", 2, 114, 74},
	{2, 95, 5515, "披风令强化精石(14级)", 2, 114, 75},
}

function OnUse(nidx)
	local nItemIndex = tonumber(nidx)
	local nGenre, nDetail, nParticular = GetItemInfoByIndex(nItemIndex)
	for index, value in tItemInfo do
		if value[1] == nGenre and value[2] == nDetail and value[3] == nParticular then
			various_to_item(index)
			break
		end
	end
end

function various_to_item(nItem)
	if DelItem(tItemInfo[nItem][1], tItemInfo[nItem][2], tItemInfo[nItem][3], 1) == 1 then
		local nRet =  AddItem(tItemInfo[nItem][5], tItemInfo[nItem][6], tItemInfo[nItem][7], 1)
		if nRet == 1 then
			Msg2Player("你获得了["..tItemInfo[nItem][4].."]×1")
			return 0
		else	-- 如果有错误没有给出来，补偿一个包
			AddItem(tItemInfo[nItem][1], tItemInfo[nItem][2], tItemInfo[nItem][3], 1)
			return 0
		end
	end
end