--养diao指南
--by vivi
--2009-04-09

g_NpcName = "<color=green>养貂指商<color>："

function OnUse()
	local strtab = {
		"喂饱小绍的秘诀/yangdiao_talk_1",
		"训练一只聪明的小貂/yangdiao_talk_2",
		"让小貂学会一种特殊技能/yangdiao_talk_3",
		"不看了/nothing"
	};
	Say(g_NpcName.."这是一本记载了紧烟门弟子养绍心得的书籍，看过之后会有很大收获。",
		getn(strtab),
		strtab)
end

function yangdiao_talk_1()
	Talk(1,"OnUse",g_NpcName.."貂的饥饿度会影响它的攻击力，貂越饥饿，那么攻击力越低。同时主人也会因为绍过于饥饿而无心战斗，攻击力下降。喂饱小绍可以按照下面这么做：\n    1.到翠烟师门商人何谐处购买红山果或桂花鱼\n    2. 使用武功“喂养小绍”\n    3. 右键点击小绍，然后点击包袱里的红山果或者桂花鱼\n    4. 如果没吃饱请重复步骤2和3，直到貂吃饱");
end

function yangdiao_talk_2()
	Talk(1,"OnUse",g_NpcName.."貂的灵性会随着貂的训练等级提升而增加。灵性可以提高貂的武功施展速度和攻击力。绍每次升级灵性会有一定概率增加。训练小留需要训练笛和蜜果。每增加1点训练点数，主人就需要奖励小绍一个蜜果，蜜果不能增加留的饥饿度。如果貂很饿，则会停止训练。训练小绍可以按照下面这么做：\n    1. 到翠烟师门商人何谐处购买一只训练笛和足够的蜜果\n    2. 使用训练笛，开始训练\n    3. 如果训练终止，那么可能是没有蜜果或者小貂饿了");	
end

function yangdiao_talk_3()
	Talk(1,"OnUse",g_NpcName.."貂可以通过吃特定食物来学会一种特殊技能，这个特殊技能可以通过主人的武功“百花心经”来让貂施展。貂后来学习的技能会覆盖掉之前的。留学习技能可以按照下面这么做：\n    1. 到翠烟师门商人何谐处购买朝天椒、清京草、天香花中的某一个\n    直接右键使用所购买的食物\n    小绍学会了对应的特殊技能\n    主人在战斗中使用百花心经来命令小貂使用该技能");
end

function nothing()

end