-- ====================== 文件信息 ====================== 
                                                          
-- 剑侠情缘onlineII 赞助大礼包               
-- Edited by 葫芦娃救爷爷                                                                                      
-- ======================================================
Include("\\script\\lib\\globalfunctions.lua");
Include("\\script\\class\\clause3.lua");
--任务变量
function OnUse()
	if DelItem(2, 95, 18343, 1) == 1 then --如果删除
       tAllAward[1]:giveClause();
    end;
end;

tAllAward = {
	[1] = {--白嫖盲盒随机概率(ok)
		maxRand = 10000,
		subclauses = {
	        {{"天卦石", {2,0,1084,1,4}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 20},			
			{{"天罡令", {2,95,204,1,4}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 20},		
			{{"九转还魂丹", {1,0,32,1,1}, }, 1500},		
			{{"冰魄寒光剑", {0,105,241,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},			
			{{"太清无尘剑", {0,105,10111,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},		
			{{"昆虚璎琅剑", {0,105,219,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},			
			{{"文史琼珂剑", {0,105,220,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},
			{{"太清无垢剑", {0,105,221,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},
			{{"长风白霜剑", {0,105,209,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},
			{{"少阳琅玕剑", {0,105,222,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},
			{{"龙渊回翔剑", {0,105,197,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},
			{{"昆虚玉瑶剑", {0,105,10109,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},
			{{"绛云赤霄剑", {0,105,180,1,4,-1,-1,-1,-1,-1,-1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 4},
			{{"极品称号兑换卷", {2,95,18340,1,1}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 20},		
	        {{"和氏璧", {2,1,1001,1,4}, "恭喜[$n]在<vip赞助礼包>中，获得$i"}, 30},	
			{{"陨铁精石", {2,1,1009,5,4}, }, 1000},
			{{"陨铁", {2,2,8,20,4}, }, 2000},		
			{{"陨铁碎片", {2,2,7,20,4}, }, 2000},
			{{"大军功章", {2,1,9998,1,4}, }, 1000},			
			{{"军功章", {2,1,9999,1,4}, }, 1500},
			{{"辉煌军功章", {2,1,9977,1,4}, }, 70},
			{{"天骄令", {2,97,236,10,4}, }, 800},

		},
		giveClause = ClauseRandom.giveClause,
	},
	

};






























