Include("\\script\\lib\\globalfunctions.lua")

function OnUse(nItem)
	if GetFreeItemRoom() < 1 then
		Talk(1,"","未入门派不能开启 ");
		return 0;
	end
	local tAward = {
		{1,  20, "五行天仪(凡)", {0, 154, 3, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  20, "五行天仪(普)", {0, 154, 5, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "五行天仪(极)", {0, 154, 6, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "五行天仪(神)", {0, 154, 7, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  5, "天使①人皇天仪", {0, 154, 30, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  5, "天使②人皇天仪", {0, 154, 31, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
	}
	if DelItemByIndex(nItem, 1) == 1 then
		gf_EventGiveRandAward(tAward, gf_SumRandBase(tAward), 1, "22222", "Dng th祅h trang b?");
	end
end