
Include("\\script\\lib\\globalfunctions.lua");

TB_BOOK_LIST = {
	[2] = {{"金刚伏魔经", 0, 107, 1, 50, },{"金刚伏魔心法", 0, 107, 2, 75, },{"金刚般若经", 0, 107, 166, 125, }},
	[3] = {{"无尘秘籍", 0, 107, 5, 50, },{"无尘心法", 0, 107, 6, 75, },{"无尘菩提经", 0, 107, 168, 125, }},
	[4] = {{"潜龙秘籍", 0, 107, 3, 50, },{"潜龙心法", 0, 107, 4, 75, },	{"潜龙寂灭经", 0, 107, 167, 125, }},
	[6] = {{"天罗秘籍", 0, 107, 7, 50, },{"天罗心法", 0, 107, 8, 75, },{"天罗连珠录", 0, 107, 169, 125, }},
	[8] = {{"如意秘籍", 0, 107, 9, 50, },{"如意心法", 0, 107, 10, 75, },{"如意金顶秘籍", 0, 107, 170, 125, }},
	[9] = {{"碧海谱", 0, 107, 11, 50, },{"碧海心法", 0, 107, 12, 75, },{"碧海绝音谱", 0, 107, 171, 125, }},
	[11] = {{"混沌秘籍", 0, 107, 13, 50, },{"混沌心法", 0, 107, 14, 75, },{"混沌镇岳秘籍", 0, 107, 172, 125, }},
	[12] = {{"揆天秘籍", 0, 107, 15, 50, },{"揆天心法", 0, 107, 16, 75, },{"揆天游龙秘籍", 0, 107, 173, 125, }},
	[14] = {{"幻影秘籍", 0, 107, 17, 50, },{"幻影心法", 0, 107, 18, 75, },{"幻影迷踪秘籍", 0, 107, 174, 125, }},
	[15] = {{"君子秘籍", 0, 107, 19, 50, },{"君子心法", 0, 107, 20, 75, },{"君子截风秘籍", 0, 107, 175, 125, }},
	[17] = {{"镇军秘籍", 0, 107, 21, 50, },{"镇军心法", 0, 107, 22, 75, },{"镇军飞龙枪谱", 0, 107, 176, 125, }},
	[18] = {{"穿云秘籍", 0, 107, 23, 50, },{"穿云心法", 0, 107, 24, 75, },{"穿云落虹秘籍", 0, 107, 177, 125, }},
	[20] = {{"幽冥鬼录", 0, 107, 25, 50, },{"幽冥心法", 0, 107, 26, 75, },{"幽冥封魔录", 0, 107, 178, 125, }},
	[21] = {{"灵蛊秘籍", 0, 107, 27, 50, },{"灵蛊心法", 0, 107, 28, 75, },{"灵蛊幻邪录", 0, 107, 179, 125, }},
	[23] = {{"惊风秘籍", 0, 107, 180, 50, },{"惊风心法", 0, 107, 181, 75, },{"九天风雷诀", 0, 107, 198, 125, }},
	[25] = {{"回锋秘籍", 0, 107, 182, 50, },{"回锋心法", 0, 107, 183, 75, },{"回锋斩日秘籍", 0, 107, 199, 125, }},
	[26] = {{"负旗秘籍", 0, 107, 184, 50, },{"负旗心法", 0, 107, 185, 75, },{"负旗行阵秘籍", 0, 107, 200, 125, }},
	[27] = {{"凝血秘籍", 0, 107, 186, 50, },{"凝血心法", 0, 107, 187, 75, },{"凝血封魂秘籍", 0, 107, 201, 125, }},
	[29] = {{"醉梦秘籍", 0, 107, 188, 50, },{"醉梦心法", 0, 107, 189, 75, },{"红尘醉梦谱", 0, 107, 202, 125, }},
	[30] = {{"繁花秘籍", 0, 107, 190, 50, },{"繁花心法", 0, 107, 191, 75, },{"风花千叶谱", 0, 107, 203, 125, }},
	[31] = {{"迷踪秘籍", 0, 107, 228, 50, },{"迷踪心法", 0, 107, 229, 75, },{"迷踪侠影录", 0, 107, 230, 150, }},
	[32] = {{"天锋秘籍", 0, 107, 232, 50, },{"天锋心法", 0, 107, 233, 75, },{"天锋定影诀", 0, 107, 234, 150, }},

}

function OnUse(idx)
	local nItemIndex = tonumber(idx)
	local tbRouteTable = {2, 3, 4, 6, 8, 9, 11, 12, 14, 15, 17, 18, 20, 21, 23, 25, 26 , 27, 29, 30, 31, 32};
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nRouteFlag = 0
	if nRoute > 0 then
		for _, ckRoute in tbRouteTable do
			if ckRoute == nRoute then
				nRouteFlag		= 1;	-- Route标识
			end
		end
	end
	if nRouteFlag ~= 1 then
		Talk(1,"","侠士还没加入任何流派，不能使用<color=yellow>秘籍兑换券<color>。");
		return
	end;
	local selTab = {};
	local szTitle = format("<color=green>秘籍兑换券<color>：您是否要消耗一定数量的秘籍兑换券<color>来兑换本流派的秘籍？请选择要兑换的秘籍：")

	for i = 1, getn(TB_BOOK_LIST[nRoute]) do
		local szTlt = TB_BOOK_LIST[nRoute][i][1]
		local nNeed = TB_BOOK_LIST[nRoute][i][5]
		local nGenre, nDetail, nParticular = TB_BOOK_LIST[nRoute][i][2], TB_BOOK_LIST[nRoute][i][3], TB_BOOK_LIST[nRoute][i][4]
		tinsert(selTab, format("换取%s（需要秘籍兑换券×%d）/#do_change_book(%d, %d, %d, %d, %d)", szTlt, nNeed, nItemIndex, nNeed, nGenre, nDetail, nParticular));
	end

	tinsert(selTab,"结束对话/nothing");
	Say(szTitle, getn(selTab), selTab)
end


function do_change_book(nItemIndex, nNeed, nGenre, nDetail, nParticular)
	local name = GetItemName(nGenre, nDetail, nParticular)
	if GetItemCount(2,95,2085) < nNeed then
	 	Talk(1,"", "您的秘籍兑换券不足以兑换"..name.."。")
		return 
	end
	if gf_Judge_Room_Weight(1,10,"") ~= 1 then
		return
	end
	if DelItemByIndex(nItemIndex,nNeed) == 1 then
		AddItem(nGenre, nDetail, nParticular,1,1,-1,-1,-1,-1,-1,-1);
		Msg2Player("您获得了["..name.."]×1");
	end
end;