Include("\\script\\lib\\globalfunctions.lua")

function OnUse(nItem)
	if GetFreeItemRoom() < 1 then
		Talk(1,"","Î´ÈëÃÅÅÉ²»ÄÜ¿ªÆô ");
		return 0;
	end
	local tAward = {
		{1,  20, "»ÔÐÇÖ®½­ºþÁî", {0, 153, 1, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},	
		{1,  20, "ð©ÔÂÖ®¶÷ÒåÁî", {0, 153, 2, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "Ò«ÑôÖ®Í³ÓùÁî", {0, 153, 3, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "ºé»ÄÁî", {0, 153, 4, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "å«Óîºé»ÄÁî", {0, 153, 5, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "¹âÕÑÁÒÎäÁî", {0, 153, 6, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "¶«»Ê·ïÃùÁî", {0, 153, 7, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "ÁúÒþÁî", {0, 153, 8, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "²ÔÎàÁúÒþÁî", {0, 153, 9, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  5, "ÌìÊ¹¢ÙÈË»ÊÁî", {0, 153, 30, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  5, "ÌìÊ¹¢ÚÈË»ÊÁî", {0, 153, 31, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
	}
	if DelItemByIndex(nItem, 1) == 1 then
		gf_EventGiveRandAward(tAward, gf_SumRandBase(tAward), 1, "22222", "D­ìng thµnh trang b?");
	end
end