Include("\\script\\lib\\globalfunctions.lua")

function OnUse(nItem)
	if GetFreeItemRoom() < 1 then
		Talk(1,"","未入门派不能开启 ");
		return 0;
	end
	local tAward = {
		{1,  20, "辉星之皂布披风", {0, 152, 1, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},	
		{1,  20, "皓月之锦缎披风", {0, 152, 2, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "耀阳之火云披风", {0, 152, 3, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "洪荒披风", {0, 152, 4, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "瀚宇洪荒披风", {0, 152, 5, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "光昭烈武披风", {0, 152, 6, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "东皇凤鸣披风", {0, 152, 7, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "龙隐披风", {0, 152, 8, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  10, "苍梧龙隐披风", {0, 152, 9, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  5, "天使①人皇披风", {0, 152, 30, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
		{1,  5, "天使②人皇披风", {0, 152, 31, 1,1,-1,-1,-1,-1,-1,-1,-1,0}, 0},
	}
	if DelItemByIndex(nItem, 1) == 1 then
		gf_EventGiveRandAward(tAward, gf_SumRandBase(tAward), 1, "22222", "Dng th祅h trang b?");
	end
end