-- 2019³ÆºÅ½Å±¾(ÈýÓ¢³ÆºÅ,Ê®É±³ÆºÅ,°ÙÆÆ³ÆºÅ,Ç§¾ü³ÆºÅ,ÍòÓÂ³ÆºÅ,ÎÞË«³ÆºÅ)

Include("\\script\\lib\\title.lua");

tTab =
{
	{2, 95, 40017, "¹úÉ«ÌìÏãÖ÷²¥", 73, 1, 1, 15},--ÖÐÎÄ
	{2, 95, 40018, "½£Îè½­ºþÖ÷²¥", 73, 2, 1, 15},--ÖÐÎÄ
	{2, 95, 40019, "ÂÛÌ³¾Þ½³", 73, 3, 1, 15},--ÖÐÎÄ
	{2, 95, 40020, "ÎÄÐÄµñÁú", 73, 4, 1, 15},--ÖÐÎÄ
	{2, 95, 40021, "Ôç±¨ÃûËÞ", 73, 5, 1, 15},--ÖÐÎÄ
	{2, 95, 40022, "Î÷É½ÂÛ½£", 73, 6, 1, 15},--ÖÐÎÄ
	{2, 95, 40023, "ÈËÐÛ-ÃûÕð½­ºþ", 20, 1, 1, 15},	--ÖÐÎÄ	
	{2, 95, 40024, "Ê®ÄêÒ»½£±ù", 3, 81, 1, 15},	--ÖÐÎÄ	
	{2, 95, 40025, "Ê®ÄêÒ»½£»ð", 3, 83, 1, 15},	--ÖÐÎÄ	
	{2, 95, 40026, "¸Ð¶÷Ò»¼Í", 3, 85, 1, 15},	--ÖÐÎÄ	
	{2, 95, 40100, "³ÆºÅ",  99, 1, 1, 700},
	{2, 95, 40101, "³ÆºÅ",  99, 2, 1, 700},
	{2, 95, 40102, "³ÆºÅ",  99, 3, 1, 700},
	{2, 95, 40103, "³ÆºÅ",  99, 4, 1, 700},
	{2, 95, 40104, "³ÆºÅ",  99, 5, 1, 15},
	{2, 95, 40105, "³ÆºÅ",  99, 6, 1, 700},
	{2, 95, 40106, "³ÆºÅ",  99, 7, 1, 700},
	{2, 95, 40107, "³ÆºÅ",  99, 8, 1, 700},
	{2, 95, 40108, "³ÆºÅ",  99, 9, 1, 700},
	{2, 95, 40109, "³ÆºÅ",  99, 10, 1, 700},
	{2, 95, 40110, "³ÆºÅ",  99, 11, 1, 700},
	{2, 95, 40111, "³ÆºÅ",  99, 12, 1, 700},
	{2, 95, 40112, "³ÆºÅ",  99, 13, 1, 700},
	{2, 95, 40113, "³ÆºÅ",  99, 14, 1, 700},
	{2, 95, 40114, "³ÆºÅ",  99, 15, 1, 700},
	{2, 95, 40115, "³ÆºÅ",  99, 16, 1, 700},
	{2, 95, 40116, "³ÆºÅ",  99, 17, 1, 700},
	{2, 95, 40117, "³ÆºÅ",  99, 18, 1, 700},
	{2, 95, 40118, "³ÆºÅ",  99, 19, 1, 700},
	{2, 95, 40119, "³ÆºÅ",  99, 20, 1, 700},
	{2, 95, 40120, "³ÆºÅ",  99, 21, 1, 700},
	{2, 95, 40121, "³ÆºÅ",  99, 22, 1, 700},
	{2, 95, 40122, "³ÆºÅ",  99, 23, 1, 700},
	{2, 95, 40123, "³ÆºÅ",  99, 24, 1, 700},
	{2, 95, 40124, "³ÆºÅ",  99, 25, 1, 700},
	{2, 95, 40125, "³ÆºÅ",  99, 26, 1, 700},
	{2, 95, 40126, "³ÆºÅ",  99, 27, 1, 700},
	{2, 95, 40127, "³ÆºÅ",  99, 28, 1, 700},
	{2, 95, 40128, "³ÆºÅ",  99, 29, 1, 700},
	{2, 95, 40129, "³ÆºÅ",  99, 30, 1, 700},
	{2, 95, 40130, "³ÆºÅ",  99, 31, 1, 700},
	{2, 95, 40131, "³ÆºÅ",  99, 32, 1, 700},
	{2, 95, 40132, "³ÆºÅ",  99, 33, 1, 700},

	{2, 95, 40133, "³ÆºÅ",  99, 34, 1, 700},
	{2, 95, 40134, "³ÆºÅ",  99, 35, 1, 700},
	{2, 95, 40135, "³ÆºÅ",  99, 36, 1, 700},
	{2, 95, 40136, "³ÆºÅ",  99, 37, 1, 700},
	{2, 95, 40137, "³ÆºÅ",  99, 38, 1, 700},
	{2, 95, 40138, "³ÆºÅ",  99, 39, 1, 700},
	{2, 95, 40139, "³ÆºÅ",  99, 40, 1, 700},
	{2, 95, 40140, "³ÆºÅ",  99, 41, 1, 700},
	{2, 95, 40141, "³ÆºÅ",  99, 42, 1, 700},




}

function OnUse(nItemIndex)
	local sItemName, G, D, P = get_item_info(nItemIndex)
	local nTabIndex = 0
	for index, value in tTab do
		if value[1] == G and value[2] == D and value[3] == P then
			nTabIndex = index
			break
		end
	end
	
	if nTabIndex == 0 then
		return
	end
	local nGenre, nDetail, nTypeTime, nTime
	nGenre = tTab[nTabIndex][5]
	nDetail = tTab[nTabIndex][6]
	nTypeTime = tTab[nTabIndex][7]
	nTime = tTab[nTabIndex][8]
	do_receive_title(nItemIndex, nGenre, nDetail, nTypeTime, nTime)
end


function do_receive_title(nItemIndex, nGenre, nDetail, nTypeTime, nTime)
	local _, G, D, P = get_item_info(nItemIndex)
	if DelItem(G, D, P, 1) == 1 then
		gf_AddTitle(nGenre, nDetail, nTypeTime, nTime)
	end
end

function get_item_info(nItemIndex)
	local nItemId1,nItemId2,nItemId3 = GetItemInfoByIndex(nItemIndex)
	local sItemName = GetItemName(nItemId1,nItemId2,nItemId3)
	return sItemName,nItemId1,nItemId2,nItemId3
end
