
function OnUse()
	Say("<color=green>                                        蛊经<color>                                          本门弟子须熟读之，严禁私自外传，违者尽废武功逐出师门。                                                                                                     ——白面郎君",5,"第一章 概论/gailun","第二章 蛊术/gushu","第三章 蛊母/gumu","第四章 蛊/gu","收起/no")
end

function gailun()
	Say("    我脉武功精华尽在蛊母之中，只要悉心饲养配合内力调剂，则所生毒虫能为我所驱，配合独门下蛊手法，敌纵有百年功力也无可奈何。",5,"第二章 蛊术/gushu","第三章 蛊母/gumu","第四章 蛊/gu","往前翻/OnUse","收起/no")
end

function gushu()
	Say("    除“狂风爪”外，我脉其他武功皆为蛊术，现细述之：",6,"◆蛊术分类/gushufenlei","◆蛊母喂养和蛊生产/gumuweiyang","◆蛊之吞噬/tunshi","◆蛊之激活/jihuo","往前翻/OnUse","收起/no")
end

function gumu()
	Say("蛊母乃我脉武功之所系，万蛊之源，现细述之：",7,"◆食物/shiwu","◆寿命/shouming","◆饥饿/jie","◆毒血灵魔四性/duxuelingmo","◆称号/chenghao","往前翻/OnUse","收起/no")
end

function gu()
	Say("无蛊则无蛊术，天下蛊甚多也，现细述之：",4,"◆分类/gufenlei","◆蛊生产条件/shengchantiaojian","往前翻/OnUse","收起/no")
end

function gushufenlei()
	Say("◇蛊术从大类上有两部分：<color=>蛊母喂养部分 蛊术部分<color>                                          ◇蛊术从效果上分为：<color=>攻击蛊 防御蛊 特殊攻击蛊 特殊防御蛊<color>                                ◇从性情上分为：<color=green>毒系 <color=red>血系 <color=>灵系 <color=>魔系<color>",5,"◆蛊母喂养和蛊生产/gumuweiyang","◆蛊之吞噬/tunshi","◆蛊之激活/jihuo","往前翻/gushu","收起/no")
end

function gumuweiyang()
	Say("蛊母喂养是指给蛊母喂食各种物品，改变蛊母能力，<color=green>首先必须在身上装配一只蛊母<color>：             ◇使用技能“喂养蛊母”则开始喂养，此时用鼠标点取物品栏里的物品，便将该物品喂给蛊母，同时蛊母能力改变                                                                         ◇使用技能“产蛊”，蛊母则开始生产小蛊，每次生产，会根据小蛊的不同对蛊母能力进行修正                                                                                          ◇技能“养蛊秘术”可以制作特殊的蛊母食物，用来改变鬼",5,"◆蛊术分类/gushufenlei","◆蛊之吞噬/tunshi","◆蛊之激活/jihuo","往前翻/gushu","收起/no")
end

function tunshi()
	Say("蛊吞噬是指攻击蛊、防御蛊会根据蛊的性情消除其他蛊效果：                                 ◇攻击蛊吞噬：当攻击蛊被施放给敌人时，会和他身上已有的攻击蛊发生吞噬。吞噬顺序：毒→血→灵→魔→毒。例如，敌人身上已经被施放了毒蛊，这时你再施放血蛊给他，那么毒蛊的效果就被血蛊吞噬。吞噬是有先后顺序的。如果先放血蛊，再放毒蛊，血蛊就无法吞噬毒蛊。            ◇防御蛊吞噬：角色身上只能有一种防御蛊，后加上的防御蛊会吞噬已有的。                   ◇特殊蛊吞噬：特殊攻击蛊和特殊防御蛊不会互相吞噬，可以共存。",5,"◆蛊术分类/gushufenlei","◆蛊母喂养和蛊生产/gumuweiyang","◆蛊之激活/jihuo","往前翻/gushu","收起/no")
end

function jihuo()
	Say("蛊激活是指当<color=green>敌人被施有三种攻击蛊时<color>，可以激活蛊的组合效果：                            ◇特殊攻击蛊：施放特殊攻击蛊给敌人，会给敌人激活高级攻击属性，同时三种攻击蛊清除。     ◇防御蛊：自己施有防御蛊时，如果被敌人攻击到，会给自己激活高级防御属性，同时三种攻击蛊清除。                                                                                ◇特殊防御蛊：自己施放有防御蛊和特殊防御蛊时，如果被敌人攻击到，则会给自己激活更强大的高级防御属性，同时三种攻击蛊清除。",5,"◆蛊术分类/gushufenlei","◆蛊母喂养和蛊生产/gumuweiyang","◆蛊之吞噬/tunshi","往前翻/gushu","收起/no")
end

function shiwu()
	Say("<color=green>食物是指能够喂养给蛊母的物品<color>：                                                         ◇大部分物品都能作为食物喂养给蛊母，而且会改变蛊母的能力。                             ◇越稀有越高级的物品，其对蛊母能力的影响就越好。                                       ◇技能“养蛊秘术”可以制作数种特殊的食物。",6,"◆寿命/shouming","◆饥饿/jie","◆毒血灵魔四性/duxuelingmo","◆称号/chenghao","往前翻/gumu","收起/no")
end

function shouming()
	Say("<color=green>寿命是蛊母的生命力<color>：                                                                   ◇每次产蛊时，会根据产出小蛊的种类来扣除蛊母一定的寿命值。                             ◇蛊母寿命值到0时，蛊母将死亡。喂养特定的食物可以增加蛊母寿命。                        ◇技能“养蛊秘术”可以制作专门用来增加蛊母寿命的食物，但该类食物会受到蛊母能力的限制，也就是说，蛊母能力强大时，就不再吃低级的食物了。",6,"◆食物/shiwu","◆饥饿/jie","◆毒血灵魔四性/duxuelingmo","◆称号/chenghao","往前翻/gumu","收起/no")
end

function jie()
	Say("<color=green>饥饿是蛊母的活力<color>：                                                                     ◇每次产蛊时，会根据产出小蛊的种类来扣除蛊母一定的饥饿值。                             ◇每过一定时间，也会扣除一定的饥饿值。                                                 ◇饥饿值下降时，会导致蛊母生产小蛊的速度变慢。饥饿值很低时，还会导致蛊母寿命值也慢慢减少，直到蛊母将死亡。                                                                   ◇喂养大部分的食物都可以增加蛊母饥饿。",6,"◆食物/shiwu","◆寿命/shouming","◆毒血灵魔四性/duxuelingmo","◆称号/chenghao","往前翻/gumu","收起/no")
end

function duxuelingmo()
	Say("<color>“毒血灵魔”四性是蛊母能力的反映，它们都有一个最大值和一个当前值：                    ◇“毒血灵魔”最大值：四性的最大值表示蛊母的当前生产能力，只有能力符合的小蛊，才能被生出来。所以最大值越大，就能产出越好的蛊。                                               ◇“毒血灵魔”当前值：四性的当前值表示蛊母生产小蛊的类别。四性当前值的和永远是100，表示蛊母产蛊时的总概率。其中每一性的当前值表示产出该性小蛊的概率。",6,"◆食物/shiwu","◆寿命/shouming","◆饥饿/jie","◆称号/chenghao","往前翻/gumu","收起/no")
end

function chenghao()
	Say("<color>称号是蛊母强弱和当前状态的标志，称号不同的蛊母其样子也会变化：                         ◇由寿命决定的称号：称号中，前一部分是由蛊母的寿命决定的。比如“健康的”、“强壮的”等等，可以反映出蛊母的当前生命力。                                                       ◇由四性最大值决定的称号：称号中，后一部分是由“毒血灵魔”四性的最大值决定的。比如“湛青”、“小血王”等等，可以反映出蛊母当前的生产能力。",6,"◆食物/shiwu","◆寿命/shouming","◆饥饿/jie","◆毒血灵魔四性/duxuelingmo","往前翻/gumu","收起/no")
end

function gufenlei()
	Say("<color>◇小蛊根据蛊母的四性，也分为“毒血灵魔”四类，任何小蛊都归于四类中某一类。             ◇有一个特例是“蛊”，它不属于任何一类，是用来释放基本蛊术比如“疯蛊”技能的。",3,"◆蛊生产条件/shengchantiaojian","往前翻/gu","收起/no")
end

function shengchantiaojian()
	Say("<color>◇小蛊的生产条件是指它能被蛊母生产出来时，所要求的蛊母四性能力的最低额度。比如猛毒蛊，需要蛊母能力：毒性65、血性35、灵性35、魔性35。那么四性能力只要有一项低于该值，蛊母就无法生产出猛毒蛊。",3,"◆分类/gufenlei","往前翻/gu","收起/no")
end

function no()
end