--脚本功能：梁山关卡相关字符串的集合
--功能开发：VV
--功能移植：村长
--移植时间：2011-2-18
--修改记录：

N_JOIN_ENERGY_NEED = 0
N_JOIN_TIANJIAOLING_NEED = 20
N_CALL_BOSS_TIANJIAOLING_NEED = 2
T_TIANJIAOLING = {2,97,236,"天骄令"}
T_NEED_TIANJIAOLING = 300

--npc模板名、显示名信息
NpcName={
	[1] = {"神行太保戴宗","神行太保戴宗"},
	--梁山BOSS-比较多-隔一下
	[2] = {"及时雨宋江","及时雨宋江"},
	[3] = {"小温侯吕方","小温侯吕方"},
	[4] = {"赛仁贵郭盛","赛仁贵郭盛"},
	[5] = {"智多星吴用","智多星吴用"},
	[6] = {"毛头星孔明","毛头星孔明"},
	[7] = {"独火星孔亮","独火星孔亮"},
	[8] = {"九纹龙史进","九纹龙史进"},
	[9] = {"丑郡马宣赞","丑郡马宣赞"},
	[10] = {"井木犴郝思文","井木犴郝思文"},
	[11] = {"小旋风柴进","小旋风柴进"},
	[12] = {"病大虫薛永","病大虫薛永"},
	[13] = {"金眼彪施恩","金眼彪施恩"},
	[14] = {"大刀关胜","大刀关胜"},
	[15] = {"圣水将单廷珪","圣水将单廷珪"},
	[16] = {"神火将魏定国","神火将魏定国"},
	[17] = {"入云龙公孙胜","入云龙公孙胜"},
	[18] = {"神机军师朱武","神机军师朱武"},
	[19] = {"病尉迟孙立","病尉迟孙立"},
	[20] = {"豹子头林冲","豹子头林冲"},
	[21] = {"摩云金翅欧鹏","摩云金翅欧鹏"},
	[22] = {"火眼狻猊邓飞","火眼狻猊邓飞"},
	[23] = {"花和尚鲁智深","花和尚鲁智深"},
	[24] = {"两头蛇解珍","两头蛇解珍"},
	[25] = {"双尾蝎解宝","双尾蝎解宝"},
	[26] = {"行者武松","行者武松"},
	[27] = {"混世魔王樊瑞","混世魔王樊瑞"},
	[28] = {"丧门神鲍旭","丧门神鲍旭"},
	[29] = {"醉半仙风一帆","醉半仙风一帆"},
	[30] = {"陆仁贾","陆仁贾"},
	[31] = {"陆仁义","陆仁义"},
	[32] = {"病关索杨雄","病关索杨雄"},
	[33] = {"小遮拦穆春","小遮拦穆春"},
	[34] = {"打虎将李忠","打虎将李忠"},
	[35] = {"拚命三郎石秀","拚命三郎石秀"},
	[36] = {"独角龙邹润","独角龙邹润"},
	[37] = {"花项虎龚旺","花项虎龚旺"},
	[38] = {"一丈青扈三娘","一丈青扈三娘"},
	[39] = {"矮脚虎王英","矮脚虎王英"},
	[40] = {"神医安道全","神医安道全"},
	[41] = {"双枪将董平","双枪将董平"},
	[42] = {"跳涧虎陈达","跳涧虎陈达"},
	[43] = {"白花蛇杨春","白花蛇杨春"},
	[44] = {"青面兽杨志","青面兽杨志"},
	[45] = {"八臂哪吒项充","八臂哪吒项充"},
	[46] = {"飞天大圣李衮","飞天大圣李衮"},
	[47] = {"霹雳火秦明","霹雳火秦明"},
	[48] = {"锦豹子杨林","锦豹子杨林"},
	[49] = {"小霸王周通","小霸王周通"},
	[50] = {"双鞭呼延灼","双鞭呼延灼"},
	[51] = {"百胜将韩韬","百胜将韩韬"},
	[52] = {"天目将彭玘","天目将彭玘"},
	[53] = {"黑旋风李逵","黑旋风李逵"},
	[54] = {"摸着天杜迁","摸着天杜迁"},
	[55] = {"出林龙邹渊","出林龙邹渊"},
	--过关宝箱
	[56] = {"箱子钱","梁山宝箱"},
	[57] = {"箱子钱","好汉箱子"},
	[58] = {"箱子钱","钱箱子"},
		--Fish Npc信息
	[59] = {"青龙堂帮众","青龙堂帮众"},
	[60] = {"白虎堂帮众","白虎堂帮众"},
	[61] = {"朱雀堂帮众","朱雀堂帮众"},
	[62] = {"玄武堂帮众","玄武堂帮众"},
	--第一关NPC
	[63] = {"能打开的箱子","金箱"},
	[64] = {"能打开的箱子","银箱"},
	[65] = {"能打开的箱子","铜箱"},
	[66] = {"能打开的箱子","铁箱"},
	[67] = {"菜园子张青","菜园子张青"},
	[68] = {"母夜叉孙二娘","母夜叉孙二娘"},
	--第二关NPC
	[69] = {"青龙堂帮众","青龙堂帮众"},
	[70] = {"白虎堂帮众","白虎堂帮众"},
	[71] = {"朱雀堂帮众","朱雀堂帮众"},
	[72] = {"玄武堂帮众","玄武堂帮众"},
	[73] = {"虎王","虎王"},
	[74] = {"仙女","仙女"},
	[75] = {"尸王","尸王"},
	[76] = {"石魔","石魔"},
	[77] = {"卢俊义","卢俊义"},
	--第三关NPC
	[78] = {"小鸡","鸡"},
	[79] = {"小鸭","鸭"},
	[80] = {"小鹅","鹅"},
	[81] = {"小羊","羊"},
	[82] = {"没羽箭张清", "没羽箭张清"},
	[83] = {"小李广花荣", "小李广花荣",},
	--第四关NPC
	[84] = {"青龙堂帮众","青龙堂帮众"},
	[85] = {"白虎堂帮众","白虎堂帮众"},
	[86] = {"朱雀堂帮众","朱雀堂帮众"},
	[87] = {"玄武堂帮众","玄武堂帮众"},
	[88] = {"金钱豹子汤隆","金钱豹子汤隆"},
	[89] = {"轰雷开关","轰雷开关"},
	[90] = {"轰雷开关","炙阳开关"},
	[91] = {"轰雷开关","冷霜开关"},
	[92] = {"轰雷开关","风矢开关"},
	[93] = {"轰雷","轰雷"},
	[94] = {"炙阳","炙阳"},
	[95] = {"冷霜","冷霜"},
	[96] = {"风矢","风矢"},
	--第五关NPC（无）
	--隐藏第一关NPC
	[97] = {"纳娜","纳娜"},
	--隐藏第二关NPC
	[98] = {"杨骢","杨骢",},
	[99] = {"吴仁迪","吴仁迪",},
	[100] = {"王智渊","王智渊"},
	[101] = {"黎嗣维","黎嗣维"},
}
--关卡名称
LSStageName = {
	[1] = "水泊亭",
	[2] = "快活林",
	[3] = "跑马道",
	[4] = "黑风寨",
	[5] = "黑风寨",
	[6] = "聚义堂",
	[7] = "猜拳比赛",
	[8] = "终极挑战",
}
--任务信息
LSTaskInfo = {
	[1] = {
		[1] = "初演挑战",
		[2] = "每日完成一次梁山群雄会1-4关的挑战（在黑风寨击败梁山好汉），可获得<color=yellow>梁山初演包<color>1个，开启后有概率获得替身符、师门圣物或修身丸。",
	},
	[2] = {
		[1] = "忠勇挑战",
		[2] = "每日完成梁山群雄会通关一次，可获得<color=yellow>梁山忠勇包<color>1个，开启后有概率得到金钱或修为。",
	},
	[3] = {
		[1] = "夺军挑战",
		[2] = "每日击败一次指定的梁山好汉（例：霹雳火秦明），可获得<color=yellow>梁山夺军包<color>1个，开启后有概率得到经验或修为。",
		[3] = "每日击败一次 “<color=red>%s<color>”，可获得<color=yellow>梁山夺军包<color>1个，开启后有概率得到经验或修为。",
	},
}
--玩家个人消息
LSMsgToPlayer = {
	[1] = "前方道路不通",
	[2] = "材料属性正在测试中！",
	[3] = "背包空间不足",
	[4] = "拾取了",
	[5] = "箱子里什么也没有",
	[6] = "所有队员都放弃了",
	[7] = "其他队员已经超时，选择放弃。",
	[8] = "投出了%d点",
	[9] = "放弃了",
	[10] = "需求",
	[11] = "拾取了",
	[12] = "贪婪",
	[13] = "你带的天骄令不够%s个",
	[14] = "你完成了%s，请找 [%s]领取奖励。",
	[15] = "你获得了%d点修为",
	[16] = "你获得了%d点经验值",
	[17] = "你成功兑换了%s",
	[18] = "背包空间不足，无法获取%s。",
	[19] = "今日完成了梁山挑战获得了%d个%s(每日最多获得%d个)。"
}
--队伍消息
LSMsgToTeam = {
	[1] = "闯关成功！！！",
	[2] = "正在进入下一关",
	[3] = "%s无法进入关卡(休眠中)",
	[4] = "%s无法进入关卡(不在同一城镇)",
	[5] = "%s无法进入关卡(未加入流派)",
	[6] = "进入关卡",
	[7] = "关卡等待开启中，进度",
	[8] = "关卡进行中，进度",
	[9] = "关卡等待结束中，进度",
	[10] = "已经出现，挑战现在开始！",
	[11] = "闯关失败，即将离开关卡",
	[12] = "已被击败。",
	--闯关完成后的提示信息
	[13] = {
		[1] = "恭喜各位英雄顺利闯过第一关，沿着上面的桥路向上走会在路口处遇到卢俊义，和他谈谈吧。",
		[2] = "快活林的试炼已经结束，沿着东北路口向上走，会遇到花荣和张清，队长可以从他们那里打听消息。",
		[3] = "跑马道的试炼已经结束，沿着西北路口向上走，会遇到金钱豹子汤隆，队长可以从他那里打听消息。",
		[4] = "黑风寨的试炼已经结束，向西走就是聚义堂，我在上面等你。准备好了就来找我吧。若选择聚义堂会战，则可同时挑战4个来山好汉，获胜后会有额外奖励，需要交纳20个挑战令。",
		[5] = "黑风寨的试炼已经结束，向西走就是聚义堂，我在上面等你。准备好了就来找我吧。若选择聚义堂会战，则可同时挑战4个来山好汉，获胜后会有额外奖励，需要交纳20个挑战令。",
		[6] = "隐藏关卡“猜拳比赛”已经结束",
		[7] = "梁山群雄会已结束",
	},
	--关卡进入时欢迎队伍消息
	[14] = {
		[1] = {
				"梁山群雄会高手如云，你准备好了吗？",
				"母夜叉孙二娘：真不幸，竟被一群路人给打败了。",
				"菜园子张青： 风一帆，王智渊，黎嗣维，杨骢，他们武艺如此高强。",
				"母夜叉孙二娘：呸，高强的屁，上次老娘轻敌了，只用了七成功力，侥幸让这些娃娃们取胜了……咦，路口有动静，买卖来了！上次被那几个娃娃给伤了，正好拿这些人开刀。",
				"菜园子张青：娘子小心，切莫大意，小看了这些人。.",
		},
		[2] = {
			NpcName[77][2].."：天地万物皆有灵性，无论飞禽走兽还是山石草木都蕴有灵气。",
			NpcName[77][2].."：若这些万物之灵为我们所用，可以成为无坚不摧的制胜武器。",
		},
		[3] = {
			NpcName[82][2].."：大家都说花荣比张清厉害，今日我很想和花兄弟比试一番。",
			NpcName[83][2].."：飞石、箭术各有千秋，你我兄弟二人没必要为一虚名而争执。",
			NpcName[82][2].."：不比也罢，我倒是怕其他的兄弟听了，说花兄沽名钓誉，有辱花兄英名。",
			NpcName[83][2].."：既然张兄弟执意比试，愿张兄弟不吝赐教！",
		},
		[4] = {
			"梁山帮众甲： 这是什么东西？很奇怪的样子。",
			"梁山帮众乙： 我们这边也有一个，上面写着，“轰雷”和“火阳”是什么意思？",
			"梁山帮众甲： 你这个笨蛋，这叫炙阳，回家学习吧。我想这是一个开关。",
			"梁山帮众乙： 机关？里面是不是藏着宝贝。",
			"梁山帮众甲： 瞧你那点出息，还是多认点字吧。",
			"梁山帮众乙：嘘，上面有个开关，我打开看看会出来啥宝贝。",
			"梁山帮众甲：别，别动……",
			"突然，“啊”一声惨叫回荡于黑风寨中……",
			"金钱豹子汤隆：这群笨蛋，未经我的许可就擅自启动我的机关。",
		},
	},
	[15] = "您已经进入“%s”",
	[16] = "已经出现，挑战现在开始！",
	[17] = "各位大侠现在已经捕获了%d只猎物， %s和%s也已捕获了%d只猎物。",
	[18] = "您已经获得“气旋神功”，鼠标选择石键快捷栏，在弹出的技解图标中选择”气旋神功”，该武功技能即可使用。",
	[19] = "已身受重伤",
	[20] = "机关已经重启了",
	[21] = "机关被激活了",
	[22] = "聚义堂集结了我们梁山泊的精英，让你们一睹我们梁山好汉的风采。",
	[23] = "你使用%s挑战梁山好汉，尽快开启宝箱",
	[24] = "已被击败。",
	[25] = "恭喜，你们已经通过了所有关卡。",
	[26] = "你已经进入“%s”",
	[27] = {"拳头","剪刀","布"},
	--猜拳结果信息
	[28] = {"比","！ 我赢了，你还是太年轻了。","！ 阁下真是神机天算，小女子佩服之至。"},
	[29] = {"比赛结束。","你们赢了！","你们输了！"},
	--隐藏关卡第二关
	[30] = "%s身受重伤",
	
	[31] = "获得状态[%s]，持续%d秒%s"
}
--时间进度条
LSTimeGuageString = {
	[1] = "狩猎时间",
	[2] = "机关刷新",
	[3] = "恢复时间",
	[4] = "无敌时间",
	[5] = "猜拳时间",
	[6] = "生存时间",
}
--闯关条件对话展开
LSLoginQuanli = {
	"只有组织",
	"至少 %d个",
	"等级都≥%d级",
	"<color=green>且不是团队模式<color>的队伍，并由",
	"队长<color>带领，才能参加梁山群雄会。\n \n<color=gray>（红色文字表示队伍条件未达成，绿色文字表示队伍条件已经达成）<color>",
}
--talk对话
LSSysTalk = {
	[1] = "在开启下一关前，先把奖励宝箱捡起来",
	[2] = "进入梁山的英雄太多了，请过会再来。",
	[3] = "未加入流派的人不能获得奖励",
	[4] = "当前网络不好%s",
	[5] = {
		"真正的伟大是单纯",
		"真正的智慧是坦率",
		"真正的力量是温和",
		"毫无意义！",
		"不要为邪恶而工作，不要为善良而工作。",
	},
	[6] = "Boss遭遇状态： (红色=已遭遇，绿色=未遭遇)",
	[7] = "：请稍等……",
	[8] = "<color=green>提示信息<color>：您和您的队友已经向%s、%s发起挑战<color=green>若在3分钟内击杀的猎物超过两人捕获的猎物，您和您的队友则取得胜利<color>。花荣和张青已经在另一处的树林里进行狩措活动。狩猎比赛现在开始。",
	[9] = "在战斗中，所有参与的玩家都处于天神下凡状态，战斗结束后将恢复。每隔30秒，恢复区域内玩家所有状态，同时增加10秒的持续时间。在消灭了所有Boss之后，玩家可以进入下一轮挑战。当前状态<color=yellow>%s<color>：\n<color=green>%s<color>",
	[10] = "你身上的%s不够，无法开启挑战，%s可以通过<color=yellow>御街<color>购买。",
	[11] = "在你离开之前，请拾取奖励宝箱",
	[12] = {"玩家【%s】输了！","玩家【 %s】取胜！","现在总比分为%d 比 %d。你们已经赢了%d局"},
	--隐藏关卡第二关的相关结束信息
	[13] = {
		"恭喜！你的队伍通过了考验，获得了丰厚的奖励。",
		"还不错，你可以进入下一关的战斗。",
		"你的队伍被打败了。",
	},
	--梁山任务相关
	[14] = {
		"你接受了任务",
		"你完成了“<color=green>%s<color>”，速速前来领奖！",	
	},
	[15] = {
		[1] = "你身上缺少%s的数量为%d！",
		[2] = "你身上缺少银两%d金",
		[3] = "你的负重或背包空间不够！",
		[4] = "你未加入任何流派！",
	},
}
--npc喊话信息
LSNpcChat = {
	--boss开始战斗时的喊话
	[1] = {
		[NpcName[2 ][2]] = {"让我领教一下你的本事","刀剑无眼，请小心。"},
		[NpcName[5 ][2]] = {"想和我决斗，那就看你的本事了。"},
		[NpcName[8 ][2]] = {"废话少说，亮兵器吧！","没有武器，请小心！"},
		[NpcName[11][2]] = {"哈哈哈，你想和我决斗，这是我的荣幸，这是我的荣幸","虽然我很久没有出手，但我不会手软的！"},
		[NpcName[14][2]] = {"战斗不是这样的，让我来教你一下什么是功夫！"},
		[NpcName[17][2]] = {"我的刀还没好，你就回家吧。","你挑战我，哈哈哈，我也想尝尝失败的滋味。",},
		[NpcName[20][2]] = {"看看这个！","看看我的力量！"},
		[NpcName[23][2]] = {"你是来挑战我的吗？让我们看看你的斤两！"},
		[NpcName[26][2]] = {"你们这些小毛贼怎么敢这样无礼！","告诉我你的名字，如果我把你打死，你的墓碑上就会有名字！"},
		[NpcName[29][2]] = {"废话少说，看招。","来吧！"},
		[NpcName[32][2]] = {"如果你想挑战我，你必须付出巨大的代价！","你以为我是一只病猫！"},
		[NpcName[35][2]] = {"别开玩笑了，如果你想和我打架，我会让你后悔活着！","放弃吧，现在回头还早！"},
		[NpcName[38][2]] = {"来吧，让我们看看你的力量！","告诉你不要惹美女生气！"},
		[NpcName[41][2]] = {"你活腻了吗，来挑战我吧。",	"我只需要一只手就能把你打倒！"},
		[NpcName[44][2]] = {"我来告诉你梁山的英雄！","我不杀无名鼠辈，你走吧。"},
		[NpcName[47][2]] = {"如果你想和我竞争，先吃这招！！","谁敢和我大战300回合？"},
		[NpcName[50][2]] = {"你竟敢挑战我们的梁山好汉！","看看这招！","还是回去找你妈，不然你就别哭了！"},
		[NpcName[53][2]] = {"你是谁，我不杀无名小卒！","你知道鞭炮的力量吗?"},
	},
	--boss战败时的喊话
	[2] =
	{
		[NpcName[2 ][2]] = {"好厉害的招式","你为什么不加入梁山呢?"},
		[NpcName[5 ][2]] = {"我输了，你实在太厉害了！"},
		[NpcName[8 ][2]] = {"好厉害的武功！"},
		[NpcName[11][2]] = {"我有一段时间没见到这么优秀的人了，真是太厉害了！"},
		[NpcName[14][2]] = {"无论你走到哪里，你都会付出代价的。"},
		[NpcName[17][2]] = {"功夫还不错，可惜我只使用了7种招式","我今天输了，真有趣！"},
		[NpcName[20][2]] = {"你是真正的高手。"},
		[NpcName[23][2]] = {"林某在江湖上活了几十年，遇到少侠，真是太幸运了！"},
		[NpcName[26][2]] = {"我不知道你会输给那些老家伙，你太大意了。"},
		[NpcName[29][2]] = {"你的功夫真厉害。"},
		[NpcName[32][2]] = {"江山不变，绿水长流。等等！"},
		[NpcName[35][2]] = {"你真有胆量，今天就放你走！下次我不会退缩的！","虽然你打败了我，但我的兄弟们会报仇的！"},
		[NpcName[38][2]] = {"女士们，我向你们致敬。"},
		[NpcName[41][2]] = {"今天有一场令人愉快的战斗！"},
		[NpcName[44][2]] = {"你是梁山的第109个英雄！"},
		[NpcName[47][2]] = {"该死，被这些混蛋打败了，这太可悲了！"},
		[NpcName[50][2]] = {"虽然不甘心，但确实让我佩服。",	},
		[NpcName[53][2]] = {"新鲜，美味，好久不见了！","老子今天喝多了，四肢不能动，下次再教你。"},
	}
}
--NPC-Say对话整理
NpcSayInfo = {
	[1] = {
		"<color=green>"..NpcName[1][2].."<color>：一旦你接到命令，你就可以来找我。",
		"◆ 返回",
		"◆ 结束对话",
		"◆ %s (需要 %d的命令)",		--test:物品名
		"不能交易",
	},
	[2] = {
		"<color=green>"..NpcName[1][2].."<color>：你确定用%d的命令换%s吗?",
		"同意",
		"取消",
	},
	[3] = {
		"西北方有一个茶亭，队长可以向老板孙二娘打听有关此次梁山群雄会的情况。",
		"结束对话",
	},
	[4] = {
		"梁山群雄会关卡已结束。",
	},
	--闯关接引NPC对话选项
	[5] = {
		[1] = "进入下一关",
		[2] = "查看Boss遭遇情况",
		[3] = "结束对话",
		[4] = "：我们梁山的兄弟们都是武艺高超的人，各位英雄应当全力以赴，不要轻敌。",
	},
	--关卡第一关的相关对话
	[6] = {
		[1] = {
			"西北方有一个茶亭，队长可以向老板孙二娘打听有关此次梁山群雄会的情况。",
			{
				"结束对话/nothing",
			},
		},
		[2] = {
			"：既然几位有胆挑战我们梁山众位兄弟，想必并不是泛泛之辈，兄弟几个准备好了吗？",
			{
				"我要接受挑战/start",
				"结束对话/nothing",
			},
		},
		[3] = {
			"：我后面的小路可直达聚义堂，战胜聚义堂的好汉可获得更为丰厚的奖助。不过你们达到黑风寨须战胜守候那里的4位梁山好汉。若想从我这通过须交纳20个天骄令。你做好迎战的准备了吗?",
			{
				"我要沿小路上去/#tStage_1:skip()",
				"我只是路过/nothing",
			},
		},
		[4] = {
			"：需要交纳<color=yellow>%d<color>个%s才能直达聚义堂，你确定走小路吗？",
			{
				"同意/#tStage_1:skip(1)",
				"我只是路过/nothing",
			},
		},
	},
	--关卡第二关的相关对话
	[7] = {
		[1] = {
			"：你们这帮小兄弟可是来参加群雄会挑战我梁山诸位英雄的?他们个个武功绝伦，身怀绝技，切莫轻敌。若觉得挑战吃力，队长可从我这里选择合适的帮手。",
			{
				"我要接受挑战/start",
				"结束对话/nothing",
			}
		},
		[2] = {
			"：你们这帮小兄弟可是来参加群雄会挑战我梁山诸位英雄的?他们个个武功绝伦，身怀绝技，切莫轻敌。若觉得挑战吃力，队长可从我这里选择合适的帮手。",
			{
				"我需要帮手/#tStage_2:getAid()",
				"结束对话/nothing",
			}
		},
		[3] = {
			"：下面的人都有自己的特技，你需要哪位的帮助？",
			{
				"虎王：光环效果：在光环范围内，玩家将被提升/#tStage_2:createMyFish(1)",
				"仙女：光环效果：在光环范围内，玩家可以恢复生命。/#tStage_2:createMyFish(2)",
				"尸王：光环效果：在光环范围内，对手可以减少内外部伤害/#tStage_2:createMyFish(3)",
				"石魔：光环效果：在光环范围内，对手速度下降/#tStage_2:createMyFish(4)",
				"我再想想看/nothing",
			}
		},
	},
	--关卡第三关的相关对话
	[8] = {
		--挑战前的对话
		[1] = {
			[1] = {
				"：大家都说花荣比张清厉害，今日我很想和花兄弟比试一番。",
				"：大家同为梁山兄弟，张兄弟执意与我比试，真是让我左右为难。",
			},
			[2] = {
				"不如我们来比试/#tStage_3:startfish()",
				"返回 /nothing",
			},
		},
		--挑战成功的对话
		[2] = {
			[1] = {
				"：侠士武艺高强，张青佩服之至。",
				"：侠士武艺高强，花荣佩服之至。",
			},
		},
		--挑战失败的对话
		[3] = {
			[1] = {
				"：我只是想和他痛快的打上一场。",
				"：大家同为梁山兄弟，张兄弟执意与我比试，真是让我左右为难。",
			},
			[2] = {
				"我要挑战下一位梁山好汉/#tStage_3:startboss()",
				"返回/nothing",
			},
		},
		--闯关结束时的对话
		[4] = {
			[1] = {
				"<color=green>提示信息<color>：狩猎时间结束。各位大侠已经总共捕获了 %d只猎物，%s和%s共捕获了%d只猎物。<color=red>与张清或花荣对话<color>，可挑战下一位梁山好汉。",
				"\n您已经获得“<color=yellow>气旋神功<color>”，<color=green>鼠标选择石键快捷栏，在弹出的技解图标中选择”气旋神功”<color>，该武功技能即可使用。",
			},
			[2] = {
				"我知道了/nothing",
			},
		},
	},
	--关卡第四关的相关兑换
	[9] = {
		[1] = {
			"：里边的机关可是我多年研究机关的成果，听说你要挑战我们梁山的众位兄弟，想必我研究的这些宝贝对你定有所帮助。北边院子上方有个<color=red>水池<color>，里面置有几个<color=red>开关<color>，队长可以开启机关，充分利用机关的能力可以帮助队伍顺利闯关。",
			{
				"我要接受挑战 /start",
				"返回/nothing"
			}
		},

	},
	--关卡第五关的相关对话
	[10] = {
		[1] = {
			"：若选择聚义堂会战，则可同时挑战4个来山好汉，获胜后会有额外奖励。",
			{
				"我要接受挑战/start",
				"结束对话/nothing",
			}
		},

	},
	--关卡第六关相关对话
	[11] = {
		[1] = {
			"：真不容易啊，没想到各位大侠能来到聚义堂，这里集结了我们梁山泊的精英，让你们一睹我们梁山好汉的风采。",
			{
				"我要接受挑战 (消耗2个天骄令)/preStart",
				"查看Boss遭遇情况/#tMission:showBossState()",
				"不玩了，我要回家/preClose",
				"结束对话/nothing",
			},
		},
		[2] = {
			"：真不容易啊，各位英雄肯定满载而归了。",
			{
				"不玩了，我要回家/preClose",
				"结束对话/nothing",
			},
		},
	},
	--隐藏第一关相关对话
	[12] = {
		[1] = {
			"：我可是猜拳的高手哦，想挑战我，那你当心了！ \n   <color=yellow>若队伍成员为3 - 4人，有一人取得胜利则比赛胜利\n   若队伍成员为5 - 8人，有两人取得胜利则比赛胜利 <color>",
			{
				"我要猜拳/start",
				"返回/nothing",
			},
		},
		[2] = {
			"：不要再玩了",
			{
				"返回 /nothing",
			},
		},
		[3] = {
			"三局两胜哦。现在比分为",
		},
		[4] = {
			{
				"呀？和我猜的一样。",
				"哈哈，我赢了。",
				"气死人家啦，坏人~",
			},
			{
				"返回 /start",
			},
		},
	},
	--隐藏第二关相关对话
	[13] = {
		[1] = {
			"你已经进入了梁山骑士战斗的秘密地带。在这一关，在三分钟内，所有的队员都活了下来，胜利的大门，可以得到巨大的奖励。当战斗结束时，两个人活着，两个人可以得到一个奖励箱，如果两个人活着，两个人就不能得到奖励，但整个团队可以继续下一个门的盾牌。",
			{
				"我明白了/nothing",
			},
		},
		[2] = {
			{
				--杨
				[NpcName[98][2]]   = "<color=green>"..NpcName[98][2].."<color>：你想挑战梁山好汉吗？",
				--吴
				[NpcName[99][2]] = "<color=green>"..NpcName[99][2].."<color>：苦海无边，回头是岸。",
				--王
				[NpcName[100][2]] = "<color=green>"..NpcName[100][2].."<color>：你也加入了梁山吗？",
				--黎
				[NpcName[101][2]] = "<color=green>"..NpcName[101][2].."<color>：让我看看你们有没有资格？",
			},
			{
				"废话少说，开战/start",
				"返回 /nothing",
			},
		},
	},
	--梁山任务相关对话
	[14] = {
		[1] = "：该类型任务每日只能做一次，当任务上交且获得奖励，则此任务本日不可再次接取。",
		[2] = "◆ 返回",
		[3] = "◆ 结束对话",
		[4] = "你已经接受了这个任务！",
		[5] = "◆ 查询任务",
		[6] = "任务完成了！",
		[7] = "◆ 领取奖励",
		[8] = "这个任务已领取奖励！",
		[9] = "◆ 接受任务",
	},
}
--状态信息
LSBuffInfo = {
	[1] = {
		{
			"生命回复",
			{
				{"state_life_per_per8f",  1000, 15*18, 1, 9922 }
			},
			"普济众生"
		},
		{
			"内力回复",
			{
				{"state_neili_per_per8f", 1000, 15*18, 1, 9923,}
			},
			"三元归一"
		},
		{
			"内外防御提高",
			{
				{"state_magic_parmor_per_add", 50, 15*18, 1, 9924, },
				{"state_physical_parmor_per_add", 50, 15*18, 1, 9925, },
			},
			"不动明王",
		},
		{
			"内外攻击提高",
			{
				{"state_m_attack_percent_add", 200, 15*18, 1, 9926, },
				{"state_p_attack_percent_add", 200, 15*18, 1, 9927, },
			},
			"佛音战意",
		},
	},
	--第五关的buff
	[2] = {
		[1] = {"真·天神下凡", 60, "持续%d分钟"},
		[2] = {
			[1] = {9908, "state_p_attack_percent_add",	700,	"外攻提高%d%%"},
			[2] = {9909, "state_m_attack_percent_add",	700,	"内功提高%d%%"},
			[3] = {9910, "state_life_max_percent_add",	300,	"生命上限提高%d%%"},
			[4] = {9911, "state_buff_resist",			14,		"负面效果抵抗次数 %d"},
		},
	},
}
--日志信息
SysLogInfo = {
	[1] = "Liangshan mission:	%s	add item fail, addflag:%d,itemname:	%s",
	

}
--“NpcName[1][2]”均表示传送NPC的名字
T = {}
T1 = {}
T2 = {}
T3 = {}
T3_1 = {}
T3_2 = {}
T3_3 = {}
T3_4 = {}
T3_5 = {}
T3_6 = {}

T.msg = "<color=green>"..NpcName[1][2].."<color>：我受梁山泊众好汉之托，特来此处迎候天下豪杰参加梁山群雄会。我能为阁下做些什么？";
T.sel =
{
	{"◆ 梁山群雄会背景", T1, },
	{"◆ 闯关条件", T2, },
	{"◆ 关卡介绍", T3, },
	{"◆ 我要率众闯关", "entry_jingli", },
--	{"◆ 我要率众闯关（天骄令）", "entry_tianjiaoling", },
	{"◆ 我要兑换关卡奖励物品", "exchange", },
--	{"◆ 我要接取梁山群雄会日常任务", "DailyTasksMenu", },
	{"◆ 结束对话", "nothing", },
	};
T1.msg = "<color=green>"..NpcName[1][2].."<color>：梁山泊为壮大队伍，广交天下豪杰。一时间，江湖中的武林豪杰纷纷投奔梁山。为了甄选人才招揽能人异士，武林豪杰须与众好汉切磋武艺，比武论剑。若比武获胜可获得梁山好汉所持信物信物——天罡令，使用天罡令可在我这里兑换江湖奇兵、武林异宝。";
T1.sel =
{
	{"◆ 返回", T, },
	{"◆ 结束对话", "nothing", }, };
T2.msg = "<color=green>"..NpcName[1][2].."<color>：只有组织至少3个等级≥80级的玩家组成队伍，并由队长带领，才能参加梁山群雄会。未入流派者也无法进入。若你和你队伍想跳关直达黑风寨，在进入关卡之后，朝东北方向小道前进，我会河边等你们，队长交纳20个天骄令，队伍可沿小路到达黑风寨。";
T2.sel =
{
	{"◆ 返回", T, },
	{"◆ 结束对话", "nothing", }, };
T3.msg = "<color=green>"..NpcName[1][2].."<color>：梁山群雄会共有5关，共计8组梁山好汉（从18组名单中随机选取）。1-4关中每关挑战1组好汉，第5关将逐一挑战剩下4组梁山好汉。";
T3.sel =
{
	{"◆ 水泊亭", T3_1, },
	{"◆ 快活林", T3_2, },
	{"◆ 跑马道", T3_3, },
	{"◆ 黑风寨", T3_4, },
	{"◆ 聚义堂", T3_5, },
	{"◆ 隐藏关卡", T3_6, },
	{"◆ 返回", T, },
	{"◆ 结束对话", "nothing", }, };
T3_1.msg = "<color=green>"..NpcName[1][2].."<color>：水泊亭周围置有许多箱子，摧毁箱子会触发各种效果，有的机关可以给你和你的队友增加有益状态，如何在适当的时机摧毁箱子是提高闯关效率的关键。";
T3_1.sel =
{
	{"◆ 返回", T3, },
	{"◆ 结束对话", "nothing", }, };
T3_2.msg = "<color=green>"..NpcName[1][2].."<color>：快活林的卢俊义会给你们提供各种帮助。与其对话，便可获得不同类型帮手的援助。这些帮手身怀各种绝技，充分利用他们的技能定能顺利闯关。";
T3_2.sel =
{
	{"◆ 返回", T3, },
	{"◆ 结束对话", "nothing", }, };
T3_3.msg = "<color=green>"..NpcName[1][2].."<color>：跑马道的花荣和张清发生了争执，你们选择他们中的一个进行比赛，若在规定时间内击杀野兽的数目超过他，则可获得“气元神功”，R此武功会让你大展拳脚，有着不同的闯关体验。";
T3_3.sel =
{
	{"◆ 返回", T3, },
	{"◆ 结束对话", "nothing", }, };
T3_4.msg = "<color=green>"..NpcName[1][2].."<color>：黑风寨置有四种机关，开启不同的机关会释放不同技能，你们可以充分利用这些机关对抗敌人。";
T3_4.sel =
{
	{"◆ 返回", T3, },
	{"◆ 结束对话", "nothing", }, };
T3_5.msg = "<color=green>"..NpcName[1][2].."<color>：若顺利闯过黑风寨，你们队伍中的一人在戴宗处上交两个天骄令方可进入聚义堂挑战其他好汉（天骄令可从商城购买），发起挑战后，聚义堂中的对应人物会转化成战斗人物与你的队伍进行切磋。";
T3_5.sel =
{
	{"◆ 返回", T3, },
	{"◆ 结束对话", "nothing", }, };
T3_6.msg = "<color=green>"..NpcName[1][2].."<color>：这是个秘密。"
T3_6.sel =
{
	{"◆ 返回", T3, },
	{"◆ 结束对话", "nothing", }, 
}