Import("\\script\\lib\\globalfunctions.lua")

ZHANKUANG_BOX = {
	tHead = {
    [2]  = {
			[1] = {{0, 103, 30143, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn §Þa M¹o"},
			[2] = {{0, 103, 30144, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn §Þa M¹o"},
		},
		[3]  = {                                                                            
			[1] = {{0, 103, 30147, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phæ TÕ M¹o"},         
			[2] = {{0, 103, 30148, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phæ TÕ M¹o"},
		}, 
		[4]  = {
			[1] = {{0, 103, 30145, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn T«n M¹o"},
			[2] = {{0, 103, 30146, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn T«n M¹o"},
		},	
		[6]  = {
			[1] = {{0, 103, 30149, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Qu¸n"},
			[2] = {{0, 103, 30150, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Qu¸n"},
			[3] = {{0, 103, 30151, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Qu¸n"},
			[4] = {{0, 103, 30152, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Qu¸n"},
		},
		[8]  = {
			[3] = {{0, 103, 30153, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bå T¸t Tr©m"},
			[4] = {{0, 103, 30154, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bå T¸t Tr©m"},
		},
		[9]  = {
			[3] = {{0, 103, 30155, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång L­u Thñy Tr©m"},
			[4] = {{0, 103, 30156, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång L­u Thñy Tr©m"},
		},
		[11] = {
			[1] = {{0, 103, 30157, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du C©n"},
			[2] = {{0, 103, 30158, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du C©n"},
			[3] = {{0, 103, 30159, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du C©n"},
			[4] = {{0, 103, 30160, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du C©n"},
		},
		[12] = {
			[1] = {{0, 103, 30161, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao C©n"},
			[2] = {{0, 103, 30162, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao C©n"},
			[3] = {{0, 103, 30163, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao C©n"},
			[4] = {{0, 103, 30164, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao C©n"},
		},
		[14] = {
			[1] = {{0, 103, 30165, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Qu¸n"},
			[2] = {{0, 103, 30166, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Qu¸n"},
			[3] = {{0, 103, 30167, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Qu¸n"},
			[4] = {{0, 103, 30168, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Qu¸n"},
		},
		[15] = {
			[1] = {{0, 103, 30169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Qu¸n"},
			[2] = {{0, 103, 30170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Qu¸n"},
			[3] = {{0, 103, 30171, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Qu¸n"},
			[4] = {{0, 103, 30172, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Qu¸n"},
		},
		[17] = {
			[1] = {{0, 103, 30173, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Kh«i"},
			[2] = {{0, 103, 30174, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Kh«i"},
			[3] = {{0, 103, 30175, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Kh«i"},
			[4] = {{0, 103, 30176, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Kh«i"},
		},
		[18] = {
			[1] = {{0, 103, 30177, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Kh«i"},
			[2] = {{0, 103, 30178, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Kh«i"},
			[3] = {{0, 103, 30179, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Kh«i"},
			[4] = {{0, 103, 30180, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Kh«i"},
		},
		[20] = {
			[1] = {{0, 103, 30181, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n C©n"},
			[2] = {{0, 103, 30182, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n C©n"},
			[3] = {{0, 103, 30183, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n C©n"},
			[4] = {{0, 103, 30184, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n C©n"},
		},
		[21] = {
			[1] = {{0, 103, 30185, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m C©n"},
			[2] = {{0, 103, 30186, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m C©n"},
			[3] = {{0, 103, 30187, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m C©n"},
			[4] = {{0, 103, 30188, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m C©n"},
		},
		[23] = {
			[1] = {{0, 103, 30189, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phong L«i Qu¸n"},
			[2] = {{0, 103, 30190, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phong L«i Qu¸n"},
		},
		[25] = {
			[1] = {{0, 103, 30191, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa C©n"},
			[2] = {{0, 103, 30192, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa C©n"},
			[3] = {{0, 103, 30193, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa C©n"},
			[4] = {{0, 103, 30194, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa C©n"},
		},
		[26] = {
			[1] = {{0, 103, 30195, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Qu¸n"},
			[2] = {{0, 103, 30196, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Qu¸n"},
			[3] = {{0, 103, 30197, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Qu¸n"},
			[4] = {{0, 103, 30198, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Qu¸n"},
		},
		[27] = {
			[1] = {{0, 103, 30199, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Qu¸n"},
			[2] = {{0, 103, 30200, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Qu¸n"},
			[3] = {{0, 103, 30201, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Qu¸n"},
			[4] = {{0, 103, 30202, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Qu¸n"},
		},
		[29] = {
			[3] = {{0, 103, 30203, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh N÷  Tr©m"},
			[4] = {{0, 103, 30204, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh N÷  Tr©m"},
		},
		[30] = {
			[3] = {{0, 103, 30205, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh Linh Tr©m"},
			[4] = {{0, 103, 30206, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh Linh Tr©m"},
		},
		[31] = {
			[1] = {{0, 103, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Qu¸n"},
			[2] = {{0, 103, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Qu¸n"},
			[3] = {{0, 103, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Qu¸n"},
			[4] = {{0, 103, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Qu¸n"},
		},
		[32] = {
			[1] = {{0, 103, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Qu¸n"},
			[2] = {{0, 103, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Qu¸n"},
			[3] = {{0, 103, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Qu¸n"},
			[4] = {{0, 103, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Qu¸n"},
		},
	},
	tCloth = {
		[2] = {
			[1] = {{0, 100, 30143, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn §Þa Bµo"},
		  [2] = {{0, 100, 30144, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn §Þa Bµo"},
		},
		[3] = {
			[1] = {{0, 100, 30147, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phæ TÕ Bµo"},
		  [2] = {{0, 100, 30148, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phæ TÕ Bµo"},
		},
		[4] = {
			[1] = {{0, 100, 30145, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn T«n Bµo"},
		  [2] = {{0, 100, 30146, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn T«n Bµo"},
		},
		[6] = {
			[1] = {{0, 100, 30149, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Y"},
			[2] = {{0, 100, 30150, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Y"},
			[3] = {{0, 100, 30151, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Y"},
			[4] = {{0, 100, 30152, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Y"},
		},
		[8] = {
			[3] = {{0, 100, 30153, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bå T¸t Y"},
			[4] = {{0, 100, 30154, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bå T¸t Y"},
		},
		[9] = {
			[3] = {{0, 100, 30155, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång L­u ThñyY"},
			[4] = {{0, 100, 30156, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång L­u ThñyY"},
		},
		[11] = {
			[1] = {{0, 100, 30157, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Y"},
			[2] = {{0, 100, 30158, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Y"},
			[3] = {{0, 100, 30159, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Y"},
			[4] = {{0, 100, 30160, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Y"},
		},
		[12] = {
			[1] = {{0, 100, 30161, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Y"},
			[2] = {{0, 100, 30162, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Y"},
			[3] = {{0, 100, 30163, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Y"},
			[4] = {{0, 100, 30164, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Y"},
		},
		[14] = {
			[1] = {{0, 100, 30165, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Bµo"},
			[2] = {{0, 100, 30166, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Bµo"},
			[3] = {{0, 100, 30167, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Bµo"},
			[4] = {{0, 100, 30168, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Bµo"},
		},
		[15] = {
			[1] = {{0, 100, 30169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Bµo"},
			[2] = {{0, 100, 30170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Bµo"},
			[3] = {{0, 100, 30171, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Bµo"},
			[4] = {{0, 100, 30172, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Bµo"},
		},
		[17] = {
			[1] = {{0, 100, 30173, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Gi¸p"},
			[2] = {{0, 100, 30174, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Gi¸p"},
			[3] = {{0, 100, 30175, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Gi¸p"},
			[4] = {{0, 100, 30176, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Gi¸p"},
		},
		[18] = {
			[1] = {{0, 100, 30177, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Gi¸p"},
			[2] = {{0, 100, 30178, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Gi¸p"},
			[3] = {{0, 100, 30179, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Gi¸p"},
			[4] = {{0, 100, 30180, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Gi¸p"},
		},
		[20] = {
			[1] = {{0, 100, 30181, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Y"},
			[2] = {{0, 100, 30182, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Y"},
			[3] = {{0, 100, 30183, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Y"},
			[4] = {{0, 100, 30184, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Y"},
		},
		[21] = {
			[1] = {{0, 100, 30185, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Y"},
			[2] = {{0, 100, 30186, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Y"},
			[3] = {{0, 100, 30187, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Y"},
			[4] = {{0, 100, 30188, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Y"},
		},
		[23] = {
			[1] = {{0, 100, 30189, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phong L«i Bµo"},
			[2] = {{0, 100, 30190, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phong L«i Bµo"},
		},
		[25] = {
			[1] = {{0, 100, 30191, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Y"},
			[2] = {{0, 100, 30192, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Y"},
			[3] = {{0, 100, 30193, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Y"},
			[4] = {{0, 100, 30194, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Y"},
		},
		[26] = {
			[1] = {{0, 100, 30195, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Bµo"},
			[2] = {{0, 100, 30196, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Bµo"},
			[3] = {{0, 100, 30197, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Bµo"},
			[4] = {{0, 100, 30198, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Bµo"},
		},
		[27] = {
			[1] = {{0, 100, 30199, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Bµo"},
			[2] = {{0, 100, 30200, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Bµo"},
			[3] = {{0, 100, 30201, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Bµo"},
			[4] = {{0, 100, 30202, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Bµo"},
		},
		[29] = {
			[3] = {{0, 100, 30203, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh N÷  Y"},
			[4] = {{0, 100, 30204, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh N÷  Y"},
		},
		[30] = {
			[3] = {{0, 100, 30205, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh Linh Y"},
			[4] = {{0, 100, 30206, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh Linh Y"},
		},
		[31] = {
			[1] = {{0, 100, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Bµo"},
			[2] = {{0, 100, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Bµo"},
			[3] = {{0, 100, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Bµo"},
			[4] = {{0, 100, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Bµo"},
		},
		[32] = {
			[1] = {{0, 100, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Bµo"},
			[2] = {{0, 100, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Bµo"},
			[3] = {{0, 100, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Bµo"},
			[4] = {{0, 100, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Bµo"},
		},
	},
	tShoe = {
		[2] = {
		  [1] = {{0, 101, 30143, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn §Þa Trang"},
			[2] = {{0, 101, 30144, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn §Þa Trang"},
		},
		[3] = {
			[1] = {{0, 101, 30147, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phæ TÕ Trang"},
			[2] = {{0, 101, 30148, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phæ TÕ Trang"},
		},
		[4] = {
			[1] = {{0, 101, 30145, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn T«n Trang"},
			[2] = {{0, 101, 30146, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn T«n Trang"},
		},
		[6] = {
			[1] = {{0, 101, 30149, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Trang"},
			[2] = {{0, 101, 30150, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Trang"},
			[3] = {{0, 101, 30151, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Trang"},
			[4] = {{0, 101, 30152, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång TuyÖt MÖnh Trang"},
		},
		[8] = {
			[3] = {{0, 101, 30153, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bå T¸t Khè"},
			[4] = {{0, 101, 30154, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bå T¸t Khè"},
		},
		[9] = {
			[3] = {{0, 101, 30155, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång L­u ThñyKhè"},
			[4] = {{0, 101, 30156, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång L­u ThñyKhè"},
		},
		[11] = {
			[1] = {{0, 101, 30157, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Trang"},
			[2] = {{0, 101, 30158, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Trang"},
			[3] = {{0, 101, 30159, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Trang"},
			[4] = {{0, 101, 30160, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång ThÇn Du Trang"},
		},
		[12] = {
			[1] = {{0, 101, 30161, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Trang"},
			[2] = {{0, 101, 30162, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Trang"},
			[3] = {{0, 101, 30163, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Trang"},
			[4] = {{0, 101, 30164, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tiªu Dao Trang"},
		},
		[14] = {
			[1] = {{0, 101, 30165, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Trang"},
			[2] = {{0, 101, 30166, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Trang"},
			[3] = {{0, 101, 30167, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Trang"},
			[4] = {{0, 101, 30168, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång V« Vi Trang"},
		},
		[15] = {
			[1] = {{0, 101, 30169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Trang"},
			[2] = {{0, 101, 30170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Trang"},
			[3] = {{0, 101, 30171, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Trang"},
			[4] = {{0, 101, 30172, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cµn Kh«n Trang"},
		},
		[17] = {
			[1] = {{0, 101, 30173, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Trang"},
			[2] = {{0, 101, 30174, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Trang"},
			[3] = {{0, 101, 30175, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Trang"},
			[4] = {{0, 101, 30176, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Thiªn Tinh  Trang"},
		},
		[18] = {
			[1] = {{0, 101, 30177, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Trang"},
			[2] = {{0, 101, 30178, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Trang"},
			[3] = {{0, 101, 30179, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Trang"},
			[4] = {{0, 101, 30180, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Xuyªn V©n Trang"},
		},
		[20] = {
			[1] = {{0, 101, 30181, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Trang"},
			[2] = {{0, 101, 30182, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Trang"},
			[3] = {{0, 101, 30183, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Trang"},
			[4] = {{0, 101, 30184, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Minh T«n Trang"},
		},
		[21] = {
			[1] = {{0, 101, 30185, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Trang"},
			[2] = {{0, 101, 30186, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Trang"},
			[3] = {{0, 101, 30187, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Trang"},
			[4] = {{0, 101, 30188, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Cæ T©m Trang"},
		},
		[23] = {
			[1] = {{0, 101, 30189, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phong L«i Trang"},
			[2] = {{0, 101, 30190, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Phong L«i Trang"},
		},
		[25] = {
			[1] = {{0, 101, 30191, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Trang"},
			[2] = {{0, 101, 30192, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Trang"},
			[3] = {{0, 101, 30193, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Trang"},
			[4] = {{0, 101, 30194, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång §¹i §Þa Trang"},
		},
		[26] = {
			[1] = {{0, 101, 30195, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Trang"},
			[2] = {{0, 101, 30196, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Trang"},
			[3] = {{0, 101, 30197, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Trang"},
			[4] = {{0, 101, 30198, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tóy Méng Trang"},
		},
		[27] = {
			[1] = {{0, 101, 30199, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Trang"},
			[2] = {{0, 101, 30200, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Trang"},
			[3] = {{0, 101, 30201, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Trang"},
			[4] = {{0, 101, 30202, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Ma Vùc  Trang"},
		},
		[29] = {
			[3] = {{0, 101, 30203, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh N÷  Khè"},
			[4] = {{0, 101, 30204, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh N÷  Khè"},
		},
		[30] = {
			[3] = {{0, 101, 30205, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh Linh Khè"},
			[4] = {{0, 101, 30206, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Th¸nh Linh Khè"},
		},
		[31] = {
			[1] = {{0, 101, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Trang"},
			[2] = {{0, 101, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Trang"},
			[3] = {{0, 101, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Trang"},
			[4] = {{0, 101, 32169, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Bµn V©n Trang"},
		},
		[32] = {
			[1] = {{0, 101, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Trang"},
			[2] = {{0, 101, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Trang"},
			[3] = {{0, 101, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Trang"},
			[4] = {{0, 101, 32170, 1, 4, -1, -1, -1, -1, -1, -1}, "ChiÕn Cuång Tr¶m Ma Trang"},
		},
	},
	tWeapon = {
		[2] = {
      [1]={{0,3,30143,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång B¨ng Thiªn §ao",1,2},
      [2]={{0,3,30144,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång B¨ng Thiªn §ao",2,2},
	   },
		[3] = {
      [1]={{0,8,30147,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång ThiÒn §Þnh Tr­îng",1,3},
      [2]={{0,8,30148,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång ThiÒn §Þnh Tr­îng",2,3},
	   },
		[4] = {
      [1]={{0,0,30145,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Th¸nh ChiÕn Thñ",1,4},
      [2]={{0,0,30146,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Th¸nh ChiÕn Thñ",2,4},
	  },
		[6] = {
      [1]={{0,1,30149,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång §o¹t Hån Ch©m",1,6},
      [2]={{0,1,30150,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång §o¹t Hån Ch©m",2,6},
      [3]={{0,1,30151,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång §o¹t Hån Ch©m",3,6},
      [4]={{0,1,30152,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång §o¹t Hån Ch©m",4,6},
	  },
		[8] = {
      [3]={{0,2,30153,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång PhËt Quang KiÕm",3,8},
      [4]={{0,2,30154,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång PhËt Quang KiÕm",4,8},
	  },
		[9] = {
      [3]={{0,10,30155,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Hé Bang CÇm",3,9},
      [4]={{0,10,30156,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Hé Bang CÇm",4,9},
	  },
		[11] = {
      [1]={{0,0,30157,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Trõng ¸c Thñ",1,11},
      [2]={{0,0,30158,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Trõng ¸c Thñ",2,11},
      [3]={{0,0,30159,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Trõng ¸c Thñ",3,11},
      [4]={{0,0,30160,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Trõng ¸c Thñ",4,11},
	  },
		[12] = {
      [1]={{0,5,30161,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång V« Cùc C«n",1,12},
      [2]={{0,5,30162,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång V« Cùc C«n",2,12},
      [3]={{0,5,30163,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång V« Cùc C«n",3,12},
      [4]={{0,5,30164,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång V« Cùc C«n",4,12},
	  },
		[14] = {
      [1]={{0,2,30165,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Khu Ma KiÕm",1,14},
      [2]={{0,2,30166,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Khu Ma KiÕm",2,14},
      [3]={{0,2,30167,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Khu Ma KiÕm",3,14},
      [4]={{0,2,30168,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Khu Ma KiÕm",4,14},
	  },
		[15] = {
      [1]={{0,9,30169,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Th­¬ng Khung Bót",1,15},
      [2]={{0,9,30170,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Th­¬ng Khung Bót",2,15},
      [3]={{0,9,30171,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Th­¬ng Khung Bót",3,15},
      [4]={{0,9,30172,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Th­¬ng Khung Bót",4,15},
	  },
		[17] = {
      [1]={{0,6,30173,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång ThÇn KÝch Th­¬ng",1,17},
      [2]={{0,6,30174,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång ThÇn KÝch Th­¬ng",2,17},
      [3]={{0,6,30175,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång ThÇn KÝch Th­¬ng",3,17},
      [4]={{0,6,30176,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång ThÇn KÝch Th­¬ng",4,17},
	  },
		[18] = {
      [1]={{0,4,30177,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Xung Thiªn Cung",1,18},
      [2]={{0,4,30178,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Xung Thiªn Cung",2,18},
      [3]={{0,4,30179,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Xung Thiªn Cung",3,18},
      [4]={{0,4,30180,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Xung Thiªn Cung",4,18},
	  },
		[20] = {
      [1]={{0,7,30181,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång LuyÖn Ngôc §ao",1,20},
      [2]={{0,7,30182,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång LuyÖn Ngôc §ao",2,20},
      [3]={{0,7,30183,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång LuyÖn Ngôc §ao",3,20},
      [4]={{0,7,30184,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång LuyÖn Ngôc §ao",4,20},
	  },
		[21] = {
      [1]={{0,11,30185,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång NhiÕp Hån Tr¶o",1,21},
      [2]={{0,11,30186,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång NhiÕp Hån Tr¶o",2,21},
      [3]={{0,11,30187,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång NhiÕp Hån Tr¶o",3,21},
      [4]={{0,11,30188,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång NhiÕp Hån Tr¶o",4,21},
	  },
		[23] = {
      [1]={{0,2,30189,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Thiªn Ph¹t KiÕm",1,23},
      [2]={{0,2,30190,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Thiªn Ph¹t KiÕm",2,23},
	  },
		[25] = {
      [1]={{0,3,30191,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Chóc Dung §ao",1,25},
      [2]={{0,3,30192,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Chóc Dung §ao",2,25},
      [3]={{0,3,30193,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Chóc Dung §ao",3,25},
      [4]={{0,3,30194,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Chóc Dung §ao",4,25},
	  },
		[26] = {
      [1]={{0,9,30195,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tö MÖnh Bót",1,26},
      [2]={{0,9,30196,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tö MÖnh Bót",2,26},
      [3]={{0,9,30197,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tö MÖnh Bót",3,26},
      [4]={{0,9,30198,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tö MÖnh Bót",4,26},
	  },
		[27] = {
      [1]={{0,11,30199,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Truy Hån Tr¶o",1,27},
      [2]={{0,11,30200,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Truy Hån Tr¶o",2,27},
      [3]={{0,11,30201,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Truy Hån Tr¶o",3,27},
      [4]={{0,11,30202,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Truy Hån Tr¶o",4,27},
	  },
		[29] = {
      [3]={{0,13,30203,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Phong Linh PhiÕn",3,29},
      [4]={{0,13,30204,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Phong Linh PhiÕn",4,29},
	  },
		[30] = {
      [3]={{0,12,30205,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Kh«ng Minh §Þch",3,30},
      [4]={{0,12,30206,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Kh«ng Minh §Þch",4,30},
	  },
	    [31] = {
	  [1]={{0,14,32217,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Bµn V©n Chñy",1,31},
	  [2]={{0,14,32217,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Bµn V©n Chñy",2,31},
	  [3]={{0,14,32217,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Bµn V©n Chñy",3,31},
	  [4]={{0,14,32217,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Bµn V©n Chñy",4,31},
	  },
		[32] = {
      [1]={{0,2,32218,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tr¶m Ma KiÕm",1,32},
      [2]={{0,2,32218,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tr¶m Ma KiÕm",2,32},
      [3]={{0,2,32218,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tr¶m Ma KiÕm",3,32},
      [4]={{0,2,32218,1,4,-1,-1,-1,-1,-1,-1}, "ChiÕn Cuång Tr¶m Ma KiÕm",4,32},
	  },
	},
}

function OnUse(nItem)
	Say(format("§ång ý dïng %s kh«ng?", GetItemName(nItem)), 
		2, format("X¸c ®Þnh më/#OpenZhankuangBox(%d)", nItem), "T¹i h¹ chØ xem qua th«i/nothing");
end

function OpenZhankuangBox(nItem, nType)
	if gf_Judge_Room_Weight(1, 215, " ") ~= 1 then
		return 0;
	end
	local nP = tonumber(GetItemParticular(nItem));
	local t = nil;
	if nP == 31003 then
		local tEquip = ZHANKUANG_BOX.tWeapon;
		local nRoute = GetPlayerRoute();
		local nBody = GetBody();
		if not tEquip[nRoute] then return 0 end
		t = tEquip[nRoute][nBody];
	elseif nP == 31002 then
		if not nType then
			local tSay = {
				format("§Çu/#OpenZhankuangBox(%d, 1)", nItem),
				format("Th­îng y/#OpenZhankuangBox(%d, 2)", nItem),
				format("H¹ y/#OpenZhankuangBox(%d, 3)", nItem),
				"\nT«i chØ xem xem th«i/nothing",
			}
			Say(format("Chän vÞ trÝ phßng cô:", GetItemName(nItem)), getn(tSay), tSay);
			return 0;
		end
		local tEquip = {ZHANKUANG_BOX.tHead, ZHANKUANG_BOX.tCloth, ZHANKUANG_BOX.tShoe};
		local tEquipSub = tEquip[nType];
		local nRoute = GetPlayerRoute();
		local nBody = GetBody();
		if not tEquipSub[nRoute] then return 0 end
		t = tEquipSub[nRoute][nBody];
	end
	if not t then return 0; end
	if DelItemByIndex(nItem, 1) ~= 1 then
		return 0;
	end
	AddItem(unpack(t[1]));
	Msg2Player(format("§· nhËn ®­îc %s*%d", t[2], 1));
end