VET_STR_201103_OPERATING_LOG_TITLE = "Hoat dong thang 4 nam 2011";

VET_TB_201103_OPERATING_LOG_ACTION_LIST = 
{
	"NhËn online",
	"§æi %s",
	"NhËn ®­îc phÇn th­ëng cuèi",
	"PhÇn th­ëng sö dông %s",
	"PhÇn th­ëng ®Æc thï (%d) sö dông %s ",
	"§æi B¸nh Ch­ng b»ng Xu",
	"NhËn th­ëng max event lo¹i %d",
};

VET_TB_201103_OPERATING_DLG = 
{
	"Sù kiÖn chµo mõng ngµy giç tæ Hïng V­¬ng diÔn ra tõ ngµy <color=yellow>1/04/2011 ®Õn 24h00 ngµy 17/04/2011<color>. Chi tiÕt xem t¹i trang chñ <color=red>https://volam2.zing.vn<color>",
	"Event Giç Tæ Hïng V­¬ng",
	"§æi %s (cÇn %d %s + %d %s)",
	"NhËn phÇn th­ëng cuèi",
	"Chän h×nh thøc nhËn th­ëng",
	"§æi %d %s (cÇn %d %s)",
	"Nguyªn liÖu mang theo kh«ng ®ñ",
	"HiÖn t¹i c¸c h¹ sö dông <color=yellow>%s<color> sè l­îng lµ: <color=green>[%d/%d]<color>",
	"PhÇn th­ëng 20.000.000 Exp vµ vËt phÈm",
	"PhÇn th­ëng 20 ®iÓm n©ng cÊp b¹n ®ång hµnh vµ vËt phÈm",
	"PhÇn th­ëng 1 ®iÓm Linh Lùc b¹n ®ång hµnh vµ vËt phÈm ",
	"Tho¸t",
	"Chän 1 phÇn th­ëng",
	"C¸c h¹ ®· nhËn phÇn th­ëng nµy",
	"KÝch ho¹t nhËn th­ëng kh«ng nhËn vËt phÈm (t¨ng thªm 25% kinh nghiÖm)",
	"KÝch ho¹t nhËn th­ëng nhËn vËt phÈm",
	"Vui lßng chän h×nh thøc nhËn th­ëng",
	"HiÖn ®ang kÝch ho¹t nhËn th­ëng <color=yellow>%s<color> kh«ng nhËn vËt phÈm (t¨ng thªm <color=green>%s<color> ®iÓm kinh nghiÖm)",
	"HiÖn ®ang kÝch ho¹t nhËn th­ëng <color=yellow>%s<color> nhËn thªm vËt phÈm",
	"C¸c h¹ kh«ng mang theo <color=yellow>%s<color>",
	"25%",
	"VËt phÈm ®· qu¸ h¹n sö dông",
}

VET_TB_201103_OPERATING_ITEM_TITLE = 
{
	"B¸nh ch­ng",
	"B¸nh ch­ng h¶o h¹ng",
	"Tói nguyªn liÖu",
	"Xu",
	"BÝ quyÕt b¸nh ch­ng",
	"§¹i ng©n phiÕu",
	"L¸ gãi b¸nh",
}

VET_TB_201103_OPERATING_EXCHANGE_MATERIAL = 
{
	[1] = 
	{
		{"Tói nguyªn liÖu", 2, 1, 30290,5},
		{"Xu", 2, 1, 30230,2},
	},
	[2] = 
	{
		{"Tói nguyªn liÖu", 2, 1, 30290,5},
		{"L¸ gãi b¸nh", 2, 1, 30291,1},
	},
}

VET_TB_201103_OPERATING_EXCHANGE_ADV_MATERIAL = 
{
	{"B¸nh ch­ng", 2, 1, 30293,1},
	{"BÝ quyÕt b¸nh ch­ng", 2, 1, 30292,1},
}

VET_TB_201103_OPERATING_FINAL_AWARD = 
{
	{31, 5, "VET_201103_Operating_GetFYAward()", ""},
	{31, 5, "VET_201103_Operating_GetShimenWeaponAward()", ""},
	{31, 5, "VET_201103_Operating_GetShimenEquipAward()", ""},
	{1, 1, "Thiªn Qu¸i Th¹ch", {2, 0, 1084, 1}},
	{1, 100, "ChiÕn ThÇn hoµn", {2, 1, 1005, 1}, 7 * 24 * 3600},
	{1, 10, "Phi Yªn Th¹ch", {2, 1, 30130, 1}},
	{1, 50, "Tö Quang ThÇn Th¹ch", {2, 1, 30131, 1}},
	{1, 10, "Long Tö Bèi", {2, 1, 30155, 1}},
	{1, 10, "Phông Tö Bèi", {2, 1, 30156, 1}},
	{1, 10, "¦ng Tö Bèi", {2, 1, 30158, 1}},
	{1, 300, "Nh©n S©m V¹n N¨m", {2, 1, 30071, 2}},
	{1, 1, "§Þnh Hån Thiªn Th¹ch ThÇn Th¹ch", {2, 1, 1067, 1}, 7 * 24 * 3600},
	{1, 10, "Thiªn Th¹ch Tinh Th¹ch", {2, 1, 1009, 1}},	
	{1, 5, "Thiªn Th¹ch linh th¹ch", {2, 1, 1068, 1}},
	{1, 1, "L¨ng Ba Vi Bé", {0, 112, 78, 1}},
	{1, 50, "Hoµng Kim §¹i Hång Bao (trèng)", {2, 1, 538, 1}, 7 * 24 * 3600},
	{32, 422, 7000, 1},
	{1, 5, "Th¸i DÞch Hçn Nguyªn Phæ", {2, 0, 1083, 1}}
}

-- base 10000
VET_TB_201103_OPERATING_FY_AWARD = 
{
	{1, 675, "Ph¸ Yªn ®ao", {0, 3, 6001, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Ph¸ Yªn c«n", {0, 5, 6002, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Phï Yªn tr­îng", {0, 8, 6003, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Hµm Yªn thñ", {0, 0, 6004, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Tµng Yªn ch©m", {0, 1, 6005, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Phi Yªn kiÕm", {0, 2, 6006, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "VËn Yªn cÇm", {0, 10, 6007, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "V©n Yªn thñ", {0, 0, 6008, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "L­u Yªn c«n", {0, 5, 6009, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "HuyÒn Yªn kiÕm", {0, 2, 6010, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Vò Yªn bót", {0, 9, 6011, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Hµ Tiªm Th­¬ng", {0, 6, 6012, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 675, "Hµnh Yªn Cung", {0, 4, 6013, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 625, "Träc Yªn nhÉn", {0, 7, 6014, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 600, "Yªu Yªn tr¶o", {0, 11, 6015, 1, 1, -1, -1, -1, -1, -1, -1}}
};

-- base 10000
VET_TB_201103_OPERATING_SHIMEN_EQUIP_AWARD = 
{
	{1, 20, "B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 21219, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 21229, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 21239, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "B¹ch V« Th­êng Ngôy §éc Y", {0, 100, 21249, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Thiªn Long B¸t Bé Kh¶i Gi¸p", {0, 100, 231, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Thiªn Long B¸t Bé Kh¶i Gi¸p", {0, 100, 232, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "V« L­îng Ph¸p T«n ThiÒn §Þnh Bµo", {0, 100, 331, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "V« L­îng Ph¸p T«n ThiÒn §Þnh Bµo", {0, 100, 332, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "B¸t B¶o La H¸n §¹i Thõa Kh¶i Gi¸p ", {0, 100, 431, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "B¸t B¶o La H¸n §¹i Thõa Kh¶i Gi¸p ", {0, 100, 432, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu C©n", {0, 100, 631, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu C©n", {0, 100, 632, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu C©n", {0, 100, 633, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu C©n", {0, 100, 634, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "B¹ch Liªn Tiªn Tö B¶o Èn Y", {0, 100, 831, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "B¹ch Liªn Tiªn Tö B¶o Èn Y", {0, 100, 832, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Ngäc VËn Tiªn Tö HuyÒn Hån Y", {0, 100, 931, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Ngäc VËn Tiªn Tö HuyÒn Hån Y", {0, 100, 932, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Y", {0, 100, 1131, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Y", {0, 100, 1132, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Y", {0, 100, 1133, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Y", {0, 100, 1134, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du Y", {0, 100, 1231, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du Y", {0, 100, 1232, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du Y", {0, 100, 1233, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du Y", {0, 100, 1234, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Ch­ëng Kinh Thanh Quang Bµo", {0, 100, 1431, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Ch­ëng Kinh Thanh Quang Bµo", {0, 100, 1432, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Ch­ëng Kinh Thanh Quang Bµo", {0, 100, 1433, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Ch­ëng Kinh Thanh Quang Bµo", {0, 100, 1434, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Phôc", {0, 100, 1531, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Phôc", {0, 100, 1532, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Phôc", {0, 100, 1533, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Phôc", {0, 100, 1534, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long T­¬ng Ngao KhÝ ChiÕn kh¶i", {0, 100, 1731, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long T­¬ng Ngao KhÝ ChiÕn kh¶i", {0, 100, 1732, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long T­¬ng Ngao KhÝ ChiÕn kh¶i", {0, 100, 1733, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 20, "Long T­¬ng Ngao KhÝ ChiÕn kh¶i", {0, 100, 1734, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "Hæ Dùc M·nh Sü ChiÕn kh¶i", {0, 100, 1831, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "Hæ Dùc M·nh Sü ChiÕn kh¶i", {0, 100, 1832, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "Hæ Dùc M·nh Sü ChiÕn kh¶i", {0, 100, 1833, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "Hæ Dùc M·nh Sü ChiÕn kh¶i", {0, 100, 1834, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "U Minh Quû S¸t Tu La HuyÕt Y", {0, 100, 2031, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "U Minh Quû S¸t Tu La HuyÕt Y", {0, 100, 2032, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "U Minh Quû S¸t Tu La HuyÕt Y", {0, 100, 2033, 1, 1, -1, -1, -1, -1, -1, -1}},	
	{1, 30, "U Minh Quû S¸t Tu La HuyÕt Y", {0, 100, 2034, 1, 1, -1, -1, -1, -1, -1, -1}}	
};

VET_TB_201103_OPERATING_SHIMEN_WEAPON_AWARD = 
{
	{1, 20, "B¹ch V« Th­êng Quû §éc Tr¶o", {0, 11, 21219, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¹ch V« Th­êng Quû §éc Tr¶o", {0, 11, 21229, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¹ch V« Th­êng Quû §éc Tr¶o", {0, 11, 21239, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¹ch V« Th­êng Quû §éc Tr¶o", {0, 11, 21249, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¸t Bé Thiªn Long Thiªn Chóng §ao", {0, 3, 231, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¸t Bé Thiªn Long Thiªn Chóng §ao", {0, 3, 232, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¸t Bé Thiªn Long Thiªn Chóng C«n", {0, 5, 231, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¸t Bé Thiªn Long Thiªn Chóng C«n", {0, 5, 232, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "V« L­îng Ph¸p T«n ThiÒn Tr­îng", {0, 8, 331, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "V« L­îng Ph¸p T«n ThiÒn Tr­îng", {0, 8, 332, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¸t B¶o La H¸n §¹i Thõa Thñ", {0, 0, 431, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¸t B¶o La H¸n §¹i Thõa Thñ", {0, 0, 432, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu Ch©m", {0, 1, 631, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu Ch©m", {0, 1, 632, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu Ch©m", {0, 1, 633, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Thiªn C¬ Sø Gi¶ ThÇn TriÖu Ch©m", {0, 1, 634, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¹ch Liªn Tiªn Tö B¶o UÈn KiÕm", {0, 2, 831, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "B¹ch Liªn Tiªn Tö B¶o UÈn KiÕm", {0, 2, 832, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Ngäc VËn Tiªn Tö HuyÒn Hån CÇm", {0, 10, 931, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Ngäc VËn Tiªn Tö HuyÒn Hån CÇm", {0, 10, 932, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Thñ", {0, 0, 1131, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Thñ", {0, 0, 1132, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Thñ", {0, 0, 1133, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long §Çu ThÇn C¸i §»ng V©n Thñ", {0, 0, 1134, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du C«n", {0, 5, 1231, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du C«n", {0, 5, 1232, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du C«n", {0, 5, 1233, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "KhÊt Thiªn ThÇn C¸i V©n Du C«n", {0, 5, 1234, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Ch­ëng Kinh Thanh Quang KiÕm", {0, 2, 1431, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Ch­ëng Kinh Thanh Quang KiÕm", {0, 2, 1432, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Ch­ëng Kinh Thanh Quang KiÕm", {0, 2, 1433, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Ch­ëng Kinh Thanh Quang KiÕm", {0, 2, 1434, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Bót", {0, 9, 1531, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Bót", {0, 9, 1532, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Bót", {0, 9, 1533, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Th¸i Êt T¶n Nh©n H¹o Nhiªn Bót", {0, 9, 1534, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long T­¬ng T­íng Qu©n Th­¬ng", {0, 6, 1731, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long T­¬ng T­íng Qu©n Th­¬ng", {0, 6, 1732, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long T­¬ng T­íng Qu©n Th­¬ng", {0, 6, 1733, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Long T­¬ng T­íng Qu©n Th­¬ng", {0, 6, 1734, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Hæ Dùc T­íng Qu©n Cung", {0, 4, 1831, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Hæ Dùc T­íng Qu©n Cung", {0, 4, 1832, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Hæ Dùc T­íng Qu©n Cung", {0, 4, 1833, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 20, "Hæ Dùc T­íng Qu©n Cung", {0, 4, 1834, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 30, "U Minh Quû S¸t Tu La NhÉn", {0, 7, 2031, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 30, "U Minh Quû S¸t Tu La NhÉn", {0, 7, 2032, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 30, "U Minh Quû S¸t Tu La NhÉn", {0, 7, 2033, 1, 1, -1, -1, -1, -1, -1, -1}},
	{1, 30, "U Minh Quû S¸t Tu La NhÉn", {0, 7, 2034, 1, 1, -1, -1, -1, -1, -1, -1}}
};

VET_TB_201103_OPERATING_ITEM_LOGINGIVE_LIST = 
{
    [1] = {"CÈm Nang §¹i Sù KiÖn", 2, 1, 30045},
};

VET_TB_201103_OPERATING_NOMAL_AWARD = 
{
	{3, 250, 10000, 1},
	{1, 100, "Thiªn th¹ch", {2, 2, 8, 1}},
	{1, 60, "M¶nh Thiªn th¹ch", {2, 2, 7, 1}},
	{1, 5, "ThÕ Th©n phï", {2, 0, 556, 1}, 7 * 24 * 3600},
	{1, 20, "B¸t Nh· Chøng Th­", {2, 1, 30114, 1}, 7 * 24 * 3600},
	{1, 20, "C©y B¸t Nh· nhá", {2, 0, 504, 1}, 7 * 24 * 3600},
	{1, 10, "C©y B¸t Nh·", {2, 0, 398, 1}, 7 * 24 * 3600},
	{4, 200, 10, 1},
	{5, 140, 10, 1},
	{1, 5, "Thiªn Hµ MËt tÞch", {0, 107, 64, 1}},
	{1, 5, "Tö Hµ MËt tÞch", {0, 107, 65, 1}},
	{1, 5, "Chiªm Y Phæ", {0, 107, 66, 1}},
	{1, 20, "Tu Ch©n YÕu QuyÕt", {2, 0, 554, 1}, 7 * 24 * 3600},
	{1, 10, "TiÓu Nh©n s©m qu¶", {2, 0, 552, 1}, 7 * 24 * 3600},
	{1, 5, "§ång TiÒn Vµng", {2, 1, 30094,1}},
	{1, 10, "§é NguyÖt ThÇn Sa", {2, 1, 3332, 1}},
	{1, 100, "XÝch ThiÕt Tinh", {2, 1, 2652, 1}},
	{1, 35, "Th¸i DÞch Hçn Nguyªn C«ng §å", {2, 0, 1082, 1}},
};

VET_TB_201103_OPERATING_SP_AWARD = 
{
	{8, 1800, 60, 1},
	{15, 1800, 60, 1},
	{12, 1800, 60, 1},
	{1, 300, "Sæ tay sèng", {2, 19, 1, 1}, 7 * 24 * 3600},
	{1, 300, "C¬ quan nh©n", {2, 1, 1011, 1}, 7 * 24 * 3600},
	{1, 500, "V« NgÊn Thñy", {2, 1, 503, 1}, 7 * 24 * 3600},
	{1, 500, "TÈy Tñy ®¬n", {2, 0, 136, 1}, 7 * 24 * 3600},
	{1, 100, "TÈy Tñy linh ®¬n", {2, 0, 137, 1}, 7 * 24 * 3600},
	{1, 1049, "§Êu hån", {2, 1, 1157, 1}, 7 * 24 * 3600},
	{1, 1000, "R­¬ng BÝ KÝp", {2, 1, 30093, 1}, 7 * 24 * 3600},
	{1, 1, "Qu©n C«ng Huy Hoµng", {2, 1, 9977, 1}, 7 * 24 * 3600},
	{1, 50, "Qu©n C«ng §¹i", {2, 1, 9998, 1}, 7 * 24 * 3600},
	{1, 400, "Qu©n C«ng Ch­¬ng", {2, 1, 9999, 1}, 7 * 24 * 3600},
	{1, 400, "NguyÖt Hoa Chi Tinh", {2, 1, 3219, 1}},
};

--²½·ÇÑÌÎäÆ÷,È«²¿Ëæ»ú,ËùÒÔÃ»°²ÅÅÁ÷ÅÉÅÐ¶Ï,Ö±½Ó¸´ÖÆÓÚÀúÊ·½Å±¾,ÒªÓÃµÄ»°ÐèÒªÌí¼ÓÊýÁ¿ºÍ6¸ö-1ÊôÐÔ²ÎÊý
VET_TB_201103_OPERATING_BFY_WEAPON = 
{
    {"Ph¸ Yªn ®ao", {0, 3, 6001, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Ph¸ Yªn c«n", {0, 5, 6002, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Phï Yªn tr­îng", {0, 8, 6003, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Hµm Yªn thñ", {0, 0, 6004, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Tµng Yªn ch©m", {0, 1, 6005, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Phi Yªn kiÕm", {0, 2, 6006, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"VËn Yªn cÇm", {0, 10, 6007, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"V©n Yªn thñ", {0, 0, 6008, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"L­u Yªn c«n", {0, 5, 6009, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"HuyÒn Yªn kiÕm", {0, 2, 6010, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Vò Yªn bót", {0, 9, 6011, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Hµ Tiªm Th­¬ng", {0, 6, 6012, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Hµnh Yªn Cung", {0, 4, 6013, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Träc Yªn nhÉn", {0, 7, 6014, 1, 1, -1, -1, -1, -1, -1, -1}},
    {"Yªu Yªn tr¶o", {0, 11, 6015, 1, 1, -1, -1, -1, -1, -1, -1}},
};
