Include("\\script\\class\\ktabfile.lua");
Include("\\script\\lib\\getrectangle_point.lua") --获得矩形点

tbWuLinMeng = {}

tbWuLinMeng.tbDialogNpc	= 
{
	--武林盟相关
	{"中原马车船夫","武林盟车夫",425,1741,3231,"\\script\\tong\\npc_chehu.lua"},
--	{"吐蕃马车船夫","西域车夫",425,1744,3204,"\\script\\西南区\\武林盟\\npc\\西域车夫.lua"},
--	{"老板娘","天工巧手刘诗英",425,1676,3223,"\\script\\西南区\\武林盟\\npc\\天工巧手刘诗英.lua"},
	{"宝珠金刚","少林宝珠金刚",425,1658,3216,"\\script\\西南区\\武林盟\\npc\\少林宝珠金刚.lua"},
	{"杨三宝","杨家军教头杨三宝",425,1645,3223,"\\script\\西南区\\武林盟\\npc\\杨家军教头杨三宝.lua"},
	{"陈卓浩","武当玉面书生陈卓浩",425,1642,3227,"\\script\\西南区\\武林盟\\npc\\武当玉面书生陈卓浩.lua"},
	{"中原储物柜","物品管理员",425,1691,3230,"\\script\\西南区\\武林盟\\npc\\物品管理员.lua"},
	{"武林盟护卫","武林盟护卫",425,1702,3236,"\\script\\西南区\\武林盟\\npc\\武林盟护卫.lua"},
	{"武林盟护卫","武林盟护卫",425,1717,3250,"\\script\\西南区\\武林盟\\npc\\武林盟护卫.lua"},
	{"武林盟护卫","武林盟护卫",425,1836,3150,"\\script\\西南区\\武林盟\\npc\\武林盟护卫.lua"},
	{"武林盟护卫","武林盟护卫",425,1844,3157,"\\script\\西南区\\武林盟\\npc\\武林盟护卫.lua"},
	{"中原当铺老板","杂货商",425,1723,3258,"\\script\\西南区\\武林盟\\npc\\杂货商.lua"},
	{"中原药店掌柜","药店老板",425,1734,3273,"\\script\\西南区\\武林盟\\npc\\药店老板.lua"},
	{"仲开嵘","丐帮刑堂长老仲开嵘",425,1739,3300,"\\script\\西南区\\武林盟\\npc\\丐帮刑堂长老仲开嵘.lua"},
	{"秦无命","五毒左护法秦无命",425,1720,3299,"\\script\\西南区\\武林盟\\npc\\五毒左护法秦无命.lua"},
	{"唐梦琳","唐门玉面蜘蛛唐梦琳",425,1705,3314,"\\script\\西南区\\武林盟\\npc\\唐门玉面蜘蛛唐梦琳.lua"},
	{"扶苏公子","扶苏公子",425,1672,3171,"\\script\\西南区\\武林盟\\npc\\扶苏公子.lua"},
	{"武林盟范姐","武林盟范姐",425,1762,3154,"\\script\\西南区\\武林盟\\npc\\武林盟范姐.lua"},
	{"熊霸天","明教金毛狮王熊霸天",425,1719,3128,"\\script\\西南区\\武林盟\\npc\\明教金毛狮王熊霸天.lua"},
	{"萧楚楚","翠烟绿衣仙子萧楚楚",425,1751,3099,"\\script\\西南区\\武林盟\\npc\\翠烟绿衣仙子萧楚楚.lua"},
	{"百晓生","武林盟长老百晓生",425,1787,3151,"\\script\\西南区\\武林盟\\npc\\武林盟长老百晓生.lua"},
	{"叶子丘","藏剑少主叶子丘",425,1788,3181,"\\script\\西南区\\武林盟\\npc\\藏剑少主叶子丘.lua"},
	{"铁面","四大名捕之铁面",425,1792,3185,"\\script\\西南区\\武林盟\\npc\\四大名捕之铁面.lua"},
	{"诸葛棋","益宝斋主管诸葛棋",425,1791,3237,"\\script\\西南区\\武林盟\\npc\\益宝斋主管诸葛棋.lua"},
	{"吴不维","昆仑紫霄天师吴不维",425,1852,3190,"\\script\\西南区\\武林盟\\npc\\昆仑紫霄天师吴不维.lua"},
	{"冰心","四大名捕之冰心",425,1857,3194,"\\script\\西南区\\武林盟\\npc\\四大名捕之冰心.lua"},

}
