Include("\\script\\vng\\lib\\vnglib_award.lua");
szNpcName = "<color=green>Häc trß thî rÌn L­u: <color>"
DOIPHE_UYHO_NGUYENSOAI_FILE = "\\script\\vng\\weapon_upgrade\\doiphetrangbi_uyhonguyensoai.lua"; --®æi phe trang bÞ uy hæ nguyªn so¸i
DOIPHE_VUKHI_UYHO_NGUYENSOAI_FILE = "\\script\\vng\\weapon_upgrade\\doiphetrangbivukhi_uyhonguyensoai.lua";
tbUyHo_DoiPhe = { --Uy Hæ T­íng
	[0] = {
		[100] = {
			[32193] = {1,32237},	-- {Material, nP}, tèng ==> liªu
			[32194] = {1,32238},
			[32195] = {1,32239},
			[32196] = {1,32240},
			[32197] = {1,32241},
			[32198] = {1,32242},
			[32199] = {1,32243},
			[32200] = {1,32244},
			[32201] = {1,32245},
			[32202] = {1,32246},
			[32203] = {1,32247},
			[32204] = {1,32248},
			[32205] = {1,32249},
			[32206] = {1,32250},
			[32207] = {1,32251},
			[32208] = {1,32252},
			[32209] = {1,32253},
			[32210] = {1,32254},
			[32211] = {1,32255},
			[32212] = {1,32256},
			[32213] = {1,32257},
			[32214] = {1,32258},
			[32237] = {1,32193},	-- liªu ==> tèng
			[32238] = {1,32194},
			[32239] = {1,32195},
			[32240] = {1,32196},
			[32241] = {1,32197},
			[32242] = {1,32198},
			[32243] = {1,32199},
			[32244] = {1,32200},
			[32245] = {1,32201},
			[32246] = {1,32202},
			[32247] = {1,32203},
			[32248] = {1,32204},
			[32249] = {1,32205},
			[32250] = {1,32206},
			[32251] = {1,32207},
			[32252] = {1,32208},
			[32253] = {1,32209},
			[32254] = {1,32210},
			[32255] = {1,32211},
			[32256] = {1,32212},
			[32257] = {1,32213},
			[32258] = {1,32214},
		},
		[101] = {
			[32193] = {1,32237},	-- {Material, nP}, tèng ==> liªu
			[32194] = {1,32238},
			[32195] = {1,32239},
			[32196] = {1,32240},
			[32197] = {1,32241},
			[32198] = {1,32242},
			[32199] = {1,32243},
			[32200] = {1,32244},
			[32201] = {1,32245},
			[32202] = {1,32246},
			[32203] = {1,32247},
			[32204] = {1,32248},
			[32205] = {1,32249},
			[32206] = {1,32250},
			[32207] = {1,32251},
			[32208] = {1,32252},
			[32209] = {1,32253},
			[32210] = {1,32254},
			[32211] = {1,32255},
			[32212] = {1,32256},
			[32213] = {1,32257},
			[32214] = {1,32258},
			[32237] = {1,32193},	-- liªu ==> tèng
			[32238] = {1,32194},
			[32239] = {1,32195},
			[32240] = {1,32196},
			[32241] = {1,32197},
			[32242] = {1,32198},
			[32243] = {1,32199},
			[32244] = {1,32200},
			[32245] = {1,32201},
			[32246] = {1,32202},
			[32247] = {1,32203},
			[32248] = {1,32204},
			[32249] = {1,32205},
			[32250] = {1,32206},
			[32251] = {1,32207},
			[32252] = {1,32208},
			[32253] = {1,32209},
			[32254] = {1,32210},
			[32255] = {1,32211},
			[32256] = {1,32212},
			[32257] = {1,32213},
			[32258] = {1,32214},
		},
		[103] = {
			[32193] = {1,32237},	-- {Material, nP}, tèng ==> liªu
			[32194] = {1,32238},
			[32195] = {1,32239},
			[32196] = {1,32240},
			[32197] = {1,32241},
			[32198] = {1,32242},
			[32199] = {1,32243},
			[32200] = {1,32244},
			[32201] = {1,32245},
			[32202] = {1,32246},
			[32203] = {1,32247},
			[32204] = {1,32248},
			[32205] = {1,32249},
			[32206] = {1,32250},
			[32207] = {1,32251},
			[32208] = {1,32252},
			[32209] = {1,32253},
			[32210] = {1,32254},
			[32211] = {1,32255},
			[32212] = {1,32256},
			[32213] = {1,32257},
			[32214] = {1,32258},
			[32237] = {1,32193},	-- liªu ==> tèng
			[32238] = {1,32194},
			[32239] = {1,32195},
			[32240] = {1,32196},
			[32241] = {1,32197},
			[32242] = {1,32198},
			[32243] = {1,32199},
			[32244] = {1,32200},
			[32245] = {1,32201},
			[32246] = {1,32202},
			[32247] = {1,32203},
			[32248] = {1,32204},
			[32249] = {1,32205},
			[32250] = {1,32206},
			[32251] = {1,32207},
			[32252] = {1,32208},
			[32253] = {1,32209},
			[32254] = {1,32210},
			[32255] = {1,32211},
			[32256] = {1,32212},
			[32257] = {1,32213},
			[32258] = {1,32214},
		},
		[102] = {
			[31608] = {2,31762},
			[31609] = {2,31763},
			[31610] = {2,31764},
			[31611] = {2,31765},
			[31612] = {2,31766},
			[31613] = {2,31767},
			[31614] = {2,31768},
			[31615] = {2,31769},
			[31616] = {2,31770},            
			[31617] = {2,31771},
			[31618] = {2,31772},
			[31619] = {2,31773},
			[31620] = {2,31774},
			[31621] = {2,31775},
			[31622] = {2,31776},
			[31623] = {2,31777},
			[31624] = {2,31778},
			[31625] = {2,31779},
			[31626] = {2,31780},
			[31627] = {2,31781},
			[31628] = {2,31782},
			[31629] = {2,31783},
			[31630] = {2,31784},
			[31631] = {2,31785},
			[31632] = {2,31786},
			[31633] = {2,31787},
			[31634] = {2,31788},
			[31635] = {2,31789},
			[31636] = {2,31790},
			[31637] = {2,31791},
			[31638] = {2,31792},
			[31639] = {2,31793},
			[31640] = {2,31794},
			[31641] = {2,31795},
			[31642] = {2,31796},
			[31643] = {2,31797},
			[31644] = {2,31798},
			[31645] = {2,31799},
			[31646] = {2,31800},
			[31647] = {2,31801},
			[31648] = {2,31802},
			[31649] = {2,31803},
			[31650] = {2,31804},
			[31651] = {2,31805},
			[31652] = {2,31806},
			[31653] = {2,31807},
			[31654] = {2,31808},
			[31655] = {2,31809},
			[31656] = {2,31810},
			[31657] = {2,31811},
			[31658] = {2,31812},
			[31659] = {2,31813},
			[31660] = {2,31814},
			[31661] = {2,31815},
			[31662] = {2,31816},
			[31663] = {2,31817},
			[31664] = {2,31818},
			[31665] = {2,31819},
			[31666] = {2,31820},
			[31667] = {2,31821},
			[31668] = {2,31822},
			[31669] = {2,31823},
			[31670] = {2,31824},
			[31671] = {2,31825},
			[31672] = {2,31826},
			[31673] = {2,31827},
			[31674] = {2,31828},
			[31675] = {2,31829},
			[31676] = {2,31830},
			[31677] = {2,31831},
			[31678] = {2,31832},
			[31679] = {2,31833},
			[31680] = {2,31834},
			[31681] = {2,31835},
			[31682] = {2,31836},
			[31683] = {2,31837},
			[31684] = {2,31838},
			[31685] = {2,31839},
			[31686] = {2,31840},
			[31687] = {2,31841},
			[31688] = {2,31842},
			[31689] = {2,31843},
			[31690] = {2,31844},
			[31691] = {2,31845},
			[31692] = {2,31846},
			[31693] = {2,31847},
			[31694] = {2,31848},
			[31695] = {2,31849},		

			[31762] = {2,31608},
			[31763] = {2,31609},
			[31764] = {2,31610},
			[31765] = {2,31611},
			[31766] = {2,31612},
			[31767] = {2,31613},
			[31768] = {2,31614},
			[31769] = {2,31615},
			[31770] = {2,31616},            
			[31771] = {2,31617},
			[31772] = {2,31618},
			[31773] = {2,31619},
			[31774] = {2,31620},
			[31775] = {2,31621},
			[31776] = {2,31622},
			[31777] = {2,31623},
			[31778] = {2,31624},
			[31779] = {2,31625},
			[31780] = {2,31626},
			[31781] = {2,31627},
			[31782] = {2,31628},
			[31783] = {2,31629},
			[31784] = {2,31630},
			[31785] = {2,31631},
			[31786] = {2,31632},
			[31787] = {2,31633},
			[31788] = {2,31634},
			[31789] = {2,31635},
			[31790] = {2,31636},
			[31791] = {2,31637},
			[31792] = {2,31638},
			[31793] = {2,31639},
			[31794] = {2,31640},
			[31795] = {2,31641},
			[31796] = {2,31642},
			[31797] = {2,31643},
			[31798] = {2,31644},
			[31799] = {2,31645},
			[31800] = {2,31646},
			[31801] = {2,31647},
			[31802] = {2,31648},
			[31803] = {2,31649},
			[31804] = {2,31650},
			[31805] = {2,31651},
			[31806] = {2,31652},
			[31807] = {2,31653},
			[31808] = {2,31654},
			[31809] = {2,31655},
			[31810] = {2,31656},
			[31811] = {2,31657},
			[31812] = {2,31658},
			[31813] = {2,31659},
			[31814] = {2,31660},
			[31815] = {2,31661},
			[31816] = {2,31662},
			[31817] = {2,31663},
			[31818] = {2,31664},
			[31819] = {2,31665},
			[31820] = {2,31666},
			[31821] = {2,31667},
			[31822] = {2,31668},
			[31823] = {2,31669},
			[31824] = {2,31670},
			[31825] = {2,31671},
			[31826] = {2,31672},
			[31827] = {2,31673},
			[31828] = {2,31674},
			[31829] = {2,31675},
			[31830] = {2,31676},
			[31831] = {2,31677},
			[31832] = {2,31678},
			[31833] = {2,31679},
			[31834] = {2,31680},
			[31835] = {2,31681},
			[31836] = {2,31682},
			[31837] = {2,31683},
			[31838] = {2,31684},
			[31839] = {2,31685},
			[31840] = {2,31686},
			[31841] = {2,31687},
			[31842] = {2,31688},
			[31843] = {2,31689},
			[31844] = {2,31690},
			[31845] = {2,31691},
			[31846] = {2,31692},
			[31847] = {2,31693},
			[31848] = {2,31694},
			[31849] = {2,31695},
			
		},
	},
}
function DoiPhe_UyHoNguyenSoai_Menu()
	local strtab = {

		}

	tinsert(strtab,"ChuyÓn ®æi trang bÞ Nãn, ¸o, QuÇn Uy Hæ Nguyªn So¸i/#DoiPhe_UyHoNguyenSoai(1)")
	tinsert(strtab,"ChuyÓn ®æi trang bÞ Kú, HiÖu, Phï Uy Hæ Nguyªn So¸i/#DoiPhe_UyHoNguyenSoai(2)")
	tinsert(strtab,"ChuyÓn ®æi trang bÞ Vò KhÝ Uy Hæ Nguyªn So¸i/DoiPhe_VuKhi_UyHoNguyenSoai")
	
	tinsert(strtab,"Ta chØ ®Õn th¨m «ng th«i!/nothing")
	Say("<color=green>§Ö tö thî rÌn L­u<color>: Ta cã thÓ gióp ®¹i hiÖp chuyÓn ®æi trang bÞ Uy Hæ T­íng tõ phe Tèng sang Liªu hoÆc tõ phe Liªu sang Tèng. <color=red>L­u ý, ®¹i hiÖp sÏ ph¶i ®ôc lç vµ kh¶m §¸ Quý l¹i tõ ®©u.<color>",
		getn(strtab),
		strtab);
end
function DoiPhe_VuKhi_UyHoNguyenSoai()
	local nNguyenLieu = {--Thiªn M«n Kim LÖnh, Thiªn Cang LÖnh
								[1] = {{2,1,30370,15}, {2,95,204,15}}, 
							}
	local nCount1 = GetItemCount(2,1,30370)
	local nCount2 = GetItemCount(2,95,204)						
	if nCount1 < nNguyenLieu[1][1][4] then
		Talk(1, "", szNpcName .. "B¹n kh«ng cã ®ñ "..nNguyenLieu[1][1][4].." Thiªn M«n Kim LÖnh ®Ó chuyÓn ®æi trang bÞ Uy Hæ.")
		return 0
	end						
	if nCount2 < nNguyenLieu[1][2][4] then
		Talk(1, "", szNpcName .. "B¹n kh«ng cã ®ñ "..nNguyenLieu[1][2][4].." Thiªn Cang LÖnh ®Ó chuyÓn ®æi trang bÞ Uy Hæ.")
		return 0
	end					
--	if nCount3 < nNguyenLieu[1][3][4] then
--		Talk(1, "", szNpcName .. "B¹n kh«ng cã ®ñ Cöu Thiªn V« Cùc §¬n ®Ó chuyÓn ®æi trang bÞ Uy Hæ.")
--		return 0
--	end		
	PutinItemBox("N©ng cÊp trang bÞ" ,1 , "X¸c nhËn muèn thùc hiÖn n©ng cÊp?", DOIPHE_VUKHI_UYHO_NGUYENSOAI_FILE, 1)
end
function DoiPhe_UyHoNguyenSoai(nType)
	local nNguyenLieu = {--Thiªn M«n Kim LÖnh, Thiªn Cang LÖnh
								[1] = {{2,1,30370,15}, {2,95,204,15}}, 
								[2] = {{2,1,30370,20}, {2,95,204,20}}, 
							}
	local nCount1 = GetItemCount(2,1,30370)
	local nCount2 = GetItemCount(2,95,204)						
	if nCount1 < nNguyenLieu[nType][1][4] then
		Talk(1, "", szNpcName .. "B¹n kh«ng cã ®ñ "..nNguyenLieu[nType][1][4].." Thiªn M«n Kim LÖnh ®Ó chuyÓn ®æi trang bÞ Uy Hæ.")
		return 0
	end						
	if nCount2 < nNguyenLieu[nType][2][4] then
		Talk(1, "", szNpcName .. "B¹n kh«ng cã ®ñ "..nNguyenLieu[nType][2][4].." Thiªn Cang LÖnh ®Ó chuyÓn ®æi trang bÞ Uy Hæ.")
		return 0
	end					
	
	PutinItemBox("N©ng cÊp trang bÞ" ,1 , "X¸c nhËn muèn thùc hiÖn n©ng cÊp?", DOIPHE_UYHO_NGUYENSOAI_FILE, 1)
end

function OnPutinCheck(param, idx, genre, detail, particular)
	if tbUyHo_DoiPhe[genre] == nil then
		Talk(1,"",szNpcName .. "Ta chØ nhËn ®æi trang bÞ Uy Hæ Nguyªn So¸i.")
		return 0
	end
	if tbUyHo_DoiPhe[genre][detail] == nil then
		Talk(1,"",szNpcName .. "Ta chØ nhËn ®æi trang bÞ Uy Hæ Nguyªn So¸i.")
		return 0
	end
	if tbUyHo_DoiPhe[genre][detail][particular] == nil then
		Talk(1,"",szNpcName .. "Ta chØ nhËn ®æi trang bÞ Uy Hæ Nguyªn So¸i.")
		return 0
	end	
--	if detail ~= 102 then
--		if GetEquipAttr(idx,2) < 7 then
--			Talk(1,"",szNpcName .. "Trang bÞ ph¶i ®­îc c­êng hãa 7 trë lªn.")
--			return 0
--		end
--	end
	return 1
end

function OnPutinComplete(param)
	if gf_JudgeRoomWeight(1,100) == 0 then
		Talk(1,"",szNpcName.."Hµnh trang hoÆc søc lùc kh«ng ®ñ, ng­¬i h·y s¾p xÕp l¹i nhÐ!");
		return 0
	end
	local tbUpgradeList = GetPutinItem();
	local nG, nD, nP = tbUpgradeList[1][2], tbUpgradeList[1][3], tbUpgradeList[1][4]
	if tbUyHo_DoiPhe[nG][nD][nP] == nil then
		return 0
	end
	
	-------------------- Check material ----------------------------
	local tbMaterial = {
		[1] = {item={{gdp={2,1,30370,15}}, {gdp={2,95,204,15}}}},	--, task={{707, 30000, "TÝch lòy chiÕn tr­êng"}}
		[2] = {item={{gdp={2,1,30370,20}}, {gdp={2,95,204,20}}}},	
	}
	local nIndex = tbUyHo_DoiPhe[nG][nD][nP][1]
	--=====================
	local nTMKL = 15
	local nTCL = 15
	if nIndex == 2 then
		nTMKL = 20
		nTCL = 20
	end
	local nCount1 = GetItemCount(2,1,30370)
	local nCount2 = GetItemCount(2,95,204)
	
	if nCount1 < nTMKL then
		Talk(1, "", szNpcName .. "B¹n kh«ng cã ®ñ "..nTMKL.." Thiªn M«n Kim LÖnh ®Ó chuyÓn ®æi trang bÞ Uy Hæ.")
		return 0
	end						
	if nCount2 < nTCL then
		Talk(1, "", szNpcName .. "B¹n kh«ng cã ®ñ "..nTCL.."Thiªn Cang LÖnh ®Ó chuyÓn ®æi trang bÞ Uy Hæ.")
		return 0
	end			
	--=======================
	local nCheck = LIB_Award:CheckMaterial(tbMaterial[nIndex])
	if nCheck == 0 then
		return 0
	end
	
	local nLevel = 0
--	if GetEquipAttr(tbUpgradeList[1][1],2) >= 7  and GetEquipAttr(tbUpgradeList[1][1],2) < 10 then
--		nLevel = 7;	
--	end
	
--	if GetEquipAttr(tbUpgradeList[1][1],2) >= 10 then
--		nLevel = 10;	
--	end
	if DelItem(2,1,30370,nTMKL) == 1 and DelItem(2,95,204,nTCL) == 1 then
		local szItemName = GetItemName(nG,nD,tbUyHo_DoiPhe[nG][nD][nP][2])
		LIB_Award.szLogTitle = "CHUYEN DOI PHE TRANG BI UY HO NGUYEN SOAI"
		LIB_Award.szLogAction = "thµnh c«ng"
		local tbNewItem = {item={{gdp={nG, nD, tbUyHo_DoiPhe[nG][nD][nP][2], 1,1, -1, -1, -1, -1, -1, -1, -1, nLevel}}}}
	--	LIB_Award:PayMaterial(tbMaterial[nIndex])
		DelItemByIndex(tbUpgradeList[1][1],-1)
		LIB_Award:Award(tbNewItem)
		Talk(1,"",szNpcName.."N©ng cÊp thµnh c«ng, h·y nhËn lÊy <color=yellow>" .. szItemName .. "<color> cña ng­¬i.")
		return 1
	end
end
