Include("\\script\\vng\\lib\\vnglib_award.lua");
szNpcName = "<color=green>Häc trß thî rÌn L­u: <color>"

tbLoiHoNguyenSoai = { --Change dainguyensoi to loihonguyensoi
	[0] = {
		[100] = {
			[30219] = {1,30219},	-- {Material, nP}
			[30220] = {1,30220},
			[30221] = {1,30221},
			[30222] = {1,30222},
			[30231] = {1,30231},
			[30232] = {1,30232},
			[30233] = {1,30233},
			[30234] = {1,30234},
		},
		[101] = {
			[30219] = {1,30219},
			[30220] = {1,30220},
			[30221] = {1,30221},
			[30222] = {1,30222},
			[30231] = {1,30231},
			[30232] = {1,30232},
			[30233] = {1,30233},
			[30234] = {1,30234},
		},
		[103] = {
			[30219] = {1,30219},
			[30220] = {1,30220},
			[30221] = {1,30221},
			[30222] = {1,30222},
			[30231] = {1,30231},
			[30232] = {1,30232},
			[30233] = {1,30233},
			[30234] = {1,30234},
		},
		[102] = {
			[30169] = {1,30169},
			[30170] = {1,30170},
			[30171] = {1,30171},
			[30172] = {1,30172},
			[30173] = {1,30173},
			[30174] = {1,30174},
			[30175] = {1,30175},
			[30176] = {1,30176},
			[30177] = {1,30177},            
			[30178] = {1,30178},
			[30179] = {1,30179},
			[30180] = {1,30180},
			[30181] = {1,30181},
			[30182] = {1,30182},
			[30183] = {1,30183},
			[30184] = {1,30184},
			------------ Lieu
			[30205] = {1,30205},
			[30206] = {1,30206},
			[30207] = {1,30207},
			[30208] = {1,30208},
			[30209] = {1,30209},
			[30210] = {1,30210},
			[30211] = {1,30211},
			[30212] = {1,30212},
			[30213] = {1,30213},
			[30214] = {1,30214},
			[30215] = {1,30215},
			[30216] = {1,30216},
			[30217] = {1,30217},
			[30218] = {1,30218},
			[30219] = {1,30219},
			[30220] = {1,30220},
		},
	},
}

function OnPutinCheck(param, idx, genre, detail, particular)
	if tbLoiHoNguyenSoai[genre] == nil then
		Talk(1,"",szNpcName .. "Ta chØ nhËn ®æi trang bÞ L«i Hæ Nguyªn So¸i.")
		return 0
	end
	if tbLoiHoNguyenSoai[genre][detail] == nil then
		Talk(1,"",szNpcName .. "Ta chØ nhËn ®æi trang bÞ L«i Hæ Nguyªn So¸i.")
		return 0
	end
	if tbLoiHoNguyenSoai[genre][detail][particular] == nil then
		Talk(1,"",szNpcName .. "Ta chØ nhËn ®æi trang bÞ L«i Hæ Nguyªn So¸i.")
		return 0
	end
	
	if detail ~= 102 then
		if GetEquipAttr(idx,2) < 14 then
			Talk(1,"",szNpcName .. "Trang bÞ ph¶i ®­îc c­êng hãa 14 trë lªn.")
			return 0
		end
	end
	return 1
end

function OnPutinComplete(param)
	if gf_JudgeRoomWeight(1,100) == 0 then
		Talk(1,"",szNpcName.."Hµnh trang hoÆc søc lùc kh«ng ®ñ, ng­¬i h·y s¾p xÕp l¹i nhÐ!");
		return 0
	end
	local tbUpgradeList = GetPutinItem();
	local nG, nD, nP = tbUpgradeList[1][2], tbUpgradeList[1][3], tbUpgradeList[1][4]
	if tbLoiHoNguyenSoai[nG][nD][nP] == nil then
		return 0
	end
	-------------------- Check material ----------------------------
	local tbMaterial = {
		[1] = {item={{gdp={2,1,1051,10}}, {gdp={2,1,1006,27}}}},
	}
	local nIndex = tbLoiHoNguyenSoai[nG][nD][nP][1]
	local nCheck = LIB_Award:CheckMaterial(tbMaterial[nIndex])
	if nCheck == 0 then
		return 0
	end
	local nLevel = 0
--	if GetEquipAttr(tbUpgradeList[1][1],2) >= 7  and GetEquipAttr(tbUpgradeList[1][1],2) < 10 then
--		nLevel = 0;	
--	end
	
	if GetEquipAttr(tbUpgradeList[1][1],2) >= 1 then
		nLevel = 0;	
	end
	--======
	local nRoute = GetPlayerRoute();
	local nBody = GetBody();
	local nQuanHam = GetTask(704)
	if nD == 102 then
		if nP >= 30169 and nP <= 30172 then
			gf_AddItemEx2(VET_HOAPHUNG_HIEUPHU[nRoute][nBody][1], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nP >= 30173 and nP <= 30176 then
			gf_AddItemEx2(VET_HOAPHUNG_HOPHU[nRoute][nBody][1], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nP >= 30177 and nP <= 30180 then
			gf_AddItemEx2(VET_HOAPHUNG_LENHKY[nRoute][nBody][1], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nP >= 30181 and nP <= 30184 then
			gf_AddItemEx2(VET_HOAPHUNG_HIEUKY[nRoute][nBody][1], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nP >= 30205 and nP <= 30208 then
			gf_AddItemEx2(VET_HOAPHUNG_HIEUPHU[nRoute][nBody][2], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nP >= 30209 and nP <= 30212 then
			gf_AddItemEx2(VET_HOAPHUNG_HOPHU[nRoute][nBody][2], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nP >= 30213 and nP <= 30216 then
			gf_AddItemEx2(VET_HOAPHUNG_LENHKY[nRoute][nBody][2], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nP >= 30217 and nP <= 30220 then
			gf_AddItemEx2(VET_HOAPHUNG_HIEUKY[nRoute][nBody][2], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		end
	end
	if nP > 30222 then
		if nD == 100 then
			gf_AddItemEx2(VET_HOAPHUNG_CLOTH[nRoute][nBody][2], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nD == 101 then
			gf_AddItemEx2(VET_HOAPHUNG_SHOE[nRoute][nBody][2], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nD == 103 then
			gf_AddItemEx2(VET_HOAPHUNG_CAP[nRoute][nBody][2], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		end
	else
		if nD == 100 then
			gf_AddItemEx2(VET_HOAPHUNG_CLOTH[nRoute][nBody][1], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nD == 101 then
			gf_AddItemEx2(VET_HOAPHUNG_SHOE[nRoute][nBody][1], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		elseif nD == 103 then
			gf_AddItemEx2(VET_HOAPHUNG_CAP[nRoute][nBody][1], "Bé Trang bÞ Háa Phông Nguyªn So¸i", "NHAN DOI TRANG BI", "NhËn trang bÞ háa phông", 0, 1);
		end
	end	
	--======
--	local szItemName = GetItemName(nG,nD,tbLoiHoNguyenSoai[nG][nD][nP][2])
	LIB_Award.szLogTitle = "NANG CAP LOI HO - HOA PHUNG NGUYEN SOAI"
	LIB_Award.szLogAction = "thµnh c«ng"
--	local tbNewItem = {item={{gdp={nG, nD, tbLoiHoNguyenSoai[nG][nD][nP][2], 1, 1, -1, -1, -1, -1, -1, -1, -1, nLevel}}}}
	LIB_Award:PayMaterial(tbMaterial[nIndex])
	DelItemByIndex(tbUpgradeList[1][1],-1)
--	LIB_Award:Award(tbNewItem)
	Talk(1,"",szNpcName.."N©ng cÊp thµnh c«ng, h·y nhËn lÊy <color=yellow>" .. "trang bÞ Háa Phông míi" .. "<color> cña ng­¬i.")
	return 1
end

VET_HOAPHUNG_CLOTH = {
	[2] = {
	    [1] = {{0, 100, 30375, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30503, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
		[2] = {{0, 100, 30376, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30504, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
	},
	[3] = {
		[1] = {{0, 100, 30377, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30505, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
		[2] = {{0, 100, 30378, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30506, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
	},
	[4] = {
		[1] = {{0, 100, 30379, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30507, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
		[2] = {{0, 100, 30380, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30508, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
	},
	[6] = {
		[1] = {{0, 100, 30381, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30509, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[2] = {{0, 100, 30382, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30510, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[3] = {{0, 100, 30383, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30511, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[4] = {{0, 100, 30384, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30512, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
	},
	[8] = {
		[3] = {{0, 100, 30385, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30513, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
		[4] = {{0, 100, 30386, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30514, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
	},
	[9] = {
		[3] = {{0, 100, 30387, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30515, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
		[4] = {{0, 100, 30388, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30516, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
	},
	[11] = {
		[1] = {{0, 100, 30389, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30517, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[2] = {{0, 100, 30390, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30518, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[3] = {{0, 100, 30391, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30519, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[4] = {{0, 100, 30392, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30520, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
	},
	[12] = {
		[1] = {{0, 100, 30393, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30521, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[2] = {{0, 100, 30394, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30522, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[3] = {{0, 100, 30395, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30523, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[4] = {{0, 100, 30396, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30524, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
	},
	[14] = {
		[1] = {{0, 100, 30397, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30525, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[2] = {{0, 100, 30398, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30526, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[3] = {{0, 100, 30399, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30527, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[4] = {{0, 100, 30400, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30528, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
	},
	[15] = {
		[1] = {{0, 100, 30401, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30529, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[2] = {{0, 100, 30402, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30530, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[3] = {{0, 100, 30403, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30531, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[4] = {{0, 100, 30404, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30532, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
	},
	[17] = {
		[1] = {{0, 100, 30405, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30533, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[2] = {{0, 100, 30406, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30534, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[3] = {{0, 100, 30407, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30535, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[4] = {{0, 100, 30408, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30536, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
	},
	[18] = {
		[1] = {{0, 100, 30409, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30537, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[2] = {{0, 100, 30410, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30538, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[3] = {{0, 100, 30411, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30539, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[4] = {{0, 100, 30412, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30540, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
	},
	[20] = {
		[1] = {{0, 100, 30413, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30541, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[2] = {{0, 100, 30414, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30542, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[3] = {{0, 100, 30415, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30543, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[4] = {{0, 100, 30416, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30544, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
	},
	[21] = {
		[1] = {{0, 100, 30417, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30545, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[2] = {{0, 100, 30418, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30546, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[3] = {{0, 100, 30419, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30547, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[4] = {{0, 100, 30420, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30548, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
	},
	[23] = {
		[1] = {{0, 100, 30421, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30549, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
		[2] = {{0, 100, 30422, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30550, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
	},
	[25] = {
		[1] = {{0, 100, 30423, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30551, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[2] = {{0, 100, 30424, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30552, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[3] = {{0, 100, 30425, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30553, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[4] = {{0, 100, 30426, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30554, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
	},
	[26] = {
		[1] = {{0, 100, 30427, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30555, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[2] = {{0, 100, 30428, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30556, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[3] = {{0, 100, 30429, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30557, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[4] = {{0, 100, 30430, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30558, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
	},
	[27] = {
		[1] = {{0, 100, 30431, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30559, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[2] = {{0, 100, 30432, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30560, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[3] = {{0, 100, 30433, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30561, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[4] = {{0, 100, 30434, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30562, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
	},
	[29] = {
		[3] = {{0, 100, 30435, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30563, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
		[4] = {{0, 100, 30436, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30564, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
	},
	[30] = {
		[3] = {{0, 100, 30437, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30565, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
		[4] = {{0, 100, 30438, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 100, 30566, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
	},	
}
VET_HOAPHUNG_SHOE = {
	[2] = {
	    [1] = {{0, 101, 30375, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30503, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
		[2] = {{0, 101, 30376, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30504, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
	},
	[3] = {
		[1] = {{0, 101, 30377, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30505, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
		[2] = {{0, 101, 30378, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30506, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
	},
	[4] = {
		[1] = {{0, 101, 30379, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30507, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
		[2] = {{0, 101, 30380, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30508, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
	},
	[6] = {
		[1] = {{0, 101, 30381, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30509, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[2] = {{0, 101, 30382, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30510, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[3] = {{0, 101, 30383, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30511, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[4] = {{0, 101, 30384, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30512, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
	},
	[8] = {
		[3] = {{0, 101, 30385, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30513, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
		[4] = {{0, 101, 30386, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30514, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
	},
	[9] = {
		[3] = {{0, 101, 30387, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30515, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
		[4] = {{0, 101, 30388, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30516, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
	},
	[11] = {
		[1] = {{0, 101, 30389, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30517, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[2] = {{0, 101, 30390, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30518, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[3] = {{0, 101, 30391, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30519, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[4] = {{0, 101, 30392, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30520, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
	},
	[12] = {
		[1] = {{0, 101, 30393, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30521, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[2] = {{0, 101, 30394, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30522, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[3] = {{0, 101, 30395, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30523, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[4] = {{0, 101, 30396, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30524, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
	},
	[14] = {
		[1] = {{0, 101, 30397, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30525, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[2] = {{0, 101, 30398, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30526, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[3] = {{0, 101, 30399, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30527, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[4] = {{0, 101, 30400, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30528, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
	},
	[15] = {
		[1] = {{0, 101, 30401, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30529, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[2] = {{0, 101, 30402, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30530, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[3] = {{0, 101, 30403, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30531, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[4] = {{0, 101, 30404, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30532, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
	},
	[17] = {
		[1] = {{0, 101, 30405, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30533, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[2] = {{0, 101, 30406, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30534, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[3] = {{0, 101, 30407, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30535, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[4] = {{0, 101, 30408, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30536, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
	},
	[18] = {
		[1] = {{0, 101, 30409, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30537, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[2] = {{0, 101, 30410, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30538, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[3] = {{0, 101, 30411, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30539, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[4] = {{0, 101, 30412, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30540, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
	},
	[20] = {
		[1] = {{0, 101, 30413, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30541, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[2] = {{0, 101, 30414, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30542, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[3] = {{0, 101, 30415, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30543, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[4] = {{0, 101, 30416, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30544, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
	},
	[21] = {
		[1] = {{0, 101, 30417, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30545, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[2] = {{0, 101, 30418, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30546, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[3] = {{0, 101, 30419, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30547, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[4] = {{0, 101, 30420, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30548, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
	},
	[23] = {
		[1] = {{0, 101, 30421, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30549, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
		[2] = {{0, 101, 30422, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30550, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
	},
	[25] = {
		[1] = {{0, 101, 30423, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30551, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[2] = {{0, 101, 30424, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30552, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[3] = {{0, 101, 30425, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30553, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[4] = {{0, 101, 30426, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30554, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
	},
	[26] = {
		[1] = {{0, 101, 30427, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30555, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[2] = {{0, 101, 30428, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30556, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[3] = {{0, 101, 30429, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30557, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[4] = {{0, 101, 30430, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30558, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
	},
	[27] = {
		[1] = {{0, 101, 30431, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30559, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[2] = {{0, 101, 30432, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30560, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[3] = {{0, 101, 30433, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30561, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[4] = {{0, 101, 30434, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30562, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
	},
	[29] = {
		[3] = {{0, 101, 30435, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30563, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
		[4] = {{0, 101, 30436, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30564, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
	},
	[30] = {
		[3] = {{0, 101, 30437, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30565, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
		[4] = {{0, 101, 30438, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 101, 30566, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
	},	
}
VET_HOAPHUNG_CAP = {
	[2] = {
	    [1] = {{0, 103, 30375, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30503, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
		[2] = {{0, 103, 30376, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30504, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
	},
	[3] = {
		[1] = {{0, 103, 30377, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30505, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
		[2] = {{0, 103, 30378, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30506, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
	},
	[4] = {
		[1] = {{0, 103, 30379, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30507, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
		[2] = {{0, 103, 30380, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30508, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
	},
	[6] = {
		[1] = {{0, 103, 30381, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30509, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[2] = {{0, 103, 30382, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30510, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[3] = {{0, 103, 30383, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30511, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[4] = {{0, 103, 30384, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30512, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
	},
	[8] = {
		[3] = {{0, 103, 30385, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30513, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
		[4] = {{0, 103, 30386, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30514, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
	},
	[9] = {
		[3] = {{0, 103, 30387, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30515, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
		[4] = {{0, 103, 30388, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30516, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
	},
	[11] = {
		[1] = {{0, 103, 30389, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30517, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[2] = {{0, 103, 30390, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30518, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[3] = {{0, 103, 30391, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30519, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[4] = {{0, 103, 30392, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30520, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
	},
	[12] = {
		[1] = {{0, 103, 30393, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30521, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[2] = {{0, 103, 30394, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30522, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[3] = {{0, 103, 30395, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30523, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[4] = {{0, 103, 30396, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30524, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
	},
	[14] = {
		[1] = {{0, 103, 30397, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30525, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[2] = {{0, 103, 30398, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30526, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[3] = {{0, 103, 30399, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30527, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[4] = {{0, 103, 30400, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30528, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
	},
	[15] = {
		[1] = {{0, 103, 30401, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30529, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[2] = {{0, 103, 30402, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30530, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[3] = {{0, 103, 30403, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30531, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[4] = {{0, 103, 30404, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30532, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
	},
	[17] = {
		[1] = {{0, 103, 30405, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30533, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[2] = {{0, 103, 30406, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30534, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[3] = {{0, 103, 30407, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30535, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[4] = {{0, 103, 30408, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30536, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
	},
	[18] = {
		[1] = {{0, 103, 30409, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30537, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[2] = {{0, 103, 30410, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30538, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[3] = {{0, 103, 30411, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30539, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[4] = {{0, 103, 30412, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30540, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
	},
	[20] = {
		[1] = {{0, 103, 30413, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30541, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[2] = {{0, 103, 30414, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30542, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[3] = {{0, 103, 30415, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30543, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[4] = {{0, 103, 30416, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30544, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
	},
	[21] = {
		[1] = {{0, 103, 30417, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30545, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[2] = {{0, 103, 30418, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30546, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[3] = {{0, 103, 30419, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30547, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[4] = {{0, 103, 30420, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30548, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
	},
	[23] = {
		[1] = {{0, 103, 30421, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30549, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
		[2] = {{0, 103, 30422, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30550, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
	},
	[25] = {
		[1] = {{0, 103, 30423, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30551, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[2] = {{0, 103, 30424, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30552, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[3] = {{0, 103, 30425, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30553, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[4] = {{0, 103, 30426, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30554, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
	},
	[26] = {
		[1] = {{0, 103, 30427, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30555, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[2] = {{0, 103, 30428, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30556, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[3] = {{0, 103, 30429, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30557, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[4] = {{0, 103, 30430, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30558, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
	},
	[27] = {
		[1] = {{0, 103, 30431, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30559, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[2] = {{0, 103, 30432, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30560, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[3] = {{0, 103, 30433, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30561, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[4] = {{0, 103, 30434, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30562, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
	},
	[29] = {
		[3] = {{0, 103, 30435, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30563, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
		[4] = {{0, 103, 30436, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30564, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
	},
	[30] = {
		[3] = {{0, 103, 30437, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30565, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
		[4] = {{0, 103, 30438, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel},{0, 103, 30566, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
	},	
}
VET_HOAPHUNG_HIEUPHU = {
	[2] = {
	    [1] = {{0, 102, 30420, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30868, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
		[2] = {{0, 102, 30421, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30869, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
	},
	[3] = {
		[1] = {{0, 102, 30422, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30870, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
		[2] = {{0, 102, 30423, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30871, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
	},
	[4] = {
		[1] = {{0, 102, 30424, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30872, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
		[2] = {{0, 102, 30425, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30873, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
	},
	[6] = {
		[1] = {{0, 102, 30426, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30874, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[2] = {{0, 102, 30427, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30875, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[3] = {{0, 102, 30428, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30876, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[4] = {{0, 102, 30429, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30877, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
	},
	[8] = {
		[3] = {{0, 102, 30430, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30878, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30431, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30879, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
	},
	[9] = {
		[3] = {{0, 102, 30432, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30880, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30433, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30881, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
	},
	[11] = {
		[1] = {{0, 102, 30434, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30882, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[2] = {{0, 102, 30435, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30883, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[3] = {{0, 102, 30436, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30884, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[4] = {{0, 102, 30437, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30885, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
	},
	[12] = {
		[1] = {{0, 102, 30438, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30886, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[2] = {{0, 102, 30439, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30887, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[3] = {{0, 102, 30440, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30888, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[4] = {{0, 102, 30441, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30889, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
	},
	[14] = {
		[1] = {{0, 102, 30442, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30890, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[2] = {{0, 102, 30443, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30891, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[3] = {{0, 102, 30444, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30892, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[4] = {{0, 102, 30445, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30893, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
	},
	[15] = {
		[1] = {{0, 102, 30446, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30894, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[2] = {{0, 102, 30447, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30895, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[3] = {{0, 102, 30448, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30896, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[4] = {{0, 102, 30449, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30897, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
	},
	[17] = {
		[1] = {{0, 102, 30450, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30898, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[2] = {{0, 102, 30451, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30899, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[3] = {{0, 102, 30452, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30900, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[4] = {{0, 102, 30453, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30901, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
	},
	[18] = {
		[1] = {{0, 102, 30454, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30902, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[2] = {{0, 102, 30455, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30903, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[3] = {{0, 102, 30456, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30904, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[4] = {{0, 102, 30457, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30905, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
	},
	[20] = {
		[1] = {{0, 102, 30458, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30906, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[2] = {{0, 102, 30459, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30907, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[3] = {{0, 102, 30460, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30908, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[4] = {{0, 102, 30461, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30909, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
	},
	[21] = {
		[1] = {{0, 102, 30462, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30910, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[2] = {{0, 102, 30463, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30911, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[3] = {{0, 102, 30464, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30912, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[4] = {{0, 102, 30465, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30913, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
	},
	[23] = {
		[1] = {{0, 102, 30466, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30914, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
		[2] = {{0, 102, 30467, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30915, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
	},
	[25] = {
		[1] = {{0, 102, 30468, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30916, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[2] = {{0, 102, 30469, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30917, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[3] = {{0, 102, 30470, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30918, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[4] = {{0, 102, 30471, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30919, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
	},
	[26] = {
		[1] = {{0, 102, 30472, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30920, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[2] = {{0, 102, 30473, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30921, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[3] = {{0, 102, 30474, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30922, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[4] = {{0, 102, 30475, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30923, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
	},
	[27] = {
		[1] = {{0, 102, 30476, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30924, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[2] = {{0, 102, 30477, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30925, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[3] = {{0, 102, 30478, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30926, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[4] = {{0, 102, 30479, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30927, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
	},
	[29] = {
		[3] = {{0, 102, 30480, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30928, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
		[4] = {{0, 102, 30481, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30929, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
	},
	[30] = {
		[3] = {{0, 102, 30482, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30930, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
		[4] = {{0, 102, 30483, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30931, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
	},	
}
VET_HOAPHUNG_LENHKY = {
	[2] = {
	    [1] = {{0, 102, 30548, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30996, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
		[2] = {{0, 102, 30549, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30997, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
	},
	[3] = {
		[1] = {{0, 102, 30550, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30998, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
		[2] = {{0, 102, 30551, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30999, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
	},
	[4] = {
		[1] = {{0, 102, 30552, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31000, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
		[2] = {{0, 102, 30553, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31001, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
	},
	[6] = {
		[1] = {{0, 102, 30554, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31002, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[2] = {{0, 102, 30555, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31003, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[3] = {{0, 102, 30556, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31004, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[4] = {{0, 102, 30557, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31005, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
	},
	[8] = {
		[3] = {{0, 102, 30558, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31006, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30559, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31007, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
	},
	[9] = {
		[3] = {{0, 102, 30560, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31008, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30561, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31009, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
	},
	[11] = {
		[1] = {{0, 102, 30562, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31010, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[2] = {{0, 102, 30563, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31011, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[3] = {{0, 102, 30564, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31012, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[4] = {{0, 102, 30565, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31013, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
	},
	[12] = {
		[1] = {{0, 102, 30566, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31014, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[2] = {{0, 102, 30567, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31015, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[3] = {{0, 102, 30568, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31016, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[4] = {{0, 102, 30569, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31017, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
	},
	[14] = {
		[1] = {{0, 102, 30570, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31018, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[2] = {{0, 102, 30571, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31019, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[3] = {{0, 102, 30572, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31020, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[4] = {{0, 102, 30573, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31021, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
	},
	[15] = {
		[1] = {{0, 102, 30574, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31022, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[2] = {{0, 102, 30575, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31023, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[3] = {{0, 102, 30576, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31024, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[4] = {{0, 102, 30577, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31025, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
	},
	[17] = {
		[1] = {{0, 102, 30578, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31026, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[2] = {{0, 102, 30579, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31027, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[3] = {{0, 102, 30580, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31028, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[4] = {{0, 102, 30581, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31029, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
	},
	[18] = {
		[1] = {{0, 102, 30582, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31030, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[2] = {{0, 102, 30583, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31031, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[3] = {{0, 102, 30584, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31032, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[4] = {{0, 102, 30585, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31033, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
	},
	[20] = {
		[1] = {{0, 102, 30586, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31034, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[2] = {{0, 102, 30587, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31035, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[3] = {{0, 102, 30588, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31036, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[4] = {{0, 102, 30589, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31037, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
	},
	[21] = {
		[1] = {{0, 102, 30590, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31038, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[2] = {{0, 102, 30591, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31039, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[3] = {{0, 102, 30592, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31040, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[4] = {{0, 102, 30593, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31041, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
	},
	[23] = {
		[1] = {{0, 102, 30594, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31042, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
		[2] = {{0, 102, 30595, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31043, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
	},
	[25] = {
		[1] = {{0, 102, 30596, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31044, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[2] = {{0, 102, 30597, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31045, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[3] = {{0, 102, 30598, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31046, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[4] = {{0, 102, 30599, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31047, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
	},
	[26] = {
		[1] = {{0, 102, 30600, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31048, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[2] = {{0, 102, 30601, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31049, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[3] = {{0, 102, 30602, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31050, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[4] = {{0, 102, 30603, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31051, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
	},
	[27] = {
		[1] = {{0, 102, 30604, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31052, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[2] = {{0, 102, 30605, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31053, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[3] = {{0, 102, 30606, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31054, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[4] = {{0, 102, 30607, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31055, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
	},
	[29] = {
		[3] = {{0, 102, 30608, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31056, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
		[4] = {{0, 102, 30609, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31057, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
	},
	[30] = {
		[3] = {{0, 102, 30610, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31058, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
		[4] = {{0, 102, 30611, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31059, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
	},	
}
VET_HOAPHUNG_HIEUKY = {
	[2] = {
	    [1] = {{0, 102, 30612, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31060, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
		[2] = {{0, 102, 30613, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31061, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
	},
	[3] = {
		[1] = {{0, 102, 30614, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31062, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
		[2] = {{0, 102, 30615, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31063, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
	},
	[4] = {
		[1] = {{0, 102, 30616, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31064, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
		[2] = {{0, 102, 30617, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31065, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
	},
	[6] = {
		[1] = {{0, 102, 30618, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31066, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[2] = {{0, 102, 30619, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31067, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[3] = {{0, 102, 30620, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31068, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[4] = {{0, 102, 30621, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31069, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
	},
	[8] = {
		[3] = {{0, 102, 30622, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31070, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30623, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31071, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
	},
	[9] = {
		[3] = {{0, 102, 30624, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31072, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30625, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31073, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
	},
	[11] = {
		[1] = {{0, 102, 30626, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31074, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[2] = {{0, 102, 30627, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31075, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[3] = {{0, 102, 30628, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31076, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[4] = {{0, 102, 30629, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31077, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
	},
	[12] = {
		[1] = {{0, 102, 30630, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31078, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[2] = {{0, 102, 30631, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31079, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[3] = {{0, 102, 30632, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31080, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[4] = {{0, 102, 30633, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31081, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
	},
	[14] = {
		[1] = {{0, 102, 30634, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31082, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[2] = {{0, 102, 30635, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31083, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[3] = {{0, 102, 30636, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31084, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[4] = {{0, 102, 30637, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31085, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
	},
	[15] = {
		[1] = {{0, 102, 30638, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31086, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[2] = {{0, 102, 30639, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31087, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[3] = {{0, 102, 30640, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31088, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[4] = {{0, 102, 30641, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31089, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
	},
	[17] = {
		[1] = {{0, 102, 30642, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31090, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[2] = {{0, 102, 30643, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31091, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[3] = {{0, 102, 30644, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31092, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[4] = {{0, 102, 30645, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31093, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
	},
	[18] = {
		[1] = {{0, 102, 30646, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31094, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[2] = {{0, 102, 30647, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31095, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[3] = {{0, 102, 30648, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31096, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[4] = {{0, 102, 30649, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31097, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
	},
	[20] = {
		[1] = {{0, 102, 30650, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31098, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[2] = {{0, 102, 30651, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31099, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[3] = {{0, 102, 30652, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31100, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[4] = {{0, 102, 30653, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31101, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
	},
	[21] = {
		[1] = {{0, 102, 30654, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31102, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[2] = {{0, 102, 30655, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31103, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[3] = {{0, 102, 30656, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31104, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[4] = {{0, 102, 30657, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31105, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
	},
	[23] = {
		[1] = {{0, 102, 30658, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31106, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
		[2] = {{0, 102, 30659, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31107, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
	},
	[25] = {
		[1] = {{0, 102, 30660, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31108, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[2] = {{0, 102, 30661, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31109, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[3] = {{0, 102, 30662, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31110, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[4] = {{0, 102, 30663, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31111, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
	},
	[26] = {
		[1] = {{0, 102, 30664, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31112, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[2] = {{0, 102, 30665, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31113, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[3] = {{0, 102, 30666, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31114, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[4] = {{0, 102, 30667, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31115, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
	},
	[27] = {
		[1] = {{0, 102, 30668, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31116, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[2] = {{0, 102, 30669, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31117, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[3] = {{0, 102, 30670, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31118, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[4] = {{0, 102, 30671, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31119, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
	},
	[29] = {
		[3] = {{0, 102, 30672, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31120, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
		[4] = {{0, 102, 30673, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31121, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
	},
	[30] = {
		[3] = {{0, 102, 30674, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31122, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
		[4] = {{0, 102, 30675, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 31123, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
	},	
}
VET_HOAPHUNG_HOPHU = {
	[2] = {
	    [1] = {{0, 102, 30484, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30932, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
		[2] = {{0, 102, 30485, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30933, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é N¹n T«n Gi¶ Trang"},
	},
	[3] = {
		[1] = {{0, 102, 30486, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30934, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
		[2] = {{0, 102, 30487, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30935, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é KiÕp T«n Gi¶ Trang"},
	},
	[4] = {
		[1] = {{0, 102, 30488, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30936, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
		[2] = {{0, 102, 30489, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30937, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§é ¸ch T«n Gi¶ Trang"},
	},
	[6] = {
		[1] = {{0, 102, 30490, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30938, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[2] = {{0, 102, 30491, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30939, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[3] = {{0, 102, 30492, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30940, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
		[4] = {{0, 102, 30493, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30941, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V¹n KiÕp Th¸nh Thñ Trang"},
	},
	[8] = {
		[3] = {{0, 102, 30494, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30942, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30495, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30943, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt V©n Th¸nh C« QuÇn"},
	},
	[9] = {
		[3] = {{0, 102, 30496, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30944, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
		[4] = {{0, 102, 30497, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30945, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-PhËt TrÇn Th¸nh C« QuÇn"},
	},
	[11] = {
		[1] = {{0, 102, 30498, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30946, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[2] = {{0, 102, 30499, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30947, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[3] = {{0, 102, 30500, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30948, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
		[4] = {{0, 102, 30501, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30949, 1, 4, -1, -1, -1, -1, -1, -1, -1, nLevel}, "DiÖu D­¬ng-Trôc Phông Thiªn C¸i Trang"},
	},
	[12] = {
		[1] = {{0, 102, 30502, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30950, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[2] = {{0, 102, 30503, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30951, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[3] = {{0, 102, 30504, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30952, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
		[4] = {{0, 102, 30505, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30953, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Du Long §Þa KhÊt Trang"},
	},
	[14] = {
		[1] = {{0, 102, 30506, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30954, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[2] = {{0, 102, 30507, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30955, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[3] = {{0, 102, 30508, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30956, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
		[4] = {{0, 102, 30509, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30957, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-V« Cùc Thiªn T«n Trang"},
	},
	[15] = {
		[1] = {{0, 102, 30510, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30958, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[2] = {{0, 102, 30511, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30959, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[3] = {{0, 102, 30512, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30960, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
		[4] = {{0, 102, 30513, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30961, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÝch L¹c Thiªn T«n Trang"},
	},
	[17] = {
		[1] = {{0, 102, 30514, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30962, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[2] = {{0, 102, 30515, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30963, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[3] = {{0, 102, 30516, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30964, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
		[4] = {{0, 102, 30517, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30965, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-C¶m Thiªn §Êu Hån Trang"},
	},
	[18] = {
		[1] = {{0, 102, 30518, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30966, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[2] = {{0, 102, 30519, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30967, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[3] = {{0, 102, 30520, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30968, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
		[4] = {{0, 102, 30521, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30969, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-§Þnh Thiªn ThÇn NghÖ Trang"},
	},
	[20] = {
		[1] = {{0, 102, 30522, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30970, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[2] = {{0, 102, 30523, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30971, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[3] = {{0, 102, 30524, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30972, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
		[4] = {{0, 102, 30525, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30973, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Quû Xóc Tµ ThÇn Trang"},
	},
	[21] = {
		[1] = {{0, 102, 30526, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30974, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[2] = {{0, 102, 30527, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30975, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[3] = {{0, 102, 30528, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30976, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
		[4] = {{0, 102, 30529, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30977, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Vu Cèt §éc V­¬ng Trang"},
	},
	[23] = {
		[1] = {{0, 102, 30530, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30978, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
		[2] = {{0, 102, 30531, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30979, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-BÊt §éng Ch©n Tiªn Trang"},
	},
	[25] = {
		[1] = {{0, 102, 30532, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30980, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[2] = {{0, 102, 30533, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30981, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[3] = {{0, 102, 30534, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30982, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
		[4] = {{0, 102, 30535, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30983, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Nhôc HuyÕt Cuång ChiÕn Trang"},
	},
	[26] = {
		[1] = {{0, 102, 30536, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30984, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[2] = {{0, 102, 30537, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30985, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[3] = {{0, 102, 30538, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30986, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
		[4] = {{0, 102, 30539, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30987, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Cöu Thiªn Quû Phï Trang"},
	},
	[27] = {
		[1] = {{0, 102, 30540, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30988, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[2] = {{0, 102, 30541, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30989, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[3] = {{0, 102, 30542, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30990, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
		[4] = {{0, 102, 30543, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30991, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Ma ¶nh ThÇn T«ng Trang"},
	},
	[29] = {
		[3] = {{0, 102, 30544, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30992, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
		[4] = {{0, 102, 30545, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30993, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Tª V©n Tiªn Tö QuÇn"},
	},
	[30] = {
		[3] = {{0, 102, 30546, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30994, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
		[4] = {{0, 102, 30547, 1, 4, -1, -1, -1, -1, -1, -1, -1},{0, 102, 30995, 1, 4, -1, -1, -1, -1, -1, -1, -1}, "DiÖu D­¬ng-Phi H¹ Tiªn Tö"},
	},	
}