Include("\\script\\class\\ktabfile.lua");
Include("\\script\\lib\\getrectangle_point.lua") --获得矩形点

tbYanMenGuan = {}

tbYanMenGuan.tbDialogNpc	= 
{
	--雁门关相关
--	{"苏轼","大名府中书梁世杰",604,1366,2831,"\\script\\北区\\雁门关\\npc\\大名府中书梁世杰.lua"},
--	{"彤云","拜火教使者彤云",604,1353,2837,"\\script\\北区\\雁门关\\npc\\拜火教使者彤云.lua"},
--	{"速达康真","速达康真",604,1350,2834,"\\script\\北区\\雁门关\\npc\\速达康真.lua"},
--	{"李继星","李继星",604,1390,2854,"\\script\\北区\\雁门关\\npc\\李继星.lua"},
--	{"完颜洪图","完颜洪图",604,1343,2899,"\\script\\北区\\雁门关\\npc\\完颜洪图.lua"},
--	{"赫连元安","西夏使者赫连元安",604,1385,2851,"\\script\\北区\\雁门关\\npc\\西夏使者赫连元安.lua"},
--	{"完颜秋荻","女真使者完颜秋荻",604,1340,2901,"\\script\\北区\\雁门关\\npc\\女真使者完颜秋荻.lua"},

}
