Import("\\script\\lib\\globalfunctions.lua")
Include("\\settings\\static_script\\missions\\base\\mission_award_base.lua")
--Include("\\script\\misc\\observer\\observer_head.lua")

ITEM_G = 2
ITEM_D = 95
tYunLingLv1 = {
	{{"裂岩（头部）等级1", {2, 144, 14, 1}, {1, 100}},2000},
	{{"裂岩（衣服）等级1", {2, 144, 17, 1}, {1, 100}},2000},
	{{"裂岩（下装）等级1", {2, 144, 20, 1}, {1, 100}},2000},
	{{"破空（头部）等级1", {2, 144, 23, 1}, {1, 100}},2000},
	{{"破空（衣服）等级1", {2, 144, 26, 1}, {1, 100}},2000},
	{{"破空（下装）等级1", {2, 144, 29, 1}, {1, 100}},2000},
	{{"醉剑（头部）等级1", {2, 144, 32, 1}, {1, 100}},2000},
	{{"醉剑（衣服）等级1", {2, 144, 35, 1}, {1, 100}},2000},
	{{"醉剑（下装）等级1", {2, 144, 38, 1}, {1, 100}},2000},
	{{"疾风（头部）等级1", {2, 144, 41, 1}, {1, 100}},2000},
	{{"疾风（衣服）等级1", {2, 144, 44, 1}, {1, 100}},2000},
	{{"疾风（下装）等级1", {2, 144, 47, 1}, {1, 100}},2000},
	{{"迅舞（头部）等级1", {2, 144, 50, 1}, {1, 100}},2000},
	{{"迅舞（衣服）等级1", {2, 144, 53, 1}, {1, 100}},2000},
	{{"迅舞（下装）等级1", {2, 144, 56, 1}, {1, 100}},2000},
	{{"神力（头部）等级1", {2, 144, 77, 1}, {1, 100}},2000},
	{{"神力（衣服）等级1", {2, 144, 80, 1}, {1, 100}},2000},
	{{"神力（下装）等级1", {2, 144, 83, 1}, {1, 100}},2000},
	{{"凝神（头部）等级1", {2, 144, 86, 1}, {1, 100}},2000},
	{{"凝神（衣服）等级1", {2, 144, 89, 1}, {1, 100}},2000},
	{{"凝神（下装）等级1", {2, 144, 92, 1}, {1, 100}},2000},
	{{"无间（头部）等级1", {2, 144, 95, 1}, {1, 100}},2000},
	{{"无间（衣服）等级1", {2, 144, 98, 1}, {1, 100}},2000},
	{{"无间（下装）等级1", {2, 144, 101, 1}, {1, 100}},2000},
	{{"无极（头部）等级1", {2, 144, 104, 1}, {1, 100}},2000},
	{{"无极（衣服）等级1", {2, 144, 107, 1}, {1, 100}},2000},
	{{"无极（下装）等级1", {2, 144, 110, 1}, {1, 100}},2000},
	{{"狂韧（头部）等级1", {2, 144, 113, 1}, {1, 100}},2000},
	{{"狂韧（衣服）等级1", {2, 144, 116, 1}, {1, 100}},2000},
	{{"狂韧（下装）等级1", {2, 144, 119, 1}, {1, 100}},2000},
	{{"凌锐（头部）等级1", {2, 144, 122, 1}, {1, 100}},2000},
	{{"凌锐（衣服）等级1", {2, 144, 125, 1}, {1, 100}},2000},
	{{"凌锐（下装）等级1", {2, 144, 128, 1}, {1, 100}},2000},
	{{"灵猿（头部）等级1", {2, 144, 131, 1}, {1, 100}},2000},
	{{"灵猿（衣服）等级1", {2, 144, 134, 1}, {1, 100}},2000},
	{{"灵猿（下装）等级1", {2, 144, 137, 1}, {1, 100}},2000},
	{{"海韵（头部）等级1", {2, 144, 140, 1}, {1, 100}},2000},
	{{"海韵（衣服）等级1", {2, 144, 143, 1}, {1, 100}},2000},
	{{"海韵（下装）等级1", {2, 144, 146, 1}, {1, 100}},2000},
	{{"海心（头部）等级1", {2, 144, 149, 1}, {1, 100}},2000},
	{{"海心（衣服）等级1", {2, 144, 152, 1}, {1, 100}},2000},
	{{"海心（下装）等级1", {2, 144, 155, 1}, {1, 100}},2000},
	{{"鹰袭（头部）等级1", {2, 144, 2, 1}, {1, 100}},1000},
	{{"怒吟（衣服）等级1", {2, 144, 5, 1}, {1, 100}},1000},
	{{"无量（下装）等级1", {2, 144, 8, 1}, {1, 100}},1000},
	{{"目冥（下装）等级1", {2, 144, 11, 1}, {1, 100}},1000},
	{{"灵心（头部）等级1", {2, 144, 62, 1}, {1, 100}},1000},
	{{"穿云（衣服）等级1", {2, 144, 65, 1}, {1, 100}},1000},
	{{"落日（衣服）等级1", {2, 144, 68, 1}, {1, 100}},1000},
	{{"狼啸（头部）等级1", {2, 144, 71, 1}, {1, 100}},1000},
	{{"止战（下装）等级1", {2, 144, 74, 1}, {1, 100}},1000},
}

tYunLingLv2 = {
	{{"裂岩（头部）等级2", {2, 144, 15, 1}, {1, 100}},2000},
	{{"裂岩（衣服）等级2", {2, 144, 18, 1}, {1, 100}},2000},
	{{"裂岩（下装）等级2", {2, 144, 21, 1}, {1, 100}},2000},
	{{"破空（头部）等级2", {2, 144, 24, 1}, {1, 100}},2000},
	{{"破空（衣服）等级2", {2, 144, 27, 1}, {1, 100}},2000},
	{{"破空（下装）等级2", {2, 144, 30, 1}, {1, 100}},2000},
	{{"醉剑（头部）等级2", {2, 144, 33, 1}, {1, 100}},2000},
	{{"醉剑（衣服）等级2", {2, 144, 36, 1}, {1, 100}},2000},
	{{"醉剑（下装）等级2", {2, 144, 39, 1}, {1, 100}},2000},
	{{"疾风（头部）等级2", {2, 144, 42, 1}, {1, 100}},2000},
	{{"疾风（衣服）等级2", {2, 144, 45, 1}, {1, 100}},2000},
	{{"疾风（下装）等级2", {2, 144, 48, 1}, {1, 100}},2000},
	{{"迅舞（头部）等级2", {2, 144, 51, 1}, {1, 100}},2000},
	{{"迅舞（衣服）等级2", {2, 144, 54, 1}, {1, 100}},2000},
	{{"迅舞（下装）等级2", {2, 144, 57, 1}, {1, 100}},2000},
	{{"神力（头部）等级2", {2, 144, 78, 1}, {1, 100}},2000},
	{{"神力（衣服）等级2", {2, 144, 81, 1}, {1, 100}},2000},
	{{"神力（下装）等级2", {2, 144, 84, 1}, {1, 100}},2000},
	{{"凝神（头部）等级2", {2, 144, 87, 1}, {1, 100}},2000},
	{{"凝神（衣服）等级2", {2, 144, 90, 1}, {1, 100}},2000},
	{{"凝神（下装）等级2", {2, 144, 93, 1}, {1, 100}},2000},
	{{"无间（头部）等级2", {2, 144, 96, 1}, {1, 100}},2000},
	{{"无间（衣服）等级2", {2, 144, 99, 1}, {1, 100}},2000},
	{{"无间（下装）等级2", {2, 144, 102, 1}, {1, 100}},2000},
	{{"无极（头部）等级2", {2, 144, 105, 1}, {1, 100}},2000},
	{{"无极（衣服）等级2", {2, 144, 108, 1}, {1, 100}},2000},
	{{"无极（下装）等级2", {2, 144, 111, 1}, {1, 100}},2000},
	{{"狂韧（头部）等级2", {2, 144, 114, 1}, {1, 100}},2000},
	{{"狂韧（衣服）等级2", {2, 144, 117, 1}, {1, 100}},2000},
	{{"狂韧（下装）等级2", {2, 144, 120, 1}, {1, 100}},2000},
	{{"凌锐（头部）等级2", {2, 144, 123, 1}, {1, 100}},2000},
	{{"凌锐（衣服）等级2", {2, 144, 126, 1}, {1, 100}},2000},
	{{"凌锐（下装）等级2", {2, 144, 129, 1}, {1, 100}},2000},
	{{"灵猿（头部）等级2", {2, 144, 132, 1}, {1, 100}},2000},
	{{"灵猿（衣服）等级2", {2, 144, 135, 1}, {1, 100}},2000},
	{{"灵猿（下装）等级2", {2, 144, 138, 1}, {1, 100}},2000},
	{{"海韵（头部）等级2", {2, 144, 141, 1}, {1, 100}},2000},
	{{"海韵（衣服）等级2", {2, 144, 144, 1}, {1, 100}},2000},
	{{"海韵（下装）等级2", {2, 144, 147, 1}, {1, 100}},2000},
	{{"海心（头部）等级2", {2, 144, 150, 1}, {1, 100}},2000},
	{{"海心（衣服）等级2", {2, 144, 153, 1}, {1, 100}},2000},
	{{"海心（下装）等级2", {2, 144, 156, 1}, {1, 100}},2000},
	{{"鹰袭（头部）等级2", {2, 144, 3, 1}, {1, 100}},1000},
	{{"怒吟（衣服）等级2", {2, 144, 6, 1}, {1, 100}},1000},
	{{"无量（下装）等级2", {2, 144, 9, 1}, {1, 100}},1000},
	{{"目冥（下装）等级2", {2, 144, 12, 1}, {1, 100}},1000},
	{{"灵心（头部）等级2", {2, 144, 63, 1}, {1, 100}},1000},
	{{"穿云（衣服）等级2", {2, 144, 66, 1}, {1, 100}},1000},
	{{"落日（衣服）等级2", {2, 144, 69, 1}, {1, 100}},1000},
	{{"狼啸（头部）等级2", {2, 144, 72, 1}, {1, 100}},1000},
	{{"止战（下装）等级2", {2, 144, 75, 1}, {1, 100}},1000},
}

tYunLingLv3 = {
	{{"裂岩（头部）等级3", {2, 144, 16, 1}, {1, 100}},2000},
	{{"裂岩（衣服）等级3", {2, 144, 19, 1}, {1, 100}},2000},
	{{"裂岩（下装）等级3", {2, 144, 22, 1}, {1, 100}},2000},
	{{"破空（头部）等级3", {2, 144, 25, 1}, {1, 100}},2000},
	{{"破空（衣服）等级3", {2, 144, 28, 1}, {1, 100}},2000},
	{{"破空（下装）等级3", {2, 144, 31, 1}, {1, 100}},2000},
	{{"醉剑（头部）等级3", {2, 144, 34, 1}, {1, 100}},2000},
	{{"醉剑（衣服）等级3", {2, 144, 37, 1}, {1, 100}},2000},
	{{"醉剑（下装）等级3", {2, 144, 40, 1}, {1, 100}},2000},
	{{"疾风（头部）等级3", {2, 144, 43, 1}, {1, 100}},2000},
	{{"疾风（衣服）等级3", {2, 144, 46, 1}, {1, 100}},2000},
	{{"疾风（下装）等级3", {2, 144, 49, 1}, {1, 100}},2000},
	{{"迅舞（头部）等级3", {2, 144, 52, 1}, {1, 100}},2000},
	{{"迅舞（衣服）等级3", {2, 144, 55, 1}, {1, 100}},2000},
	{{"迅舞（下装）等级3", {2, 144, 58, 1}, {1, 100}},2000},
	{{"神力（头部）等级3", {2, 144, 79, 1}, {1, 100}},2000},
	{{"神力（衣服）等级3", {2, 144, 82, 1}, {1, 100}},2000},
	{{"神力（下装）等级3", {2, 144, 85, 1}, {1, 100}},2000},
	{{"凝神（头部）等级3", {2, 144, 88, 1}, {1, 100}},2000},
	{{"凝神（衣服）等级3", {2, 144, 91, 1}, {1, 100}},2000},
	{{"凝神（下装）等级3", {2, 144, 94, 1}, {1, 100}},2000},
	{{"无间（头部）等级3", {2, 144, 97, 1}, {1, 100}},2000},
	{{"无间（衣服）等级3", {2, 144, 100, 1}, {1, 100}},2000},
	{{"无间（下装）等级3", {2, 144, 103, 1}, {1, 100}},2000},
	{{"无极（头部）等级3", {2, 144, 106, 1}, {1, 100}},2000},
	{{"无极（衣服）等级3", {2, 144, 109, 1}, {1, 100}},2000},
	{{"无极（下装）等级3", {2, 144, 112, 1}, {1, 100}},2000},
	{{"狂韧（头部）等级3", {2, 144, 115, 1}, {1, 100}},2000},
	{{"狂韧（衣服）等级3", {2, 144, 118, 1}, {1, 100}},2000},
	{{"狂韧（下装）等级3", {2, 144, 121, 1}, {1, 100}},2000},
	{{"凌锐（头部）等级3", {2, 144, 124, 1}, {1, 100}},2000},
	{{"凌锐（衣服）等级3", {2, 144, 127, 1}, {1, 100}},2000},
	{{"凌锐（下装）等级3", {2, 144, 130, 1}, {1, 100}},2000},
	{{"灵猿（头部）等级3", {2, 144, 133, 1}, {1, 100}},2000},
	{{"灵猿（衣服）等级3", {2, 144, 136, 1}, {1, 100}},2000},
	{{"灵猿（下装）等级3", {2, 144, 139, 1}, {1, 100}},2000},
	{{"海韵（头部）等级3", {2, 144, 142, 1}, {1, 100}},2000},
	{{"海韵（衣服）等级3", {2, 144, 145, 1}, {1, 100}},2000},
	{{"海韵（下装）等级3", {2, 144, 148, 1}, {1, 100}},2000},
	{{"海心（头部）等级3", {2, 144, 151, 1}, {1, 100}},2000},
	{{"海心（衣服）等级3", {2, 144, 154, 1}, {1, 100}},2000},
	{{"海心（下装）等级3", {2, 144, 157, 1}, {1, 100}},2000},
	{{"鹰袭（头部）等级3", {2, 144, 4, 1}, {1, 100}},1000},
	{{"怒吟（衣服）等级3", {2, 144, 7, 1}, {1, 100}},1000},
	{{"无量（下装）等级3", {2, 144, 10, 1}, {1, 100}},1000},
	{{"目冥（下装）等级3", {2, 144, 13, 1}, {1, 100}},1000},
	{{"灵心（头部）等级3", {2, 144, 64, 1}, {1, 100}},1000},
	{{"穿云（衣服）等级3", {2, 144, 67, 1}, {1, 100}},1000},
	{{"落日（衣服）等级3", {2, 144, 70, 1}, {1, 100}},1000},
	{{"狼啸（头部）等级3", {2, 144, 73, 1}, {1, 100}},1000},
	{{"止战（下装）等级3", {2, 144, 76, 1}, {1, 100}},1000},
}

tYunLing = {
	[1] = tYunLingLv1,
	[2] = tYunLingLv2,
--	[3] = tYunLingLv3,
}

function randYunLing1(tPara, szMsgTitle)
	randYunLing(1,tPara, szMsgTitle)
end

function randYunLing2(tPara, szMsgTitle)
	randYunLing(2,tPara, szMsgTitle)
end

function randYunLing3(tPara, szMsgTitle)
	randYunLing(3,tPara, szMsgTitle)
end

function randYunLing(nLevel,tPara, szMsgTitle)
	local t = tYunLing[nLevel]
	if t then
		return _MA_GiveRandItem(t, tPara, szMsgTitle, 1)
	end
end

tRingLingTu = {
--	{{"藏剑宝珠",{0,102,38,1}, {1, 100}},5000},
--	{{"藏剑奇石",{0,102,39,1}, {1, 100}},5000},
--	{{"藏剑金印",{0,102,40,1}, {1, 100}},5000},
	{{"东方龙珠",{0,102,24,1}, {1, 100}},1000},
	{{"大力神项链",{0,102,28,1}, {1, 100}},4500},
	{{"屈原之佩",{0,102,27,1}, {1, 100}},4500},
}

function randRingLingTu(tPara, szMsgTitle)
	return _MA_GiveRandItem(tRingLingTu, tPara, szMsgTitle, 1)
end

tRingHaoXia = {
	{{"盛世金宝箱", {2,94,12,1}, {1, 100}},100},
	{{"师门四套装备包", {2,95,856,1}, {1, 100}},300},
	{{"师门四套首饰包", {2,95,1163,1}, {1, 100}},300},
	{{"师门四套武器包", {2,95,1162,1}, {1, 100}},300},
	{{"7级灵石原石", {2,95,559,1,1}, {1, 100}},100},
	{{"灵石宝箱", {2,95,5435,10,1}, {1, 100}},1000},
	{{"五行秘籍", {0,107,155,1,1}, {1, 100}},100},
	{{"师门真卷残页", {2,96,176,1,1}, {1, 100}},500},
	{{"凌波微步残本", {2,95,146,1,1}, {1, 100}},150},
	{{"星辰碎片", {2,201,1,1,1}, {1, 100}},700},
	{{"陨铁碎片", {2,2,7,20,1}, {1, 100}},300},
	{{"陨铁", {2,2,8,10,1}, {1, 100}},500},
	{{"陨铁精石", {2,1,1009,5,1}, {1, 100}},250},
	{{"强化精石（12级）", {2,101,13,1,1}, {1, 100}},100},
	{{"军功章", {2,1,9999,10,1}, {1, 100}},200},
	{{"大军功章", {2,1,9998,1,1}, {1, 100}},100},
	{{"辉煌军功章", {2,1,9977,1,1}, {1, 100}},50},
	{{"金钱袋", {2,95,662,10,1}, {1, 100}},5000},
}
function randRingHaoXia(tPara,szMsgTitle)
	return _MA_GiveRandItem(tRingHaoXia, tPara, szMsgTitle, 1)
end

--比武大会宝箱
tBWDHBox_Free = {
	nNeedRoom = 1,
	tFix= {
		{2,200000,1},
		{1,"金钱袋",{2,95,662,1},0,1},	
		{1,"灵石宝箱",{2,95,5435,1},0,1},	
		{1,"天骄令",{2,97,236,3},0,1},			
	},
	tRand = {
		{{"师门真卷包裹", {2,95,617,1,4}, nil,nil, {1, 100}},500},	
		{{"技能石碎片", {2,1,10011,5,4}, nil,nil, {1, 100}},500},	
		{{"大军功章", {2,1,9998,1,4}, nil,nil, {1, 100}},1000},	
		{{"辉煌军功章", {2,1,9977,1,4}, nil,nil, {1, 100}},300},	
		{{"天罡令", {2,95,204,1,4}, nil,nil, {1, 100}},100},
		{{"陨铁", {2,2,8,1,4}, nil,nil, {1, 100}},1000},
		{{"千变梵天券", {2,95,247,1,4}, nil,nil, {1, 100}},1000},	
		{{"陨铁精石", {2,1,1009,5,4}, nil,nil, {1, 100}},500},	
		{{"师门圣物", {2,95,205,1,4}, nil,nil, {1, 100}},2000},	
		{{"灵石宝箱", {2,95,5435,5,4}, nil,nil, {1, 100}},500},	
		{{"耀阳碎片", {2,95,741,random(1,3),4}, nil,nil, {1, 100}},300},



	},
}

tBWDHBox_IB = {
	nNeedRoom = 2,
	tRequire = {"藏宝箱钥匙",2, 95, 52,20},
	tFix= {
		{2,1000000,1},
		{1,"降龙令",{2,95,5433,5},0,1},
	},
	tRand = {
		{{"盛世金宝箱", {2,94,12,1}, nil,nil, {1, 100}},300},
		{{"师门四套装备包", {2,95,856,1}, nil,nil, {1, 100}},300},
		{{"师门四套首饰包", {2,95,1163,1}, nil,nil, {1, 100}},300},
		{{"师门四套武器包", {2,95,1162,1}, nil,nil, {1, 100}},300},
		{{"7级灵石原石", {2,95,559,1,1}, nil,nil, {1, 100}},200},
		{{"灵石宝箱", {2,95,5435,10,1}, nil,nil, {1, 100}},700},
		{{"五行秘籍", {0,107,155,1,1}, nil,nil, {1, 100}},200},
		{{"星辰碎片", {2,201,1,1,1}, nil,nil, {1, 100}},800},
		{{"传功金丹" ,{2,95,5888,1}, 7,nil, {1, 100}},900},
		{{"师门真卷残页", {2,96,176,1,1}, nil,nil, {1, 100}},1000},
		{{"凌波微步残本", {2,95,146,8,1}, nil,nil, {1, 100}},300},
		{{"陨铁碎片", {2,2,7,20,1}, nil,nil, {1, 100}},300},
		{{"陨铁", {2,2,8,10,1}, nil,nil, {1, 100}},500},
		{{"陨铁精石", {2,1,1009,5,1}, nil,nil, {1, 100}},700},
		{{"强化精石（12级）", {2,101,13,1,1}, nil,nil, {1, 100}},200},
		{{"军功章", {2,1,9999,10,1}, nil,nil, {1, 100}},400},
		{{"辉煌军功章", {2,1,9977,1,1}, nil,nil, {1, 100}},100},
		{{"大军功章", {2,1,9998,1,1}, nil,nil, {1, 100}},200},
		{{"金钱袋", {2,95,662,10,1}, nil,nil, {1, 100}},700},
		{{randYunLing1, {1, nil, 7, nil}}, 900},
		{{randYunLing2, {1, nil, 7, nil}}, 500},
--		{{randYunLing3, {1, nil, 7, 1}}, 50},
		{{randRingLingTu, {1, nil, nil, nil}}, 100},
--		{{randRingHaoXia, {1, nil, nil, 1}}, 0.5},
	},
}

--师门封赏宝箱
tFactionBox_Free = {
	nNeedRoom = 2,
	tFix={
		{2,5000000,1},
--		{1,"7级灵石原石",{2,95,559,1},0,1},
	},
	tRand = {
		{{"贵宾虎纹卡（未激活）", {2,95,3451,1,1}, nil,nil, {1, 100}},50},
		{{"7级灵石原石", {2,95,559,1,1}, nil,nil, {1, 100}},400},
		{{"灵石宝箱", {2,95,5435,5,1}, nil,nil, {1, 100}},100},
		{{"灵石宝箱", {2,95,5435,10,1}, nil,nil, {1, 100}},100},
		{{"五行秘籍全本", {0,107,157,1,1}, nil,nil, {1, 100}},250},
		{{"师门真卷包裹", {2,95,617,1,1}, nil,nil, {1, 100}},300},
		{{"凌波微步残本", {2,95,146,1,1}, nil,nil, {1, 100}},300},
		{{"凌波微步残本", {2,95,146,2,1}, nil,nil, {1, 100}},100},
		{{"陨铁碎片", {2,2,7,50,1}, nil,nil, {1, 100}},250},
		{{"陨铁", {2,2,8,20,1}, nil,nil, {1, 100}},250},
		{{"陨铁精石", {2,1,1009,5,1}, nil,nil, {1, 100}},500},
		{{"月华水精", {2,201,7,1,1}, nil,nil, {1, 100}},100},
		{{"传功金丹" ,{2,95,5888,1}, 7,nil, {1, 100}},300},
		{{"陨铁精石", {2,1,1009,1,1}, nil,nil, {1, 100}},300},
		{{"陨铁精石", {2,1,1009,20,1}, nil,nil, {1, 100}},200},
		{{"强化精石（12级）", {2,101,13,1,1}, nil,nil, {1, 100}},200},
		{{"强化精石（13级）", {2,101,14,1,1}, nil,nil, {1, 100}},100},
		{{"金钱袋", {2,95,662,100,1}, nil,nil, {1, 100}},3800},
		{{randYunLing1, {1, 4, 7, nil}}, 1000},
		{{randYunLing2, {1, 4, 7, nil}}, 150},
--		{{randYunLing3, {1, 4, 7, 1}}, 50},
		{{randRingLingTu, {1, 4, nil, nil}}, 400},
--		{{randRingHaoXia, {1, nil, nil, 1}}, 1},
	},
}

tFactionBox_IB = {
	nNeedRoom = 2,
	tRequire = {"藏宝箱钥匙",2, 95, 52,100},
	tFix = {
		{2,10000000,1},
		{1,"7级灵石原石",{2,95,559,1},0,1},
		{1,"降龙令",{2,95,5433,50},0,1},
	},
	tRand = {
		{{"贵宾虎纹卡（未激活）", {2,95,3451,1,1}, nil,nil, {1, 100}},50},
		{{"7级灵石原石", {2,95,559,1,1}, nil,nil, {1, 100}},400},
		{{"灵石宝箱", {2,95,5435,100,1}, nil,nil, {1, 100}},100},
		{{"灵石宝箱", {2,95,5435,200,1}, nil,nil, {1, 100}},100},
		{{"五行秘籍全本", {0,107,157,1,1}, nil,nil, {1, 100}},250},
		{{"师门真卷包裹", {2,95,617,1,1}, nil,nil, {1, 100}},300},
		{{"凌波微步残本", {2,95,146,4,1}, nil,nil, {1, 100}},300},
		{{"凌波微步残本", {2,95,146,8,1}, nil,nil, {1, 100}},100},
		{{"陨铁碎片", {2,2,7,300,1}, nil,nil, {1, 100}},250},
		{{"陨铁", {2,2,8,200,1}, nil,nil, {1, 100}},250},
		{{"陨铁精石", {2,1,1009,20,1}, nil,nil, {1, 100}},500},
		{{"月华水精", {2,201,7,1,1}, nil,nil, {1, 100}},100},
		{{"传功金丹" ,{2,95,5888,1}, 7,nil, {1, 100}},300},
		{{"陨铁精石", {2,1,1009,50,1}, nil,nil, {1, 100}},300},
		{{"陨铁精石", {2,1,1009,100,1}, nil,nil, {1, 100}},200},
		{{"强化精石（12级）", {2,101,13,1,1}, nil,nil, {1, 100}},200},
		{{"强化精石（13级）", {2,101,14,1,1}, nil,nil, {1, 100}},100},
		{{"金钱袋", {2,95,662,100,1}}, 2850},
		{{randYunLing1, {1, nil, 7, nil}}, 1000},
		{{randYunLing2, {1, nil, 7, nil}}, 1500},
--		{{randYunLing3, {1, nil, 7, 1}}, 300},
		{{randRingLingTu, {1, nil, nil, nil}}, 300},
--		{{randRingHaoXia, {1, nil, nil, 1}}, 50},
	},
}

tChuanGongJinDan_IB = {
	nNeedRoom = 1,
	tRequire = {"聚宝徽章",2, 1, 1494,1},
	tFix = {
		{2,1000000,1},
	},
}

T_BOX = {
	[5892] = {tBWDHBox_Free, tBWDHBox_IB},				--比武大会宝箱
	[5893] = {tFactionBox_Free, tFactionBox_IB},			--师门封赏宝箱
	[5888] = {tChuanGongJinDan_IB},						--传功金丹
}

function OnUse(nItemIndex)
	onUse_Confirm(nItemIndex, 0)
end

function onUse_Confirm(nItemIndex, bConfirm)
	if GetItemGenre(nItemIndex)== ITEM_G and GetItemDetail(nItemIndex)==ITEM_D then
		local nP = GetItemParticular(nItemIndex)
		local tCfg = T_BOX[nP]
		if tCfg then
			if getn(tCfg) > 1 then
				Say(format("[%s]：选择开启方式：",GetItemName(nItemIndex),getn(tCfg)),
    				2,
    				format("\n免费开启/#onUse_Real(%d,%d,%d)", nItemIndex, 1, 0),
 --   				format("\n收费开启（20个藏宝箱钥匙）/#onUse_Real(%d,%d,%d)", nItemIndex, 2, 0),
    				"\n取消/nothing");
				return
			elseif getn(tCfg) == 1 then
				onUse_Real(nItemIndex, 1, 0)
				return
			end
		end
	end
end

function onUse_Real(nItemIndex, nOpenIndex, bConfirm)
	if GetItemGenre(nItemIndex)== ITEM_G and GetItemDetail(nItemIndex)==ITEM_D then
		local nP = GetItemParticular(nItemIndex)
		local tCfg = T_BOX[nP]
		if tCfg then
			local tNeed = tCfg[nOpenIndex].tRequire
			if tNeed and 1~= bConfirm then
				Say(format("开启[%s]需要<color=yellow>%d个[%s]<color>，你确定要打开吗？",GetItemName(nItemIndex),tNeed[5], tNeed[1]),
    			2,
    			format("\n确定/#onUse_Real(%d,%d,%d)", nItemIndex, nOpenIndex, 1),
    			"\n取消/nothing");
				return
			end
			local szFunc = format("onInputNumCallBack_%d_%d",nP, nOpenIndex)
			local nMax = GetItemCount(ITEM_G, ITEM_D, nP)
			AskClientForNumber(szFunc, 1, nMax, "输入打开数量")
		end
	end
end

function onInputNumCallBack_5892_1(nNum)
	onOpenBoxReal(nNum,5892,1)
end
function onInputNumCallBack_5892_2(nNum)
	onOpenBoxReal(nNum,5892,2)
end
function onInputNumCallBack_5893_1(nNum)
	onOpenBoxReal(nNum,5893,1)
end
function onInputNumCallBack_5893_2(nNum)
	onOpenBoxReal(nNum,5893,2)
end
function onInputNumCallBack_5888_1(nNum)
	onOpenBoxReal(nNum,5888,1)
end

function onOpenBoxReal(nNum, nParticular, nOpenIndex)
	local tCfg = T_BOX[nParticular]
	if tCfg then
		for i=1,nNum do
			if 1 ~= onOpenBoxReal_Once(nParticular, nOpenIndex) then
				break
			end
		end
	end
end

T_RUNTIME_STAT = {
	[5892] = {20, 5, },		--比武大会宝箱
	[5893] = {20, 7, },		--师门封赏宝箱
}

function onOpenBoxReal_Once(nParticular, nOpenIndex)
	local tCfg = T_BOX[nParticular]
	if tCfg then
		local tAward = tCfg[nOpenIndex]
		if tAward then
			local tNeed = tAward.tRequire
			if gf_JudgeRoomWeight(tAward.nNeedRoom, 100, "") ~= 1 then return end
			if tNeed  then
				if GetItemCount(tNeed[2], tNeed[3], tNeed[4]) < tNeed[5] then
					Talk(1, "", format("%s不足%d个。", tNeed[1], tNeed[5]))
					return 0
				end
				if DelItem(tNeed[2],tNeed[3],tNeed[4],tNeed[5]) ~= 1 then
					return 0
				end
--				Observer:onEvent(SYSEVENT_GLOBAL_COST_IB, {tNeed[2],tNeed[3],tNeed[4],tNeed[5]})
			end
			if DelItem(ITEM_G, ITEM_D,nParticular,1) ~= 1 then
				return 0
			end
			local tFixAward = tAward.tFix
			local szItemName = GetItemName(ITEM_G, ITEM_D,nParticular)
			local szLog = format("宝箱%s",szItemName,ITEM_G, ITEM_D,nParticular)
			if tFixAward then
				gf_EventGiveAllAward(tFixAward,"必出",szLog,nil);
			end
			local tRandAward = tAward.tRand
			if tRandAward then
				_MissionAward_RandAward(tRandAward, szLog)
			end
			
			local tStat = T_RUNTIME_STAT[nParticular]
			if tStat then
				AddRuntimeStat(tStat[1], tStat[2], nOpenIndex - 1, 1)
			end
			return 1
		end
	end
	return 0
end

function nothing()
end
