-- 门派类称号的物品脚本

START_INDEX = 23

tTab_chu =
{
	["index"] = 1,
--物品大类，副类，详细类别，流派，需要声望，称号名称，对应称号表内的大类，副类，持续时间(真实时间)，流派名
	[2] = 	{80,	"行者",		23,	1 ,	3600 * 24 * 30, "少林俗家"	  },
	[4] = 	{80,	"沙弥",		23,	2 ,	3600 * 24 * 30, "少林武僧"    },
	[3] = 	{80,	"苦行僧",	23,	3 ,	3600 * 24 * 30, "少林禅僧"    },
	[6] = 	{80,	"庄客",		23,	4 ,	3600 * 24 * 30, "唐门"        },
	[8] = 	{80,	"清心使"  ,	23,	5 ,	3600 * 24 * 30, "峨嵋佛家"    },
	[9] = 	{80,	"思曲使"  ,	23,	6 ,	3600 * 24 * 30, "峨嵋俗家"    },
	[11] = 	{80,	"执钵弟子",	23,	7 ,	3600 * 24 * 30, "丐帮净尧"    },
	[12] = 	{80,	"执棒弟子",	23,	8 ,	3600 * 24 * 30, "丐帮污尧"    },
	[14] = 	{80,	"清修道人",	23,	9 ,	3600 * 24 * 30, "武当道家"    },
	[15] = 	{80,	"清风道人",	23,	10,	3600 * 24 * 30, "武当俗家"    },
	[17] = 	{80,	"轻骑兵",	23,	11,	3600 * 24 * 30, "杨门枪骑"    },
	[18] = 	{80,	"穿杨手",	23,	12,	3600 * 24 * 30, "杨门弓骑"    },
	[20] = 	{80,	"夺魄散人",	23,	13,	3600 * 24 * 30, "五毒邪侠"    },
	[21] = 	{80,	"毒蚕散人",	23,	14,	3600 * 24 * 30, "五毒蛊师"    },
	[23] = 	{80,	"灵符道人",	23,	15,	3600 * 24 * 30, "昆仑天师"    },
	[25] = 	{80,	"金炉使",	23,	16,	3600 * 24 * 30, "明教圣战"    },
	[26] = 	{80,	"阵兵使",	23,	17,	3600 * 24 * 30, "明教阵兵"    },
	[27] = 	{80,	"暗爪使",	23,	18,	3600 * 24 * 30, "明教血人"    },
	[29] = 	{80,	"踏云仙子",	23,	19,	3600 * 24 * 30, "翠烟舞仙"    },
	[30] = 	{80,	"寻香仙子",	23,	20,	3600 * 24 * 30, "翠烟灵女"    },
	[31] = 	{80,	"游侠",	23,	21,	3600 * 24 * 30, "唐门任侠"    },
	[32] = 	{80,	"道童",	23,	22,	3600 * 24 * 30, "昆仑剑尊"    },
}

tTab_zhong =
{
	["index"] = 2,
--物品大类，副类，详细类别，流派，需要声望，称号名称，对应称号表内的大类，副类，持续时间(真实时间)，流派名
	[2] = 	{3000,	"混元僧",	24,	1 ,	3600 * 24 * 30, "少林俗家"	  },
	[4] = 	{3000,	"斗僧",		24,	2 ,	3600 * 24 * 30, "少林武僧"    },
	[3] = 	{3000,	"禅修僧",	24,	3 ,	3600 * 24 * 30, "少林禅僧"    },
	[6] = 	{3000,	"护卫",		24,	4 ,	3600 * 24 * 30, "唐门"        },
	[8] = 	{3000,	"羽衣使"  ,	24,	5 ,	3600 * 24 * 30, "峨嵋佛家"    },
	[9] = 	{3000,	"梵音使"  ,	24,	6 ,	3600 * 24 * 30, "峨嵋俗家"    },
	[11] = 	{3000,	"除奸弟子",	24,	7 ,	3600 * 24 * 30, "丐帮净尧"    },
	[12] = 	{3000,	"惩恶弟子",	24,	8 ,	3600 * 24 * 30, "丐帮污尧"    },
	[14] = 	{3000,	"入观道人",	24,	9 ,	3600 * 24 * 30, "武当道家"    },
	[15] = 	{3000,	"山阳道人",	24,	10,	3600 * 24 * 30, "武当俗家"    },
	[17] = 	{3000,	"校尉",		24,	11,	3600 * 24 * 30, "杨门枪骑"    },
	[18] = 	{3000,	"都尉",		24,	12,	3600 * 24 * 30, "杨门弓骑"    },
	[20] = 	{3000,	"催命散人",	24,	13,	3600 * 24 * 30, "五毒邪侠"    },
	[21] = 	{3000,	"蚀心散人",	24,	14,	3600 * 24 * 30, "五毒蛊师"    },
	[23] = 	{3000,	"秘法道人",	24,	15,	3600 * 24 * 30, "昆仑天师"    },
	[25] = 	{3000,	"暴杀使",	24,	16,	3600 * 24 * 30, "明教圣战"    },
	[26] = 	{3000,	"死士使",	24,	17,	3600 * 24 * 30, "明教阵兵"    },
	[27] = 	{3000,	"灭魂使",	24,	18,	3600 * 24 * 30, "明教血人"    },
	[29] = 	{3000,	"心舞仙子",	24,	19,	3600 * 24 * 30, "翠烟舞仙"    },
	[30] = 	{3000,	"探玉仙子",	24,	20,	3600 * 24 * 30, "翠烟灵女"    },
	[31] = 	{3000,	"无情杀手",	24,	21,	3600 * 24 * 30, "唐门任侠"    },
	[32] = 	{3000,	"炼剑道人",	24,	22,	3600 * 24 * 30, "昆仑剑尊"    },
}

tTab_gao =
{
	["index"] = 3,
--物品大类，副类，详细类别，流派，需要声望，称号名称，对应称号表内的大类，副类，持续时间(真实时间)，流派名
	[2] = 	{6000,	"伏魔金刚",	25,	1 ,	3600 * 24 * 30, "少林俗家"	  },
	[4] = 	{6000,	"护法罗汉",	25,	2 ,	3600 * 24 * 30, "少林武僧"    },
	[3] = 	{6000,	"传经法师",	25,	3 ,	3600 * 24 * 30, "少林禅僧"    },
	[6] = 	{6000,	"秘毒刺客",	25,	4 ,	3600 * 24 * 30, "唐门"        },
	[8] = 	{6000,	"紫竹使"  ,	25,	5 ,	3600 * 24 * 30, "峨嵋佛家"    },
	[9] = 	{6000,	"海月使"  ,	25,	6 ,	3600 * 24 * 30, "峨嵋俗家"    },
	[11] = 	{6000,	"四海侠"  ,	25,	7 ,	3600 * 24 * 30, "丐帮净尧"    },
	[12] = 	{6000,	"八袋弟子",	25,	8 ,	3600 * 24 * 30, "丐帮污尧"    },
	[14] = 	{6000,	"无我道人",	25,	9 ,	3600 * 24 * 30, "武当道家"    },
	[15] = 	{6000,	"闲云侠道",	25,	10,	3600 * 24 * 30, "武当俗家"    },
	[17] = 	{6000,	"奋武将军",	25,	11,	3600 * 24 * 30, "杨门枪骑"    },
	[18] = 	{6000,	"奋威将军",	25,	12,	3600 * 24 * 30, "杨门弓骑"    },
	[20] = 	{6000,	"黑无常"  ,	25,	13,	3600 * 24 * 30, "五毒邪侠"    },
	[21] = 	{6000,	"白无常"  ,	25,	14,	3600 * 24 * 30, "五毒蛊师"    },
	[23] = 	{6000,	"镇妖道人",	25,	15,	3600 * 24 * 30, "昆仑天师"    },
	[25] = 	{6000,	"护教使",	25,	16,	3600 * 24 * 30, "明教圣战"    },
	[26] = 	{6000,	"掌旗使",	25,	17,	3600 * 24 * 30, "明教阵兵"    },
	[27] = 	{6000,	"青冥使",	25,	18,	3600 * 24 * 30, "明教血人"    },
	[29] = 	{6000,	"秋月使",	25,	19,	3600 * 24 * 30, "翠烟舞仙"    },
	[30] = 	{6000,	"迎香使",	25,	20,	3600 * 24 * 30, "翠烟灵女"    },
	[31] = 	{6000,	"唐家杀手",	25,	21,	3600 * 24 * 30, "唐门任侠"    },
	[32] = 	{6000,	"妙玄道士",	25,	22,	3600 * 24 * 30, "昆仑剑尊"    },
}                                   

tTab_zuigao =
{
	["index"] = 4,
--物品大类，副类，详细类别，流派，需要声望，称号名称，对应称号表内的大类，副类，持续时间(真实时间)，流派名
	[2] = 	{10000,	"八部天龙",	26,	1 ,	3600 * 24 * 30, "少林俗家"	  },
	[4] = 	{10000,	"八宝罗汉",	26,	2 ,	3600 * 24 * 30, "少林武僧"    },
	[3] = 	{10000,	"无量法尊",	26,	3 ,	3600 * 24 * 30, "少林禅僧"    },
	[6] = 	{10000,	"天机使者",	26,	4 ,	3600 * 24 * 30, "唐门"        },
	[8] = 	{10000,	"白莲仙子",	26,	5 ,	3600 * 24 * 30, "峨嵋佛家"    },
	[9] = 	{10000,	"玉韵仙子",	26,	6 ,	3600 * 24 * 30, "峨嵋俗家"    },
	[11] = 	{10000,	"龙头神丐",	26,	7 ,	3600 * 24 * 30, "丐帮净尧"    },
	[12] = 	{10000,	"乞天神丐",	26,	8 ,	3600 * 24 * 30, "丐帮污尧"    },
	[14] = 	{10000,	"掌经道人",	26,	9 ,	3600 * 24 * 30, "武当道家"    },
	[15] = 	{10000,	"太乙散人",	26,	10,	3600 * 24 * 30, "武当俗家"    },
	[17] = 	{10000,	"龙骧将军",	26,	11,	3600 * 24 * 30, "杨门枪骑"    },
	[18] = 	{10000,	"虎翼将军",	26,	12,	3600 * 24 * 30, "杨门弓骑"    },
	[20] = 	{10000,	"幽冥鬼煞",	26,	13,	3600 * 24 * 30, "五毒邪侠"    },
	[21] = 	{10000,	"无恸罗刹",	26,	14,	3600 * 24 * 30, "五毒蛊师"    },
	[23] = 	{10000,	"紫微道人",	26,	15,	3600 * 24 * 30, "昆仑天师"    },
	[25] = 	{10000,	"逍遥神使",	26,	16,	3600 * 24 * 30, "明教圣战"    },
	[26] = 	{10000,	"天狂大将",	26,	17,	3600 * 24 * 30, "明教阵兵"    },
	[27] = 	{10000,	"月影魔尊",	26,	18,	3600 * 24 * 30, "明教血人"    },
	[29] = 	{10000,	"九天彩凤",	26,	19,	3600 * 24 * 30, "翠烟舞仙"    },
	[30] = 	{10000,	"冰心玉女",	26,	20,	3600 * 24 * 30, "翠烟灵女"    },
	[31] = 	{10000,	"鬼魅刺客",	26,	19,	3600 * 24 * 30, "唐门任侠"    },
	[32] = 	{10000,	"斩魔道人",	26,	20,	3600 * 24 * 30, "昆仑剑尊"    },
}

tItem =
{
	{2, 1, 1053, tTab_chu},		-- 掌门初级特封令
	{2, 1, 1054, tTab_zhong},	-- 掌门中级特封令
	{2, 1, 1018, tTab_gao},		-- 掌门高级特封令
	{2, 1, 1055, tTab_zuigao},	-- 掌门最高特封令
}

function GetPlayerSex()
	if GetSex() == 1 then
		return "少侠"
	else
		return "女侠"
	end
end

function OnUse(nidx)
	local nItemIndex = tonumber(nidx)
	local nGenre, nDetail, nParticular = GetItemInfoByIndex(nItemIndex)
	local nTabIndex = 0
	for index, value in tItem do
		if value[1] == nGenre and value[2] == nDetail and value[3] == nParticular then
			nTabIndex = index
			break
		end
	end
	
	if nTabIndex == 0 then
		return
	end
	SetTaskTemp(30, nTabIndex)
	local tTab = tItem[nTabIndex][4]
	
	local nRoute = GetPlayerRoute()
	if tTab[nRoute] == nil then
		Say("你当前还没加入门派选择派流路线，不能使用掌门特封令。", 0)
		return
	end
	Say("使用"..tTab[nRoute][6].."的掌门特封令需要你的门派威望值达到<color=yellow>"..tTab[nRoute][1].."<color>点才可以领取<color=green> "..tTab[nRoute][2].." <color>称号，你确定领取吗？", 2, "确定/yes_say", "暂时不用/no_say")
end

function yes_say()
	local nIndex = GetTaskTemp(30)
	local tTab = tItem[nIndex][4]
	local nRoute = GetPlayerRoute()
	
	local nExist = 0
	for i = 1, getn(tItem) do
		if IsTitleExist(i + START_INDEX - 1, tTab[nRoute][4]) > 0 then
			local t = tItem[i][4]
			nExist = t["index"]
			break
		end
	end
	
	if nIndex < nExist then
		Say("你的掌门特封令暂时不能领取门派称号！", 0)
	elseif nIndex == nExist then
		Say("不能领取<color=green> "..tTab[nRoute][2].." <color>称号。", 0)
	elseif GetTask(336) < tTab[nRoute][1] then
		Say(GetPlayerSex().."的门派威望值暂时不足以领取门派称号，请稍后再来！", 0)
	elseif nExist > 0 then
		Say("你确定使用<color=yellow> "..tItem[nExist][4][nRoute][2].." <color>来领取<color=green> "..tTab[nRoute][2].." <color>你的门派称号？", 2, "确定/#yes_change_title("..nIndex..")", "稍后再说/no_say")
	else
		yes_change_title(nIndex)
	end
end

function yes_change_title(nIndex)
	local tTab = tItem[nIndex][4]
	local nRoute = GetPlayerRoute()

	if DelItem(tItem[nIndex][1], tItem[nIndex][2], tItem[nIndex][3], 1) == 1 then
		-- 删除掉低级声望
		for i = START_INDEX, START_INDEX + getn(tItem) do
			RemoveTitle(i, tTab[nRoute][4])
		end
		local nGenre = tTab[nRoute][3]
		local nDetail = tTab[nRoute][4]
		local nTime = tTab[nRoute][5]
		AddTitle(nGenre, nDetail)
		SetTitleTime(nGenre, nDetail, GetTime() + nTime)
		AddTitleTime(nGenre, nDetail, 0)
		SetCurTitle(nGenre, nDetail)
		Msg2Player("你获得了"..tTab[nRoute][2].."称号！")
	end
end

function no_say()

end