-- ====================== 文件信息 ======================
-- 剑侠情缘onlineII 凤翔府NPC叶子秋Script
-- By StarryNight
-- 2007/06/13 AM 11:02
-- 心态，心态好重要，至少比女人重要。
-- ======================================================

function main()
	--一般情况下的对话
	local t_dia_sel = {
		"<color=green>叶子秋<color>：苍生有难，万物蒙尘，大道不兴，大义归隐，誓当潜心修道术，除污秽，降妖魔，天下自清明。",
		"<color=green>叶子秋<color>：昆仑一派，专志降妖伏魔，门派技艺皆以此为精。邪魔多藏于深山老林，不料中原江津村地频频出现伤人魔物，昆仑弟子怎可让奸邪为祸人间？",
		"<color=green>叶子秋<color>：中原向来猜忌偏远门派，但是也不能责怪他们，天下虽似太平，其实危机四伏，谨慎行事亦是情理之中。"
	}
	Talk(1,"",t_dia_sel[random(getn(t_dia_sel))])
	return
end;
